[
  {
    "name": "Phial of Galadriel",
    "lotr_page_id": "724",
    "text": "THE PHIAL OF GALADRIEL was given by Galadriel to Frodo Baggins as a\nlight to use in dark places.\n\n\nHistory\n\nThe Phial of Galadriel was a crystal phial filled with water from her\nfountain which held the light of Eärendil's star - the light of the Two\nTrees as preserved in a Silmaril.\n\nFrodo used the mere touch of it to ease the thought of the One Ring when\nhe, Sam Gamgee, and Gollum were watching the Witch-king lead his army\nout of Minas Morgul. He also used it while entering into Mordor to\ndefend himself from the spider Shelob. When Shelob first approached, Sam\nreminded him of the “star-glass” and its light drove her away. Frodo\ngave the light to Sam to hold while he cut through Shelob's webbing and\nSam wielded it when he attacked Shelob to rescue Frodo. The star-glass\nshone particularly bright in response to his indomitable spirit. He used\nit twice to get past the Two Watchers who guarded the tower of Cirith\nUngol; the second time the phial shone out lightning-bright in tribute\nto his hardiness and faithfulness.\n\n\n\nSam also attempted to use the light in the Crack of Doom but the light\nwas subdued by the power of the heart of Sauron's realm. The light was\none of the items found on him when he and Frodo were rescued by the\nEagles; Gandalf kept both it and Sam's box of Earth from Galadriel safe\nwhile the two hobbits were being healed after their collapse on the side\nof Mount Doom.\nThe Phial of Galadriel seemed to inspire its bearers to call out to\nElbereth, who is also known as Varda, as both Frodo and Sam call out in\nElvish. Frodo also cries out “aiya Eärendil elenion ancalima!” the first\ntime he uses it against Shelob. Although Frodo did not understand these\nwords, they were in reference to Eärendil, and they translate as “hail\nEärendil, brightest of stars!” from Quenya.\n\nAt the end of the Third Age, the Light of Earendil went to the Uttermost\nWest with Frodo.\n",
    "owner": "Galadriel, , Frodo Baggins",
    "creator": "Elves",
    "usage": "Served as light in dark places",
    "books": "_The Fellowship of the Ring_, , _The Return of the King_",
    "films": "_The Lord of the Rings: The Fellowship of the Ring_, , _The Lord of the Rings: The Return of the King_, _The Hobbit: The Battle of the Five Armies_"
  },
  {
    "name": "Barrow-blades",
    "lotr_page_id": "2543",
    "text": "The BARROW-BLADES, also known as DAGGERS OF WESTERNESSE, were daggers\nfrom theBarrow-downs, given by Tom Bombadil to the four hobbits of the\nFellowship.\n\n\nDescription\n\nThe Barrow-blades have long, leaf-shaped blades, which is damasked with\nserpent-forms in red and gold. Fiery stones are set on the strange, yet\nlight and strong, metal. The blades gleam and are made of marvelous\nworkmanship.\n\n\nHistory\n\n The\nBarrow-blades were found in the barrow of a Barrow-wight on the\nBarrow-downs and given to the hobbits by Tom Bombadil, who told them\nthat the blades were forged long ago by Men of Westernesse, foes of the\nDark Lord who were overcome by the evil king of Carn Dûm in the Land of\nAngmar.\n\nFrodo's sword broke in the confrontation with the Nazgûl on the banks of\nthe River near Rivendell and was replaced at Rivendell by Bilbo's gift\nof the elvish sword Sting. Sam, Merry, and Pippin kept their swords. The\nBarrow-blades carried by Merry and Pippin were taken and discarded when\nthe two hobbits were captured by Uruk-hai at Amon Hen, but Aragorn saved\nthem and they were returned when they were reunited at Isengard. Merry's\nBarrow-blade played a major role in the Battle of the Pelennor Fields.\nIt was enchanted with the power to harm the Witch-king of Angmar himself\nby a weaponsmith of Arthedain long before. When he stabbed the\nWitch-king in the knee with it, it distracted the Nazgûl and broke the\nspell binding his undead flesh to his will, allowing Eowyn to kill him\nby driving her sword into his unseen head, thus fulfilling the prophesy\nof Glorfindel that “not by the hand of man shall he fall.” Merry's\nBarrow-blade then burned away, a fate common to weapons brought into\ncontact with the Witch-king. The sword is approximately 30 inches long,\nso as to be wielded by Hobbit-folk.\n\nPippin also used his Barrow-blade to kill a Troll at the Battle of the\nBlack Gate, and afterwards refers to it as a Troll's bane. He later\nwielded this Barrow-blade during the Scouring of the Shire. Sam left his\nsword with Frodo after presuming him dead from an encounter with Shelob,\nand it was later taken from Frodo's body by Shagrat and delivered to\nBarad-dûr with Frodo's Mithril coat. Both were later recovered from the\nMouth of Sauron by Gandalf, who returned them to Frodo and Sam.\n",
    "owner": "Frodo Baggins, Samwise Gamgee, Peregrin Took, Meriadoc Brandybuck",
    "creator": "Númenoreans",
    "books": "_The Lord of the Rings_",
    "films": "_The Lord of the Rings_ film trilogy"
  },
  {
    "name": "Angrist",
    "lotr_page_id": "2538",
    "text": "ANGRIST was a knife made by Telchar of Nogrod and borne by Curufin, one\nof Fëanor's sons. It was taken from Curufin by Beren, who used it to cut\na Silmaril out of Melkor's Iron Crown. However, as he was attempting to\nremove a second Silmaril, the knife broke and it cut Melkor. \n\n\nHistory\n\nDuring the First Age, Beren and Lúthien encountered Celegorm and Curufin\nin the forest of Brethil. A fight ensued when the brothers attempted to\nkidnap Lúthien. Curufin's knife, Angrist, was taken by Beren. Later,\nduring the Quest for the Silmaril, Beren used Angrist to cut the\nSilmaril from Melkor's crown. As Beren was trying to cut a second\nSilmaril, however, the knife snapped and its shard grazed Melkor on the\ncheek, awakening him. Angrist was left behind when Beren escaped\nAngband.\n\n\nEtymology\n\nIn Sindarin, ANGRIST means “Iron-cutter”, from _ang_ (“iron”) and _ris_\n(“to cut”).\n\n\nOther versions of the legendarium\n\nThe blade is first described in _The Lays of Beleriand_ in several of\nthe poems and stories, where it had been forged by the Wicked dwarves of\nNogrod.\n\nIn later versions and the version published in _The Silmarillion_, this\nblade became Angrist, which was originally the blade of Curufin. It\nstill maintained its Dwarven heritage, further being described as having\nbeen forged by Telchar of Nogrod (in earlier versions he was of\nBelegost). Although the evil connotations of it being enchanted dark\nweapon or having  'betrayed' him were played down or removed in the\npublished version.\n\nIn earliest versions of the story the knife was once taken from the\nkitchens of Tevildo.\n\nBeren and Lúthien reintroduces both of these accounts (along with the\nreintroduction of the treacherous dwarves) to the 'complete story' as\ntold in the 2017 release.",
    "owner": "Curufin, Beren",
    "creator": "Telchar",
    "usage": "For cutting",
    "books": "_The Silmarillion_, _The History of Middle-earth_",
    "appearance": "Knife",
    "destroyer": "Beren/Morgoth, Angband, F.A. 466",
    "notable for": "Removing a Silmaril from the Iron Crown"
  },
  {
    "name": "Ringil",
    "lotr_page_id": "2553",
    "text": "RINGIL was the sword of Fingolfin, the High King of the Ñoldor.\n\n\nHistory\n\nThe sword was of elvish make. It bit with chilling cold, a blade that\nglittered like ice by the light of the stars. Fingolfin wielded it to\ngreat effect against Morgoth during their duel before the gates of\nAngband, wounding him seven times. However, he was slain by the Dark\nLord, who broke Fingolfin's neck with his foot. With his last breath,\nFingolfin hewed Morgoth's foot with Ringil, rendering him lame for the\nrest of his existence. Ringil's ultimate fate is unknown, it may have\nbeen broken by Morgoth's foot, or it could have been stolen, and then\nexperienced a similar fate to Glamdring and Orcrist. It is likely that\nneither Morgoth nor his subjects would wish to handle the blade, after\nthe grievous injury it dealt to Morgoth.\n\n\nEarlier versions of the legendarium\n\nBefore the tales that make up the Quenta Silmarillion evolved to their\nfinal versions, _Ringil_ was a name of one of the lamp-pillars erected\nby Melko (Melkor) during the days of the coming of the Valar into\nMiddle-earth - the name of the other pillar being _Helkar_. Melko\n(Melkor) made the two pillars, of ice, and from the light they melted,\neventually forming seas and lakes.\n\nIn the final account (the chapter “Of the Beginning of Days” of _The\nSilmarillion_), the two Lamps of the Valar themselves have names, and\nthey are Illuin and Ormal - and it is Aulë, Yavanna, and Manwë who\ninvent them. _Ringil_ remained only the name of Fingolfin's sword, and\nbears the same meaning as it had before.\n\n\nEtymology\n\nThe name _RINGIL_ may have come from the Quenya _ringa_ (“damp, cold,\nchilly”) or _ringi_ (“cold”).",
    "owner": "Fingolfin",
    "creator": "Elves",
    "books": "_The Silmarillion_, _The History of Middle-earth_"
  },
  {
    "name": "Pipe-weed",
    "lotr_page_id": "3131",
    "text": "PIPE-WEED (also known as HALFLINGS' LEAF) was grown and enjoyed much by\nthe hobbits of the Shire, to whom it was first introduced by a hobbit\nnamed Tobold Hornblower. It was first grown among hobbits by Tobold\nHornblower in Longbottom (a region in the Shire) around S.R. 1070 (TA\n2670). Despite its foreign origins, the hobbits (possibly those in Bree)\nwere the first to use it for smoking.\n\nPipe-weed production is a major industry there, especially in the south.\nIt was known among the Dúnedain as _sweet galenas_ for its fragrance.\n\n\n\nIn Gondor, it is known as '''Westman's-weed '''and grows as a wild\nplant, appreciated primarily for its sweet-scented flowers. The\ncolloquial name is in reference to its origins: it was apparently\nbrought to Middle-earth by Númenóreans during the Second Age.\n\nPopular varieties of pipe-weed include Longbottom Leaf, Old Toby (which\nis named after Tobold Hornblower), Southern Star, and Southlinch, which\nis grown in Bree.\n\nThe Wizard Gandalf learned to smoke\npipe-weed from the hobbits and is known to blow elaborate smoke-rings.\nSaruman initially derided him for this, but at some point he took up\nsmoking himself. After the destruction of Isengard, pipe-weed was found\namong its stores, but the hobbits Merry and Pippin failed to realized\nthe sinister implications of the discovery that Saruman has had commerce\nwith the Shire.\n\n\nSee Also\n\n\n\n-   Old Toby (disambiguation)\n-   Athelas\n\nde:Pfeifenkraut it:Erba Pipa ru:Трубочное зелье",
    "other_names": "Halfling's Leaf, Westman's Weed, Longbottom Leaf, Sweet Galenas, etc.",
    "owner": "Many unspecified Hobbits, Gandalf, Aragorn, Merry, Pippin, Saruman, et., al.",
    "creator": "Hobbits of the Shire, Gondorians, Dúnedain, et. al.",
    "usage": "For smoking in a pipe",
    "books": "The Fellowship of the Ring, The Two Towers, The Return of the King.",
    "films": "The Fellowship of the Ring, The Two Towers, The Return of the King."
  },
  {
    "name": "Horn of Gondor",
    "lotr_page_id": "6369",
    "text": "The HORN OF GONDOR is a horn that Boromir carried with him during the\nevents in _The Fellowship of the Ring _novel.\n\n\nHistory\n\nIt was a large war-horn and tipped with silver written in ancient\ncharacters. Boromir blew it before leaving Rivendell with the\nFellowship, as he always did when setting out on a journey. He sounded\nit again in Moria, causing the Orcs and even the Balrog to pause in\ntheir advance. The third time he blew it was on the banks of Parth\nGalen, calling for help in defending Meriadoc Brandybuck and Peregrin\nTook. This last call, in addition to being heard by Aragorn, Legolas,\nand Gimli, was faintly heard by his brother Faramir and his father\nDenethor II. The horn was broken into two pieces during Boromir's last\nfight with the Orcs and Uruk-hai of Saruman at Amon Hen.\n\nAn heirloom of the house of the Stewards of Gondor, the Horn of Gondor\nhad been carried by the eldest son for generations. The horn was crafted\nbefore the line of the Kings of Gondor was broken, when \"Vorondil the\nHunter father of Mardil Voronwë hunted the wild Kine of Araw in the far\nfields of Rhûn. The story surrounding the horn mentioned that it was\nmade from the horn of \" the wild ox of the East \" and that “if it be\nblown at need anywhere within the bounds of Gondor, as the realm was of\nold, its voice will not pass unheeded.”\n\n\n\nThe Horn of Gondor was not present in Faramir's vision of his dead\nbrother in the boat from Lórien. However, when Gandalf and Pippin arrive\nin Minas Tirith, the broken horn was being held by Denethor II,\nBoromir's father.",
    "other names": "Horn of Boromir",
    "owner": "Vorondil and descendants up until Boromir",
    "notable for": "Can be heard anywhere in Gondor",
    "appearance": "White horn tipped with silver",
    "creator": "Vorondil, c. 20th century, Third Age",
    "destroyer": "Uruk-hai, Amon Hen, 26 February T.A. 3019"
  },
  {
    "name": "Dragon-helm of Dor-lómin",
    "lotr_page_id": "8111",
    "text": "The DRAGON-HELM OF DOR-LÓMIN, also known as the DRAGON OF DOR-LÓMIN,\nDRAGON-HEAD OF THE NORTH, and the HELM OF HADOR, was a formidable\nDwarven war helmet from the First Age. It was most notably associated\nwith Túrin.\n\n\nDescription\n\n\n\nThe appearance of the helm was magnificent, adorned by Gold, on the\nbackground of Grey steel. At the top of the helm, the armor bore the\nsculpture of the Dragon, Glaurung, The Deceiver. The helm also had a\nvisor, “in the style of most dwarven armor.” The armor struck fear into\nthe hearts of the enemies of the wearer.\n\n\nHistory\n\nThe Dragon Helm is the ancient Dwarven-crafted war helm crafted by the\nDwarf-smith Telchar of Nogrod for the lord of Belegost, Azaghâl. Azaghâl\nthen gave it to Maedhros as a gift, who eventually passed it on to\nFingon. From then on, it remained in the keeping of the High Kings of\nthe Ñoldor that then passed it on to the Men who settled in Dor-lómin.\n\nThe helm was given to Túrin Turambar by his foster father, Thingol\nsometime between FA 463 and FA 473, and from Túrin's mother, Morwen, he\nhad received it. Since the helm was an heirloom in the House of\nHador, it is sometimes referred to as the Helm of Hador. However, Húrin\nwas not of the stature as the rest of his elders. He could not wear the\nHelm comfortably because he was of lesser stature than his forefathers.\nHe also said he preferred to look at the enemy with his own eyes.\n\nTúrin, however, was of greater stature than his father was and was able\nto unlock the magical properties of the ancient helm. It had the ability\nto protect the wearer from any harm or wound, major or minor: _“A power\nwas in it that guarded any who wore it from wound or death, for the\nsword that hewed it was broken, and the dart that smote it sprang\naside.”_",
    "other names": "Helm of Hador",
    "creator": "Telchar, Nogrod, c. F.A. 260",
    "appearance": "Visored steel helm, embelished with gold and runes, bearing a crest in, the image of the head of Glaurung",
    "gallery": "IMAGES OF THE DRAGON-HELM OF DOR-LÓMIN",
    "owner": "Azaghâl, Maedhros, Fingon, Hador, Galdor, Húrin, Túrin"
  },
  {
    "name": "Elfstone",
    "lotr_page_id": "10528",
    "text": "The ELESSAR or ELFSTONE was a green gem set on a silver eagle-shaped\nbrooch. It had the light of the Sun within it and those who looked\nthrough it saw everything that was aged and withered as young once more.\n\n\nOrigins\n\nThe elfstone was crafted by an elven-smith in Gondolin named Enerdhil,\nwhose skill in jewel-crafting was second only to Feanor. He gave it to\nIdril which she bore upon her breast during the fall of Gondolin,\naccounting for its escape, and in turn she gave it to her son Eärendil,\nwho bore it upon his breast on his flight to the Undying Lands.\n\nTwo versions are hereafter recorded as to the fate of the stone.\n\n-   Olorin brings the stone to Middle-earth as a sign that the Valar had\n    not forsaken Middle-earth. He gave it to Galadriel but he prophesied\n    that, “...it is not for you to possess. You shall hand it on when\n    the time comes. For before you grow weary, and at last forsake\n    Middle-earth one shall come who is to receive it, and his name shall\n    be that of the stone: Elessar he shall be called.”  (Aragorn, son\n    of Arathorn II).\n-   The stone remains with the Valar, and Galadriel longs to once more\n    return to Valinor but remains under the ban of the Noldor. Thus she\n    turns to Celebrimbor and laments to him, “I am grieved in\n    Middle-earth, for leaves fall and flowers fade that I have loved so\n    that the land of my dwelling is filed with regret that no spring can\n    redress. I would have trees and grass about me that do not die -\n    here in the land that is mine.” Celebrimbor, who is in love with\n    her, remakes the jewel and gives it to her. He learned the art of\n    elven blacksmithing in Gondolin when he was a friend of Enerdhil and\n    ever his friendly, competitive rival. Galadriel then passes the\n    stone to her daughter Celebrian, who in turn gives it to her\n    daughter Arwen. Galadriel keeps it once more in Lothlorien to pass\n    it on to Aragorn.\n",
    "other_names": "Elessar",
    "owner": "Aragorn, Arwen, Enerdhil, Galadriel, et. al.",
    "creator": "Enerdhil",
    "books": "The Lord of the Rings",
    "films": "The Lord of the Rings"
  },
  {
    "name": "Key to the Side-door",
    "lotr_page_id": "22040",
    "text": "The KEY TO THE SIDE-DOOR was a small curious-looking silver key with a\nlong barrel. It was used to open the secret entrance to the Lonely\nMountain, and for it there was a hidden keyhole.\n\n\nHistory\n\nLike the map, the key was made at an unknown time by Thrór and his son\nThráin before the fall of the Lonely Mountain. It was kept by Thrór and\nthen Thráin with the map. When Thráin was captured by the Necromancer,\nit was given to Gandalf in TA 2850 by Thráin just before he died in the\ndungeons of the Necromancer. The key and the map was presented to\nThorin the day that he and his fellow Dwarves visited Bilbo at Bag End\nin late April, 2941, and from that moment he kept it fastened to a chain\naround his neck.\n\nWhen Thorin and Company were at the place of Side-door, time began to\npass and the Sun began to fall and the Moon appeared and a hole appeared\nabout three feet from the ground. As the Dwarves attempted to force the\nrock without success, Bilbo suddenly remembered the key Gandalf gave\nThorin and told Thorin to use it to open the door before the light\ndisappeared that revealed it. Thorin took the key and put it in the\nkeyhole which caused the door-cracks to appear and the door to open.\n\n\nRunes\n\nIn _The Hobbit: An Unexpected Journey_, the key is ornately wrought and\nwith Dwarven runes written on both sides of the shaft. When translated,\nthese runes read “Durins Heir”, and are a reference to Thorin's\nancestor, Durin the Deathless.\n",
    "owner": "Thror, , Thráin II, Thorin II Oakenshield",
    "creator": "Dwarves",
    "usage": "To open the side-door of Lonely Mountain",
    "books": "_The Hobbit_",
    "films": "__The Hobbit_ films_"
  },
  {
    "name": "Ring of Thrór",
    "lotr_page_id": "37457",
    "text": "The RING OF THRÓR was the mightiest of the seven dwarven rings.\n\n\nBackground\n\nThe RING OF THRÓR was the first of the Seven Dwarf-rings to be forged,\nand the last to be recovered by Sauron.\n\nWhile Sauron himself gave the Dwarves their Rings of Power, this one was\noriginally given to King Durin III of Khazad-dûm by Celebrimbor, and it\nremained in his line for thousands of years until it was inherited by\nThrór, the King under the Mountain.\n\nIt was during Thrór's reign that Smaug descended on Lonely Mountain and\ndrove the Dwarves into exile. Long after his kingdom's destruction,\nThrór passed the ring to his son Thráin, who dwelt for many years as an\nexile from his ancient home.\n\nAt last, Thráin set out on an ill-fated quest to regain his kingdom, but\nhe was captured by the spies of Sauron, and the Ring of Thrór was lost\nforever.\n\nMany Dwarves however did not know the fate of the Ring, and thought that\nit was lost in Moria when Thrór was killed by Azog. It was thought that\none of the reasons Balin wished to reclaim Moria was to find the Ring.\nIn the Council of Elrond, Gandalf told Glóin that Balin would not find\nthe Ring there, as it was given to Thráin and lost in Dol Guldur.\n",
    "owner": "Durin III, other Kings of Durin's Folk, Thrór, Thráin II",
    "creator": "Celebrimbor",
    "usage": "Amplified their wearer's natural skills and desire of dominion; the, power to multiply whatever they mined",
    "books": "_The Lord of the Rings_",
    "films": "_The Hobbit films_"
  },
  {
    "name": "Morgul-blade",
    "lotr_page_id": "2551",
    "text": "MORGUL-BLADES, also called “Morgul-knives”, were magical and poisonous\ndaggers that were used by the Ringwraiths during the Third Age. After\nhaving tasted flesh, the dagger breaks, leaving a shard of the blade in\nits victim. The remaining blade soon turns to dust, and the shard works\nits way through the body to the heart. If the shard of the blade stays\nin the victim for too long, the victim becomes a wraith.\n\n\nHistory\n\n\n\nSince they are just short daggers, Morgul Blades may not have been very\neffective in battle. The blade might have been reserved for Mordor's\ngreatest enemies or for use as a punishment.\n\nFrodo himself was stabbed by a Morgul Blade at Weathertop by The\nWitch-king of Angmar. A fragment of the blade remained within Frodo's\nwound, working its way toward his heart and threatening to turn Frodo\ninto a wraith. Elrond was able to remove the shard and heal the wound,\nbut each year on the anniversary of receiving the wound Frodo became\nseriously ill. Only his eventual departure to Eldamar, also known as the\nUndying Lands, offered a permanent cure.\n\n\n\n_Athelas_ (or _Kingsfoil_) is known to slow the poisonous effect of the\nMorgul-blade, though true healing (usually Elven healing) is necessary\nin order to fully cure a victim. This remedy is also known to heal other\nMordor-associated illnesses, like the Black Breath of the Ringwraiths.\n",
    "other_names": "Morgul-knives",
    "owner": "Nazgûl",
    "books": "_The Lord of the Rings_",
    "films": "The Lord of the Rings trilogy, The Hobbit trilogy",
    "notable for": "Injuring Frodo"
  },
  {
    "name": "Simbelmynë",
    "lotr_page_id": "6747",
    "text": "SIMBELMYNË, also named EVERMIND, was a white flower that grew in Rohan,\nprimarily on the grave mounds of the Kings of Rohan, and most abundantly\non the burial mound of Helm Hammerhand.\n\n\nHistory\n\nDuring Tuor's arrival in Gondolin, he found these flowers and named them\n_UILOS_. These flowers also grew on Elendil's tomb in Amon Anwar, and\nwere there called _ALFIRIN_. Legolas also uses the name _alfirin_ (as\nwell as _mallos_) to refer to an apparently different type of flower,\ndescribed as “golden bells”, which could be found in Lebennin.\n\n\nEtymology and Inspiration\n\n_SIMBELMYNË_ is an Old English term which means “ever-mind” and was the\nterm used commonly in Rohan. The Elves called the same flower _uilos_\n(“snow white”) and _alfirin_ (“not mortal” ).\n\nThis flower was inspired by wood anemone (Anemone nemorosa), a European\nflower of the buttercup family. Tolkien stated this in _Nomenclature of\nThe Lord of the Rings_.\n",
    "other_names": "Evermind, Uilos, Alfirin"
  },
  {
    "name": "Iron Crown",
    "lotr_page_id": "3308",
    "text": "The IRON CROWN was forged by Morgoth in Angband, after his return to\nMiddle-earth at the beginning of the First Age, to hold the Silmarils\nand to symbolize him as King of the World.\n\n\nHistory\n\nThe three Silmarils were set into the Crown, fastened by iron claws. In\nthe Quest for the Silmaril, as told in the tale “Of Beren and Luthien”,\nBeren pried one Silmaril loose from the crown using his knife.  After\nMorgoth's defeat in the War of Wrath, the other two jewels were removed,\nand the crown was beaten into a collar for his neck.\n\nIn the Third Age, during the Witch-king's campaign against Arnor, he\nwore an Iron Crown, and his supporters often called him “The Iron Crown”\nor “The King of the Iron Crown”."
  },
  {
    "name": "Nimphelos",
    "lotr_page_id": "3436",
    "text": "Nimphelos was the greatest of the pearls that Thingol gave to the\nDwarves of Belegost in payment for their service in the building of\nMenegroth. Pearls were especially valuable to the Dwarves as they were\nnot fond of the sea and had no means of acquiring them except through\ntrade.\n\nNimphelos was said to have been the size of a dove's egg. It was\noriginally given to Thingol by Círdan the shipwright. It was found by\nthe Falathrim of the Isle of Balar.\n\n\nEtymology\n\nThe first part of the name “Nim” means white in Sindarin. “Phelos”\nlikely means pearl."
  },
  {
    "name": "Nivrim",
    "lotr_page_id": "3443",
    "text": "NIVRIM also known as OAK FOREST was one of the Forests of the Elven\nrealm of Doriath.\n\nNivrim was situated west of Region, southeast of Amon Rûdh, north of\nAelin-uial, south of the southeastern edge of Brethil, and was located\nwithin the Girdle of Melian. Both it and the forest of Region were\njoined by a bridge crossing the Sirion near where the river Esgalduin\njoined with it.\n\n\nHistory\n\nThe forest was loved by Queen Melian who dedicated it in honor of the\nVala Ulmo and that it should be in the power of the realm of Doriath\nproper, thus placing it within the Melian's protective barrier. Its\nfate was ultimately the fate of Doriath's as when Melian left\nMiddle-earth, it was left unprotected and wide-open to its enemies\nand finally destroyed and the end of the War of Wrath.\n\nThe forest was mainly a forest of oak trees hence the other name “Oak\nForest.”\n\n\nEtymology\n\n_Nivrim_ was Sindarin word that meant 'West March'."
  },
  {
    "name": "Book of Mazarbul",
    "lotr_page_id": "8793",
    "text": "The BOOK OF MAZARBUL was begun in TA 2989, upon Balin's return to Moria.\nThe book recounted the expedition's experiences within Moria, including\na battle with the Orcs that inhabited the old halls of Khazad-dûm, in\nwhich Balin's Dwarves were victorious. They settled in the Twenty-first\nHall, above the East-gate, and Balin himself ruled his new domain from\nthe old Chamber of Records, also called the Chamber of Mazarbul. Over\nthe next five years, the Dwarves seem to have settled quite successfully\ninto their new home, exploring under the Mountains as far as the\nWest-gate of Moria, recovering Durin's Axe and apparently other\npriceless items made of Mithril.\n\nThe Lordship of Balin was short-lived. Ori, who was with him in Moria,\nrecorded in the last pages of the Book how an army of Orcs came\nunexpectedly out of the east, slaying Balin outside the East-gate. The\nDwarves defended themselves, but they were beleaguered from the east by\nthe Orcs and from the west by the mysterious Watcher in the Water. Their\nlast stand was in the Chamber of Mazarbul, where the Orcs eventually\novercame and destroyed them.\n\nThe victorious Orcs seem not to have understood the significance of the\nBook, so that rather than carrying it off or destroying it, they left it\nto rot in the Chamber. There it was found twenty-four years later by the\nCompany of the Ring, burned, slashed and blood-stained, and missing a\nnumber of pages, but still readable in some parts. Gandalf passed it to\nGimli to return to King Dáin, after which nothing more is said of it.\n\n\nText in the Book\n\nPage 1\n\n_We drove out the orcs from the Great Gate and guardroom and took the\nFirst Hall. We slew many in the bright sun in the dale. Flói was killed\nby an arrow. He slew the great chieftain. We buried…Flói under grass\nnear Mirrormere…came…ken we repaired…We have taken the Twenty-first Hall\nof North End to dwell in. There is good air…that can easily be\nwatched…the shaft is clear…Balin has set up his seat in the Chamber of\nMazarbul…gathered…gold…wonderful lay Durin’s Axe and…silver helm. Balin\nhas taken them for his own. Balin is now lord of Moria:…today we found\ntruesilver…well-forged helm…made all of purest mithril…Óin to seek for\nthe upper armories of the Third Deep…go westwards to s…to Hollin Gate._\n\nPage 2\n\n_…years since…ready sorrow…yesterday being the tenth of November Balin,\nlord of Moria, fell in Dimrill Dale. He went alone to look in\nMirrormere. An orc shot him from behind a stone. We slew the orc, but\nmany more came…up from east up the Silverlode…we rescued Balin’s\nbody..after a sharp battle…we have barred the gates but doubt if…we can\nhold them long. If there is…no escape it will be a horrible fate to\nsuffer, but I shall hold._\n\n\n\nPage 3\n\n_We cannot get out. We cannot get out. They have taken the bridge and\nSecond Hall. Frár and Lóni and Náli fell there bravely while the rest\nretreated to the Chamber of…Mazarbul. We are still ho{ldin}g...but hope\n…Óin's party went five days ago but today only four returned. The pool\nis up to the wall at West-gate. The Watcher in the Water took Óin--we\ncannot get out. The end comes soon. We hear drums, drums in the deep.\nThey are coming.”"
  },
  {
    "name": "Troll's bane",
    "lotr_page_id": "9180",
    "text": "TROLL'S BANE was the name of the sword used by\nPeregrin Took after he killed the Troll-chief at the Battle of the\nMorannon during the War of the Ring. Pippin gained this sword after he\nbecame guard of the citadel in Minas Tirith."
  },
  {
    "name": "Black Axe",
    "lotr_page_id": "19704",
    "text": "The BLACK AXE was a great axe used by Gothmog, the Lord of Balrogs in\nbattle.\n\n\nHistory\n\nThe axe was infamous for striking down Fingon, the fourth High King of\nthe Ñoldor in the Nirnaeth Arnoediad. It was probably lost in the\nFountain of the King after Gothmog and Ecthelion slew each other in the\nSquare of the Palace during the Fall of Gondolin."
  },
  {
    "name": "Gimli's battle axe",
    "lotr_page_id": "19089",
    "text": "GIMLI'S BATTLE AXE was the weapon that he used throughout the series.\n\nIt is not seen with him before the Fellowship entered the Mines of Moria\nso it is most likely that he picked it up in The Chamber of Mazarbul.\n"
  },
  {
    "name": "Samwise Gamgee's sword",
    "lotr_page_id": "18488",
    "text": "Samwise Gamgee obtained his SWORD in the Barrow Downs from the tomb\nof the Barrow-wight. It is with this sword that Sam would kill his first\nOrc. As the sword came from the Barrow Downs, it was “woven with spells\nfor the bane of Mordor.”\n"
  },
  {
    "name": "Magic Rings",
    "lotr_page_id": "15703",
    "text": "_“The lesser rings were only essays of the craft before it was\nfull-grown, and to the Elven-smiths they were but trifles...”_\n\n''- ''Gandalf in _The Fellowship of the Ring_, “Shadow of the Past”\n\n\n\nMAGIC RINGS are only mentioned a handful of times in _The Lord of the\nRings_; magic rings, or lesser rings, are rings with magic powers\n(powers unidentified), but less potent. They were made around the same\ntime as the Rings of Power and there were, presumably, many of them\nsince “In Eregion long ago many Elven-rings were made” and there are\nonly twenty Rings of Power, unless twenty is considered “many” rings.\nGandalf states that though the Elves who forged them thought little of\nthem, he still thinks they are dangerous for mortals.\n\nThey are lesser rings of the Rings of Power, forged by the Elves as\n“essays in the craft”- they bore no gem (similar to the One Ring).\n\n\nHistory\n\nIn the ancient days of the Second Age, before the Fall of Númenor, many\nrings were forged, the craft being taught by Sauron. These rings aided\nin the use of spells and magical craft, and thus were widely popular\nwith the Elves. Sauron, then known as “Lord of the Gifts” claimed he\nwished to make Middle-earth as fair as Valinor, and it seemed he\nconvinced the elves to think these rings could do so.\n\nAfter the forging of the One Ring, Sauron began drawing these lesser\nrings to himself. This was not difficult, for the One Ring gave him the\nstrength to subdue the wielders of these powerful artifacts. Once\ngathered, Sauron could disperse them among his captains, making them all\nmighty champions whom he could back up at will with his own strength via\nthe magic ring connection. After the Last Alliance of Elves and Men and\nthe First Fall of Sauron, these rings were dispersed through the land.\nSome were taken from dead warriors, others, borne away by the\nfrightened, still living servants of Sauron, others were lost and little\nis known of what happened to them until the War of the Ring.\n\nAt the time of the War of the Ring, Sauron gathered again the lesser\nrings to himself. But this time, he kept a great deal of them so as to\nadvance his own abilities. Though not stated in the books or movies, it\nseems reasonable to believe that some were given again to his commanders\nas well, and logically some were lost or destroyed before they could be\nreclaimed. \n\nTheir ultimate fates are unknown, nor is it known whether or not their\npowers were bound to the power of the One Ring. If they were, then their\npower would have failed with the destruction of the One.\n\n\nPowers\n\nThe full extent of the rings' power is unknown, but Gandalf says that\n“none are to be used lightly”. They were, to an extent, like the One\nRing when it came to temptation. They would give a being strength,\nmagical ability, and the power to dominate other wills.\n\nIt is also believed (though again, not stated) that these rings also had\ncertain fields in which they were strongest. For example, one ring may\nrule over stone, while another controls ice. This, however, is not known\nfact, and only stems from what is known about the Rings of Power,\nassuming that the lesser rings are much like them."
  },
  {
    "name": "Bilbo's Mithril Shirt",
    "lotr_page_id": "15408",
    "text": "BILBO'S MITHRIL SHIRT was a shirt of chain mail, alternately described\nas a vest and a coat, made from mithril. It was moved several times\nduring the course of the series, from Smaug's hoard to Bilbo to the\nMathom-house to Frodo. It was taken by the Orcs of Cirith Ungol from\nFrodo, but was later with the Mouth of Sauron, as he showed it to\nGandalf, Aragorn, and the other leaders outside the Morannon in the\nBattle of the Black Gate. It was later returned to Frodo.\n\n\nHistory\n\nThe origins of the shirt are largely unknown, though it was said to have\nbeen made for a young Elf prince long ago. It eventually came to be part\nof the Dwarven treasure hoard of the Lonely Mountain. It was found by\nthe dragon Smaug and added to his treasure heap. Here, it was given by\nThorin II Oakenshield to the Hobbit Bilbo Baggins, who wore it during\nthe Battle of Five Armies. After returning to the Shire, Bilbo loaned\nthe shirt to the Mathom-house. Before departing the Shire for Rivendell,\nBilbo reclaimed the shirt and wore it on that journey.\n\nMany years later it was given by Bilbo to his nephew Frodo Baggins as\nFrodo set out on his quest to Mount Doom to destroy the One Ring. Frodo\nwore the chain shirt under his tunic unknown to the rest of the\nFellowship. It was discovered when, during a skirmish in the mines of\nMoria, an Orc chieftain stabbed Frodo with a spear. The shirt\nprevented what would have been a lethal wound, leaving Frodo badly\nbruised but otherwise uninjured.\n\nThe shirt was confiscated from Frodo in the Tower of Cirith Ungol. The\ntwo squadrons of orcs that captured Frodo fought over the valuable\nshirt, and most were killed during the conflict. One of the two Orc\nleaders, Shagrat, survived the fight and seized the shirt, escaping the\ntower with it. The shirt eventually ended up in the possession of the\nMouth of Sauron at Barad-dûr, where he presented it to Gandalf at the\nBlack Gates as false evidence that Frodo had failed in his quest. In his\nwrath Gandalf retrieved the shirt. The wizard later returned it to Frodo\nafter the destruction of the Ring.\n\nit:Cotta di Mithril"
  },
  {
    "name": "Ent-draughts",
    "lotr_page_id": "11511",
    "text": "The ENT-DRAUGHTS were the mysterious drafts of the Ents and possibly\ntheir primary source of nourishment in Fangorn forest.\n\n\nHistory\n\nNothing much is known about the contents of these drinks, only that they\nwere made from the river-water and possibly mixed with other things.\nThey also came in two different varieties: one that refreshes and one\nthat nourishes. They are known to have been kept in large stone jars and\nthen ladled out into large bowls. After drinking them, the Ents\npreferred to lie down so that the drink would not rise immediately to\ntheir heads.\n\nThe only known recorded time that they were given to anyone outside the\nEnts was when Merry and Pippin took them during their time in Fangorn\nforest. As a result of them drinking the draughts, they grew into the\nlargest hobbits in the Shire, adding at least two to three inches to\ntheir overall height."
  },
  {
    "name": "Orc draught",
    "lotr_page_id": "12793",
    "text": "ORC DRAUGHT was a burning liquid used by the forces of the Dark Lord\nSauron. It seems to have effects such as renewing the strength and\nwarmth of the drinker and healing wounds and injuries. The Uruk-hai\nleader Uglúk forced some to a wounded Meriadoc Brandybuck and Peregrin\nTook while they were being taken from Amon Hen to Saruman the White in\nIsengard. Later, Frodo Baggins had the liquid forced down his throat\nwhile recovering from the wound he received from Shelob. Its colouring,\nalong with the orcs' reputation of being eaters of human flesh, implies\nthat the draught may contain blood, human or otherwise. Also implied by\nthe burning sensation perceived by those who drink it, the perceived\n“warmth” and the numbing of pain (“healing injuries”) implies that it\nmay be alcoholic in some way.\n\nReal-world examples of laborers and soldiers imbibing in narcotics that\nlessened pain and fatigue (such as hashish for the Hashishin \nof the Middle East, khat in Arabia and Africa, kava kava and kratom in\nSoutheast Asian countries, etc) lend credence to the idea that the orcs\nwould have some kind of substance created to give them an edge on the\nmarch or in battle."
  },
  {
    "name": "Keys of Orthanc",
    "lotr_page_id": "13027",
    "text": "The '''Keys to Orthanc '''were described as two, great, black keys of an\nintricate shape, joined by a ring of steel. At one point during _The Two\nTowers_, Gandalf said to Saruman that if he handed over the Keys to\nOrthanc, and his staff, in time he may be pardoned and get them both\nback.  Saruman did not surrender them immediately, but did eventually\nsurrender them to Fangorn (Treebeard).\n"
  },
  {
    "name": "Thorin's axe",
    "lotr_page_id": "19138",
    "text": "THORIN'S AXE was the weapon used by Thorin\nOakenshield during the Quest for Erebor as related in The Hobbit.\n\nIn the Battle of the Five Armies, when Thorin and Company run out of the\nLonely Mountain to engage the enemy, the book says that Thorin “wielded\nhis axe with mighty strokes.” This could very well have been designed to\nbe the axe wielded by Thorin during the battle, but eventually it was\nlost upon the Dwarf-Lord's escape from Goblin-Town.\n"
  },
  {
    "name": "Sam's Barrow-blade",
    "lotr_page_id": "19098",
    "text": "SAM'S BARROW-BLADE was the Barrow-blade used by Sam during the Quest of\nthe Ring.\n\n\nHistory\n\nWhen they are saved from the Barrow-wight by Tom Bombadil, the Hobbits\nare each given a sword that Tom found in the Barrow-wights' lair, along\nwith many other treasures.\n\nSam uses his sword in almost every battle he is in: he uses it until the\nfight with the Giant Spider Shelob in her lair; after that, he uses his\nmaster Frodo Baggins' blade Sting, which becomes an heirloom of the\nGamgee family."
  },
  {
    "name": "Legolas' Mirkwood bow",
    "lotr_page_id": "19086",
    "text": "LEGOLAS' MIRKWOOD BOW was a recurve bow that Legolas used before\nLothlórien. When he joined the Fellowship of the Ring, Legolas took a\nlong dagger for close combat and a curved, finely-made Bow of Mirkwood\nas his main weapon.\n\n\nHistory\n\nLegolas used it against the wolves who attacked the Fellowship in the\nmountain pass  and against goblins in the Fight in Balin's Tomb.\nHe later discarded it when he was gifted the Bow of Lothlorien from Lady\nGaladriel.\n"
  },
  {
    "name": "Faramir's sword",
    "lotr_page_id": "19142",
    "text": "FARAMIR'S SWORD was the sword used by Faramir.\n\n\nHistory\n\nIn the _The Two Towers_, it is said that Faramir uses both a Bow and a\nSword, the usual armaments of the Ithilien Rangers, and is adept with\nboth.\n\nThough Faramir is skilled with his sword it is true that he is much\nbetter at handling his bow, his sword skill is greately surpassed by his\nbrother Boromir and the King of the Reunited Kingdom and Dúnedain\nRanger, Aragorn.\n\nFaramir has used it in many battles but only once in the War of the\nRing, this one being the Battle of Osgiliath, but he has also used it in\nmany ambushes of Sauron's forces who have been travelling through\nIthilien to the Black Gate."
  },
  {
    "name": "Sceptre of Annúminas",
    "lotr_page_id": "7689",
    "text": "The SCEPTRE OF ANNÚMINAS was the chief mark of royalty of the\nNorth-kingdom of Arnor in Eriador in Middle-earth during the Third Age.\n\n\nDescription\n\nThe Sceptre of Annúminas was a silver rod originally borne by the Lords\nof Andúnië in Númenor, and it was patterned after the sceptre of the\nKing of Númenor. The sceptre of the Kings was lost with Ar-Pharazôn in\nthe destruction of Númenor in 3319 of the Second Age. But Elendil,\nthe last Lord of Andúnië, took his sceptre with him when he escaped from\nNúmenor and came to Middle-earth and founded the Kingdoms of Gondor and\nArnor. While the Kings of Gondor wore a crown, the Kings of Arnor bore\nthe sceptre. It became known as the Sceptre of Annúminas, the original\ncapital of the North-kingdom. After the North-kingdom was divided in 861\nthe sceptre passed to the Kings of Arthedain, and then, after Arthedain\nceased to exist in 1974, to the Chieftains of the Dúnedain. Since the\nDúnedain were a wandering people, the sceptre and other heirlooms were\nkept at Rivendell, home of Elrond.\n\nBy the end of the Third Age, the Sceptre of Annúminas was over 5,000\nyears old and was the oldest artifact of Men in Middle-earth, barring\nthe Ring of Barahir which was gifted to Barahir by the Elven king Finrod\nFelagund in the First Age as a symbol of the eternal friendship between\nmen and elves. On Midsummer's Eve of 3019, Elrond brought the Sceptre of\nAnnúminas to Minas Tirith and gave it to Aragorn, King Elessar, of the\nReunited Kingdom of Gondor and Arnor.\n\n\nEtymology\n\nThe _SCEPTRE OF ANNÚMINAS_ was so named because the Kings of Arnor\ninitially ruled from the city of Annúminas. The name Annúminas means\n“tower of the west.” A sceptre, or scepter, is a staff held by a king as\nan emblem of authority."
  },
  {
    "name": "Angainor",
    "lotr_page_id": "3733",
    "text": "ANGAINOR was the chain used to contain Melkor in the Halls of Mandos.\n\n\nHistory\n\nAngainor was constructed by the Vala Aulë and held Melkor for three\nages. After this time, Melkor was judged and released by the Valar, as\nthey thought that he had been changed. However, Melkor went back to\nMiddle-earth and continued his evil ways under the name Morgoth. After\nhis defeat in the War of Wrath at the end of the First Age, Morgoth (as\nhe was now known) was found cowering in the lowest dungeon of his\nfortress Angband. He attempted to negotiate for pardon, but was again\nbound by Angainor, and his iron crown was made into a collar.\n\nThe two Silmarils that had been taken by Morgoth for his crown were\nretaken by Eönwë. Disgusted with Morgoth, the Valar thrust him through\nthe Door of Night beyond the Walls of the World, into the Timeless Void.\nThere he will remain imprisoned until the final battle, Dagor Dagorath,\nthe final judgment of the world.\n\n\nEtymology\n\nIn Quenya, _anga_ means “iron”.\n\n\nEarlier versions of the legendarium\n\nBefore becoming Angainor, the chain was known as Angaino, the Oppressor,\nwhich was coupled with Vorotemnar the manacles and Ilterindi, the\nfetters."
  },
  {
    "name": "Noirinan",
    "lotr_page_id": "3445",
    "text": "NOIRINAN was a valley on the southern slopes of the mountain Meneltarma.\n\n\nHistory\n\nWithin the rock of the mountain was a head chamber where the bygone\nKings and Queens of Númenor were entombed. \n\nHere was located a spring from the Siril river where Aragorn first met\nGandalf.\n\n\nEtymology\n\nNOIRINAN was a Quenyan word that meant “Valley of the tombs”. It came\nfrom the words NOIRË, meaning 'tomb', and NAN, meaning 'valley'."
  },
  {
    "name": "Ring of Isengard",
    "lotr_page_id": "3591",
    "text": "Three sides of Isengard were guarded by a large wall, known as the Ring\nof Isengard, which was only breached by the inflow of the river Angren\nat the north-east through a portcullis, and the gate of Isengard at the\nsouth, at both shores of the river. Inside the walls is found the\nOrthanc, one of the two towers."
  },
  {
    "name": "Star of Elendil",
    "lotr_page_id": "2723",
    "text": "The STAR OF ELENDIL was a white precious jewel made from Mithril and\nworn by Elendil and his heirs, and then by the chieftains of the\nDúnedain in Arnor.\n\n\nHistory\n\nThe Stars of Elendil were also called the _ELENDILMIR_, _THE STAR OF THE\nNORTH_, and _THE STAR OF THE NORTH KINGDOM_.\n\nThis jewel was passed down by way of Silmariën to Elendil, but probably\nwasn't a new creation and existed long before the end of Second Age. It\nwas lost somewhere in the period surrounding the fall of Arnor, at the\nsame time that Isildur was slain. The Kings and Chieftains of the North\nthen wore a new gem, which they had given the same name to replace the\noriginal Elendilmir.\n\nThe original was rediscovered by Saruman's agents while searching for\nthe One Ring, and Aragorn later recovered it from amongst Saruman's\ntreasure in Orthanc after the War of the Ring.\n\nIt is speculated that the jewel contained, like the Phial of Galadriel,\na tiny measure of the light of the Silmarils, which themselves contained\nthe light of the Two Trees.\n\n\nNote\n\nIn Foster's _The Complete Guide to Middle-Earth_ the Elendilmir is\nmistakenly identified with the Star of the Dúnedain which was given to\nSamwise Gamgee, but this is clearly an error."
  },
  {
    "name": "Nimloth",
    "lotr_page_id": "2497",
    "text": "NIMLOTH THE FAIR was the name of the White Tree of Númenor. It grew in\nthe King's Court in the royal palace in the capital city of Armenelos.\n\n\nHistory\n\nDuring the reign of Ar-Gimilzôr, the tree was neglected and fell into\ndecline but when his successor Tar-Palantir came to the throne it was\nagain tended. Later, sometime after SA 3262 when Sauron had the ear of\nthe powerful king Ar-Pharazôn and after Isildur stole one of its fruits,\nthe White Tree was felled and used as kindling in the Temple.\n\nDescendants\n\nA seedling of Nimloth was saved by Isildur and replanted in\nMiddle-earth, becoming the “White Tree of Gondor”.\n\n\nEtymology\n\nThe term _Nimloth_ consists of the Sindarin terms _nim_ (“white”) and\n_loth_ (“blossom”)."
  },
  {
    "name": "Dailir",
    "lotr_page_id": "2545",
    "text": "DAILIR was an unerring, ever-returning arrow that belonged to Beleg\nCúthalion. With his bow Belthronding, he used it many times.\n\n\nHistory\n\nDailir to be found unharmed when shot from Belthronding until it,\nprobably as a sign, was broken when Beleg fell upon it while he was\ncarrying the unconscious Túrin away from the orc-camp. Later that night,\nhe was accidentally killed by Túrin, who confused Beleg with an orc."
  },
  {
    "name": "Durin's Axe",
    "lotr_page_id": "2548",
    "text": "DURIN'S AXE was a great heirloom of the Dwarves of Durin's folk. It was\nthe axe of Durin I, the father of the Longbeard dwarves.\n\n\nHistory\n\nDurin's Axe remained in Khazad-dûm after it was deserted in the TA 1981\nyear of the Third Age. In TA 2989 it was found again by Balin's\nexpedition, and lost again in TA 2994 when the Dwarf-colony was\ndestroyed."
  },
  {
    "name": "Aranrúth",
    "lotr_page_id": "2537",
    "text": "ARANRÚTH was a sword that belonged to Elu Thingol, King of Doriath and\nHigh King of the Sindar. After the Second Sack of Doriath, the sword\nwas rescued with Elwing and was passed on to their descendants.\n\nIt later became the sword of the Kings and Queens of Númenor but was\neventually lost with Ar-Pharazon, who was entombed on the shores of\nAman, during the Downfall of Númenor in SA 3319.\n\n\nEtymology\n\nARANRÚTH means “King's Ire”, from the Sindarin _aran_ (“king”) and\n_rûth_ (“anger”).",
    "owner": "Thingol, later Kings and Queens of Númenor",
    "creator": "Elves",
    "usage": "Heirloom",
    "books": "_The Silmarillion_, _Unfinished Tales_",
    "pronunciation": "_AH-ran-rooth_",
    "location": "Doriath, Mouths of Sirion, Númenor",
    "appearance": "Sword",
    "created": "First Age",
    "destroyed": "Downfall of Númenor, S.A. 3319"
  },
  {
    "name": "Herugrim",
    "lotr_page_id": "2550",
    "text": "HERUGRIM was an ancient sword, an heirloom of the royalty in Rohan.\n\n\nHistory\n\nAt the time of King Théoden, the sword was at least five hundred years\nold. (When Gandalf and Aragorn point out the burial mounds outside\nEdoras, Legolas says, “500 times have the red leaves fallen in Mirkwood\nin my home since then.” ) It was at last passed to Théoden, the last\nking of the second line of Kings in Rohan; who won victory with it at\nHelm's Deep, and died with it in his hand on Pelennor Fields, outside of\nMinas Tirith, while aiding Aragorn II Elessar in his plight.\n\nUnder the influence of Grima's leechcraft, Théoden had entrusted the\nblade to Gríma Wormtongue for safekeeping, but Gríma Wormtongue hid it\naway and allowed it to rust. After Gandalf restored Théoden to himself,\nHáma the doorwarden found the sword locked in Grima's chest.\n",
    "owner": "King of Rohan",
    "creator": "Rohirrim",
    "books": "_The Lord of the Rings_",
    "films": "_The Two Towers (film)_, _The Return of the King (film)_",
    "location": "Rohan"
  },
  {
    "name": "Shards of Narsil",
    "lotr_page_id": "4446",
    "text": "The Shards of Narsil were what was left of the broken sword Narsil.\n\n\nIn the Novels\n\nIn _The Fellowship of the Ring_, they are carried by Strider. He uses\nthe fact that he is carrying “the blade that was broken,” mentioned in\nAll that is Gold Does Not Glitter in Gandalf's letter, to try to\nconvince Sam Gamgee that he is truly Aragorn. The shards are also\nmentioned in the poem _Seek for the Sword that was broken_ that Boromir\nand Faramir hear in their dreams. In the book, the shards are reforged\nat Rivendell before the Fellowship of the Ring leaves, and Aragorn\nrenames the sword Andúril.\n\n\nIn the Movies\n\n In _The Fellowship of the Ring_, the shards are\ndisplayed in Rivendell. They remain there until _The Return of the King_\nwhen Arwen asks her father Elrond to reforge the sword for Aragorn.\nBoromir cuts his finger on a shard when examining them.\n\nIn _The Hobbit: An Unexpected Journey_ (extended version), 60 years\nbefore the events of the _Lord of the Rings_, Bilbo notices the shards\non display, before seeing the painting of Sauron and Isildur during the\nWar of the Last Alliance between Elves and Men.",
    "pronunciation": "_NAR-sil_",
    "creator": "Telchar, Nogrod, First Age",
    "location": "Nogrod, Númenor, Arnor, Rivendell",
    "owner": "Kings of Númenor, Lords of Andúnië, Elendil, Kings of Arnor, Kings of, Arthedain, Chieftains of the Dúnedain",
    "other_names": "\"Sword That Was Broken\", \"The Sword Reforged\"",
    "notable_for": "Cutting the One Ring of Sauron's finger"
  },
  {
    "name": "Gurthang",
    "lotr_page_id": "2541",
    "text": "GURTHANG was the name of the sword of Túrin Turambar, reforged from the\nsword Anglachel.\n\n\nHistory\n\n\n\nGurthang was reforged from Anglachel, a sword forged by Eöl, the “Dark\nElf” of Nan Elmoth. It was reforged by the smiths of Nargothrond years\nafter Beleg Cúthalion requested the sword from Thingol against the\nwarnings of Melian the Maia. After Turin accidentally slew Beleg, his\nfriend, Gwindor saved the sword and presented it to Turin when he later\ncame to his senses. After the sword was reforged Túrin renamed it\n_Gurthang,_ which meant “Iron of Death”_._ Túrin himself became known as\n_Mormegil,_ the “Black Sword”_._\n\nTúrin used Gurthang to slay the dragon Glaurung. When Túrin discovered\nthat his wife, Nienor Níniel, was also his sister, and that she had\nkilled herself, Túrin in despair fell upon Gurthang, killing himself and\nbreaking the blade beneath him. But first, according to the tale, the\nsword seemed to have a will of its own and spoke to Túrin.\n\nThe shards of Gurthang were buried with Túrin beneath Stone of the\nHapless.\n\n\nEarlier versions of the legendarium\n\nIn an early version of _The Silmarillion,_ the second prophecy of Mandos\nforetold that in the Dagor Dagorath, the final battle at the end of\ndays, Túrin Turambar would plunge Gurthang into Morgoth's heart,\nbringing final victory over evil.",
    "location": "Taur-nu-Fuin, Nargothrond, Dor-lómin, Brethil, Tol Morwen",
    "owner": "Túrin",
    "appearance": "A glowing black blade that could slice through iron; forged from a, meteorite",
    "destroyer": "Túrin, Cabed-en-Aras, F.A. 499",
    "creator": "Túrin (originally Eöl), Nargothrond, c. F.A. 490-495",
    "other_names": "\"Iron of Death\""
  },
  {
    "name": "Anglachel",
    "lotr_page_id": "2540",
    "text": "ANGLACHEL was a sword smithed by Eöl, the Dark Elf.\n\n\nDescription\n\nIt is described as being forged from the “iron that fell from heaven as\na flaming star” or a meteorite. According to Melian, Eöl's dark malice\nis left in the sword.\n\nAnglachel seems to have held a certain level of sentient awareness,\npoured into it from Eöl: it was fierce and bloodthirsty, drinking the\nblood of those it bit. “From no blood wilt thou shrink.” said Turin\nafter seeing it unharmed by the scorching blood of Glaurung.\nNevertheless, innocent blood left a terrible shroud of grief on the\nsword, and it remembered: when it spoke to Turin it named two especially\nwhose innocent blood it had drunk: Beleg, slain by mischance, and\nBrandir slain unjustly. It was also said to “mourn” for Beleg, and to\n“rejoice” when unsheathed in war.\n\n\nHistory\n\nIt was one of two swords Eöl forged from a meteorite. The other,\nAnguirel, he kept for himself. Eöl gave this sword to Thingol as payment\nfor staying in his forest, Nan Elmoth, though he did not relish giving\nit away. Thingol gave the sword in keeping to his subject Beleg\nCúthalion, when Beleg left to seek down Turin. Whenever Beleg took the\nsword out of its sheath, the sword is said to have sung with gladness.\n\nAt one time, Beleg was unbinding the unconscious Túrin, who had been\nheld captive. However, whilst undoing his bonds, the sword slipped or\nfell and cut Túrin in his foot. Túrin then woke, and not knowing who it\nwas, slew Beleg with Anglachel, a mistake that he mourned for a long\ntime.\n\nTúrin was then given the sword by Gwindor, and Túrin travelled to\nNargothrond, Gwindor's place of birth, where the sword was reforged and\nrenamed Gurthang “Iron of Death”.\n\n\nEtymology\n\nThe name ANGLACHEL means “Flaming Iron”, from the Sindarin _ang_ (iron“)\nand _lhach_ (”leaping flame\").",
    "owner": "Eöl, Thingol",
    "creator": "Eöl",
    "books": "_The Silmarillion_, , _The Children of Húrin_",
    "location": "Nan Elmoth, Menegroth",
    "appearance": "A glowing black blade that could slice through iron; forged from a, meteorite",
    "destroyed": "Reforged as Gurthang"
  },
  {
    "name": "Sting",
    "lotr_page_id": "716",
    "text": "STING was an Elven shortsword made in Gondolin during the First\nAge. After wielding it during the Quest for Erebor, Bilbo Baggins had it\nengraved with the Sindarin text, _Maegnas aen estar nin dagnir in yngyl\nim_. Translated into English, it reads, “_Sting_ is my name; I am the\nspider's bane.” The Appendix of ''The Silmarillion _defines_ _the\nelement _maeg'' in Sindarin as meaning “sharp” or “piercing”. During the\nThird Age, it was wielded by Bilbo Baggins, Frodo Baggins, and Samwise\nGamgee.\n\n\nHistory\n\n\n\nSting was an ancient Elvish blade made by weapon-smiths in Gondolin.\nWhen Orcs or goblins were within an undetermined radius of it, the blade\nglowed blue, alerting the wielder and others who could see it to their\npresence. It had been lost during the Fall of Gondolin, the same battle\nin which Turgon fell and Glamdring was taken. It appeared as a curved\nblade with a silver loop or spiral design on it, later runes were added\nto it by Bilbo after his adventures. These runes seem to have been made\nby the Elves as they are in Sindarin.\n\nIn _The Hobbit_, Bilbo and his dwarven companions found Sting in a\nTroll-hoard alongside two other elven blades: Glamdring and Orcrist.\nThough just a dagger by the standard of elves, Sting made a perfect\nshort sword for a Hobbit, although it was still rather small, as Bilbo\ninitially chose to wear it “inside his breeches” and was still able\nto travel and even run without any apparent inconvenience.\n\nJust before his nephew embarked on his quest to Mordor from Rivendell,\nBilbo gave Sting to Frodo. Sam then took the weapon from his (seemingly\ndead) master and used it to good effect against Shelob on the borders of\nMordor. After the defeat of Sauron at the end of the Third Age, Frodo\nentrusted Sting to Sam and it became an heirloom of the Gamgee family.\n\nGollum, who disliked anything made by the Elves, was afraid of Sting.\nThis fear aided Bilbo when he confronted Gollum in the Cave at the base\nof the Misty Mountains in _The Hobbit_. It also helped Frodo and Sam\nsubdue Gollum in _The Lord of the Rings_. Orcs also had an instinctive\nfear of these weapons and hated any who carried them.\n\nAs is fitting for a blade of Gondolin, Sting could easily cut through\nthe webs of the offspring of Ungoliant, including the evil Shelob and\nthe spiders of Mirkwood. Bilbo had named the weapon _Sting_ after he had\n“stung” one of them with it. In The Hobbit when Bilbo wears the One\nRing, and defends himself against a spider, he names the blade “Sting”.\nThe narrator describes the spider's lack of acquaintance with creatures\nwith such stings, and evidently this was also Bilbo's presumption in\nnaming it as such. Sting was like Glamdring and Orcrist in that “being\nthe work of Elvish smiths in the Elder Days these swords shone with a\ncold light, if any Orcs were near at hand.” But only Sting was\ndefinitively described as glowing blue, or glittering with blue flame at\nits edges.\n",
    "owner": "Bilbo Baggins, Frodo Baggins",
    "creator": "Elves",
    "books": "_The Hobbit_, _The Lord of the Rings_",
    "films": "__The Hobbit_ films, _The Lord of the Rings_ films_",
    "location": "The Shire",
    "appearance": "Short sword, glows blue in the presence of Orcs"
  },
  {
    "name": "Nauglamír",
    "lotr_page_id": "3320",
    "text": "The NAUGLAMÍR was a necklace crafted by the Dwarves in the First Age\nwhich played an important role during the final parts of the _Narn i\nChîn Húrin_.\n\n\nHistory\n\nAfter Húrin brought the treasures of Nargothrond to Doriath, Thingol\nsummoned Dwarves of Nogrod to Menegroth and invited them to work the\ntreasure into jewelry. The finest of these pieces was the Nauglamír.\n\nThe Nauglamír was the second-greatest treasure of Doriath, prized above\nall but Beren and Lúthien's Silmaril. After the smiths of Belegost\nfinished their work on the Nauglamír, Thingol requested that the Dwarves\nof Nogrod set the Silmaril in it. The Nauglamír, now bearing the\nSilmaril was held to be the fairest object in Arda.\n\nEnthralled by its beauty and greedy for the Silmaril, the dwarves\ndemanded the necklace insisting that as dwarf work it belonged to them.\nThingol was unwilling to surrender the treasure and replies with an\nimpertinent answer. In their anger, the Dwarves slew him. Two escaped to\nNogrod and told a much different story to their kinsmen, persuading the\ncity to march on Doriath.\n\nAfter the Fall of Doriath, the Dwarves of Nogrod marched homewards with\nthe stolen Nauglamír and the rest of the treasures of that land but\nBeren, at the head of an army of Laiquendi and Ents slew the dwarves.\nThe treasure was cast into the Ascar save the Nauglamír, which Beren\ngave to Lúthien.\n\nAfter Beren and Lúthien's final deaths, the necklace was inherited by\ntheir son, Dior, who became the second King of Doriath. When the Sons of\nFëanor heard that the inheritor of the throne of Doriath, they demanded\nthat he surrender it to them or become their enemy. When he refused,\nthis brought about the Second Kinslaying as the Sons of Fëanor, seeking\nthe Silmaril in accordance with the Oath of Fëanor, attacked Doriath.\nDior's daughter, Elwing, escaped the kinslaying with the Nauglamír,\nfleeing to the Mouths of Sirion.\n\nIn the Third Kinslaying, the Sons of Fëanor attacked the Elven havens in\nthe Mouths of Sirion, still trying to obtain the Silmaril within the\nNauglamír but Elwing cast herself into the sea with it rather than\nsurrender the gem to Maedhros and Maglor. The Nauglamír was lost, while\nElwing and the Silmaril were saved by the Vala Ulmo.\n\n\nOther versions of the legendarium\n\nIn an earlier myth of First Age lore that preceded the final stories in\n_The Silmarillion_, namely the Lost Tale _The Nauglafring_, the\nNauglamír (named the NAUGLAFRING) is more important: the necklace\nbecomes caught behind a tree branch when Thingol is riding outside the\nGirdle of Melian and is attacked by the Dwarves. Thingol is unhorsed and\nslain. Following this, Melian's protection is lifted and Doriath is\nsacked.",
    "pronunciation": "_NOW-gla-mear_",
    "location": "Nargothrond, Doriath, Mouths of Sirion",
    "owner": "Finrod, Thingol, Lúthien, Dior, Elwing",
    "creator": "Craftsmen of Nogrod and Belegost, Blue Mountains",
    "notable_for": "Containing a Silmaril",
    "appearance": "Carcanet of gold, and set therein were gems uncounted from Valinor;, later set with a Silmaril",
    "other_names": "\"Necklace of the Dwarves\""
  },
  {
    "name": "The Mirror of Galadriel",
    "lotr_page_id": "7360",
    "text": "_For other uses of THE MIRROR OF GALADRIEL see also: The Mirror of\nGaladriel (disambiguation)_THE MIRROR OF GALADRIEL was a silver basin of\nwater used in the Elven realm of Lothlórien by Galadriel, that could\nshow to the viewer “things that were, and things that are, and things\nthat yet may be.”\n\n\nHistory\n\nWhen, where, or how the Mirror of Galadriel was constructed is unknown.",
    "owner": "Galadriel",
    "creator": "Galadriel?",
    "usage": "To show the one who looked into the \"mirror\" the \"things that were, the, things that are, and the things that may yet be.\"",
    "books": "The Fellowship of the Ring",
    "films": "The Fellowship of the Ring (film)",
    "number": "19",
    "location": "Lórien",
    "date": "15 February 3019",
    "perspective": "Frodo and Samwise",
    "event": "The Company meets Celeborn and Galadriel; Galadriel shows Frodo and, Samwise her mirror."
  },
  {
    "name": "Red Arrow",
    "lotr_page_id": "2552",
    "text": "The RED ARROWS were arrows that were used by Gondor to summon its allies\nin time of need.\n\n\nDescription\n\nIts fletching was black and its barb was made of steel, and it took its\nname from a mark of red painted on the arrow's tip, standing for blood\nto show the situation was serious. The black fletching were like the Orc\narrows.\n\n\nHistory\n\nFirst mention of the Red Arrow is when Borondir of Gondor and five other\nmessengers rode north along Anduin to seek out Gondor's old allies, the\nÉothéod, when Gondor was being overrun by Easterlings, in TA 2509.\nBorondir was the only survivor, and presented the Red Arrow to the\nÉothéod King Eorl the Young.\n\nLater it became a summons for the Rohirrim. The Red Arrow was presented\nto Rohan by Hirgon, Gondor's messenger in the War of the Ring. As a\nresult, King Théoden rode out with the Rohirrim to the Battle of the\nPelennor Fields. Théoden's forces were a great aid to the hard-pressed\nsoldiers of Gondor, though the King was slain in the battle.\n\nIt is not certain where the Red Arrow came from: it is possible that the\ntradition was an old one and that Gondor had always summoned its allies\nthis way, but another possibility is that Borondir actually took an Orc\narrow with a bloody tip to present to the Éothéod, to prove that the\nsituation was as bad as his message stated.",
    "owner": "Borondir, Hirgon",
    "creator": "Men of Gondor",
    "usage": "For summoning allies",
    "books": "_The Lord of the Rings_",
    "location": "Gondor, Rohan",
    "appearance": "Black flights, steel barbs; red mark painted on the arrow's tip"
  },
  {
    "name": "Belthronding",
    "lotr_page_id": "2544",
    "text": "BELTHRONDING was the bow of Beleg.\n\n\nHistory\n\nBelthronding was a bow of black yew-wood. Beleg might have gotten the\nname “Strongbow” from Belthronding. It was buried with him by Túrin and\nGwindor after the accidental slaying of Beleg at the hands of Túrin, his\nfriend.\n\n\nEtymology\n\nIn Sindarin, BELTHRONDING is comprised of the words _bel_ (“strong”),\n_staran_ or _thron_ (“stiff, hard”), and _ding_ (“an onomatopoeic\nvariant of ting”).\n\n\nOther versions of the legendarium\n\nIn earlier writings, the great bow of Beleg was called\n“Balthronding”.",
    "owner": "Beleg",
    "books": "_The Silmarillion_, _The Children of Húrin_, _The History of Middle-earth_",
    "pronunciation": "_bel-THRON-ding_",
    "location": "Doriath, Taur-nu-Fuin",
    "appearance": "Bow made of black yew-wood"
  },
  {
    "name": "Anguirel",
    "lotr_page_id": "2539",
    "text": "ANGUIREL was one of the two swords forged by Eöl from an iron meteorite.\nIts mate, Anglachel, was given to Thingol as payment for living in Nan\nElmoth.\n\n\nHistory\n\nIt was kept by Eöl as his weapon, but was later stolen by his son\nMaeglin. It was presumed that Maeglin stole Anguirel when he and\nhis mother Aredhel fled to Gondolin.\n\n\nEtymology\n\nAlthough the meaning of its name is unclear, ANGUIREL has the Sindarin\n_ang_, which means “iron”.",
    "owner": "Eöl, Maeglin",
    "creator": "Eöl",
    "books": "_The Silmarillion_, _The Children of Húrin_",
    "location": "Nan Elmoth, Gondolin",
    "appearance": "A glowing black blade that could slice through iron; forged from a, meteorite"
  },
  {
    "name": "Gúthwinë",
    "lotr_page_id": "2549",
    "text": "GÚTHWINË was the sword that belonged to Éomer.\n\nIt was borne by him at the Battle of the Hornburg, and presumably at the\nBattle of the Pelennor Fields and the battle before Morannon.\n\n\nEtymology\n\nIn Old English, GÚTHWINË means “Battle-friend”.\n",
    "owner": "Éomer",
    "books": "_The Lord of the Rings_",
    "films": "_The Two Towers (film)_, _The Return of the King (film)_",
    "location": "Rohan"
  },
  {
    "name": "Dagmor",
    "lotr_page_id": "2546",
    "text": "DAGMOR was the name of the sword that belonged to Beren, in the First\nAge.\n\n\nHistory\n\nAs a lone outlaw in Dorthonion, Beren carried Dagmor throughout his many\njourneys. It is presumably lost after his death.\n\n\nEtymology\n\nThe name _DAGMOR_ may from the Sindarin words _dag_ (“slay”) and _môr_\n(“dark, darkness”).\n\n\nOther versions of the legendarium\n\nThe sword's name was not mentioned in _The Silmarillion_; it is only\nmentioned in the Lay of Leithian in _The Lays of Beleriand_.",
    "owner": "Beren",
    "usage": "For fighting",
    "books": "_The History of Middle-earth_",
    "appearance": "Sword"
  },
  {
    "name": "Red Book of Westmarch",
    "lotr_page_id": "2313",
    "text": "The RED BOOK OF WESTMARCH was a red-leather bound book written by the\nHobbit Bilbo Baggins and his household-heir Frodo Baggins, (with\nsupplemental information later added by Samwise Gamgee) which chronicled\nboth their adventures, as well as background information which the\nBagginses had collected.\n\nBilbo Baggins started the book and recounted his quest for Erebor, which\nhe called _There and Back Again_. He later gave the book to Frodo at\nRivendell after completing it, and Frodo organized Bilbo's manuscript\nand used it to write down his own quest during the War of the Ring.\n\n\nDescription and History\n\nInscribed within, it reads:\n\nBilbo's translations of legends from the Elder Days were also added to\nit, as were various Hobbit poems and a lot of background information on\nthe realms of Arnor, Gondor and Rohan, added to it by Peregrin Took and\nMeriadoc Brandybuck.\n\nAfter Bilbo and Frodo left for Valinor, the Red Book passed into the\nkeeping of Samwise Gamgee, mayor of Hobbiton. The book was left in the\npossession of Sam Gamgee's eldest daughter, _Elanor Fairbairns_, and her\ndescendants (the _Fairbairns of the Towers_ or _Wardens of Westmarch_).\nSeveral copies, with various notes and later additions, were made and\nthe original was kept in a red case (with a three-volume Elvish\nTranslation and a fifth volume ).\nCopies were passed on to future generations, of which one, the “_Thain's\nBook_”, is the most important.\n\nFrom the cover it is properly red colored; and has signature print on\nthe top, shaped as a shine of light. It also has stitch patterns and\nbeautiful marks around the edges. Bilbo Baggins' initials BB are in gold\nand it is very smooth, soft and silky to the touch. On the inside, there\nis a page of contents; writing each story by the four owners. There is a\nchance that The Adventures Of Tom Bombadil (a book of poems) was written\nby Samwise Gamgee. However it is unknown what Elanor Gamgee wrote.\n"
  },
  {
    "name": "Bow Of Galadhrim",
    "lotr_page_id": "40980",
    "text": "{{Object infobox |othername= Bow |image =Bow_1 |manufacturer=Elves made=\nWood |usage= Weapon |owners= Legolas |books= _The Lord of the Rings_\n|films=''The Lord of the Rings: Fellowship of the ring, two towers,\nreturn of the king.'' [[Category:Weapons"
  },
  {
    "name": "Master-stone",
    "lotr_page_id": "34467",
    "text": "The MASTER-STONE was the highest of all the Palantíri.\n\n\nHistory\n\nThe Master-stone was made at an unknown time by the Ñoldor prince Fëanor\nwhile he was still in Aman. Exactly where it was during the rest\nof the Years of the Trees and the First Age has not been recorded. The\nstone is only mentioned in the history of the Dúnedain in the time of\nElendil's rule of the exile kingdoms of Arnor and Gondor in Middle-earth\nafter the Fall of Númenor, as being in the Tower of Avallónë on Tol\nEressëa in the Undying Lands. It is recorded that Elendil, while using\nthe Elostirion-stone to gaze into west was believed to have been able to\nsee the Tower of Avallónë where the Master-stone was kept."
  },
  {
    "name": "Ringwraith sword",
    "lotr_page_id": "27636",
    "text": "The RINGWRAITH SWORD were long swords of black steel that were\nhand-forged in Mordor for the Ringwraiths, the deadliest servants of\nSauron.\n\nThey wielded these weapons mainly during the War of the Ring until their\ndeaths in March 25, 3019, when Sauron was finally destroyed."
  },
  {
    "name": "Bow of Bregor",
    "lotr_page_id": "25738",
    "text": "The BOW OF BREGOR of the House of Bëor was a bow used by Bregor, son of\nBoromir during his life in Middle-earth during the First Age.\n\n\nHistory\n\nThe bow was never mentioned in Bregor's lifetime only that it was an\nheirloom of House of Bëor and was preserved in Númenor by the royal\nfamily along with Dramborleg and the Ring of Barahir. It did not survive\nthe fall."
  },
  {
    "name": "Thrór's Map",
    "lotr_page_id": "21988",
    "text": "THROR'S MAP was the map used in _The Hobbit_ by Thorin and Company in\ntheir Quest to regain the Lonely Mountain.\n\n\nHistory\n\nThe map was drawn up at an unknown time by Thrór and his son Thráin\nElrond believed it was written on a midsummer night under a crescent\nMoon with the Moon-letters giving the directions on how to open the\ndoor. It illustrated the Lonely Mountain, the river that flowed from\nit, the lands surrounding it, and lastly the existence of the\nsecret-entrance on the western side of the mountain. It survived the\ndestruction of the kingdom in TA 2770 by Smaug and was kept by Thrór as\nan heirloom of his people. In TA 2790 when Thrór grew old and decided to\ngo off on an adventure of his own to the Mines of Moria, the map was\ngiven to his son Thráin for safe-keeping. In TA 2841, Thráin left\nhis home in the Blue Mountains with a small company to try his luck with\nthe map, intending to reach the Lonely Mountain despite the threat from\nSmaug, but he never got there. Instead, he was taken prisoner by the\nOrcs of Dol Guldur and imprisoned in its dungeons by Sauron. Sauron took\nhis Dwarven Ring of Power.\n\nThe Moon-letters on the map read: ''Stand by the grey stone when the\nthrush knocks and the setting sun with the last light of Durin's Day\nwill shine upon the key-hole.\n\nIn TA 2850, Gandalf went to Dol Guldur in secrecy and found Thráin dying\nin captivity but before he died he gave Gandalf the map and the key to\nthe secret entrance, and entrusted him to pass it on to his son\nThorin. The map was presented to Bilbo during their visit to Bag\nEnd in late April, 2941 and used throughout their adventure."
  },
  {
    "name": "Elendilmir",
    "lotr_page_id": "21827",
    "text": "ELENDILMIR was a token of royalty\nthroughout the Kingdom of Arnor crafted and presented to the High King\nof Gondor and Arnor, Elendil the Tall.\n\n\nDescription\n\nElendilmir was a radiant white gemstone set on a silver fillet and was\nregarded as the Royal Gem of Arnor.\n\n\nHistory\n\nElendilmir was lost at the great massacre in the east, the Disaster of\nthe Gladden Fields, when King Elendil's eldest son, Isildur, and the\nDunedain of Arnor were marching home after the defeat of Sauron. The\ncompany were ambushed by a large group of Orcs from the Misty Mountains\nwho slaughtered many including Isildur, with only three men to come out\nalive. It is a mystery exactly how Elendilmir was lost, but it _is_\nknown that the One Ring was found at the bottom of the Gladden River\nwhere it had slipped off Isildur's finger when he was killed. This may\nbe where Elendilmir was lost.\n\nIn the Unfinished Tales (later published by Christopher Tolkien) it is\nstated that Aragorn II finds the Elendilmir in the tower of Orthanc.\nAfter Sauron's defeat, Aragorn (with the help of Gimli the Dwarf) finds\na hidden door and a steel cabinet. In that cabinet they find a small\ngolden tube without any inscription (the One ring was most likely hidden\nin here by Isildur), and the Elendilmir. Aragorn brings it back to Minas\nTirith and wears it once again, but only on special occasions as he will\nnot risk any more harm to it.\n\nAnother version of the Gemstone was made at a later date by Isildur's\ndescendants, a second Elendilmir, commemorating King Elendil and Isildur\nhimself. It was borne roughly around TA 2940, or most likely later.\n\nde:Elendilmir es:Elendilmir it:Elendilmir pl:Elendilmir ru:Элендильмир"
  },
  {
    "name": "Black Arrow",
    "lotr_page_id": "2542",
    "text": "The BLACK ARROW was an heirloom of the house of Girion, Lord of Dale,\npassed down to Bard, his descendant.\n\n\nHistory\n\nThe Black Arrow was Bard the Bowman's last remaining arrow when Smaug\nattacked Laketown and, directed by a Thrush who had overheard a\nconversation between Bilbo Baggins and Smaug, he shot it with remarkable\nspeed into a weak spot in the left part of the chest of the dragon's\nnatural armour of scales, killing him, and thus freeing Lonely Mountain,\nDale, and Lake town.\n\nThe Black Arrow was forged by Thrór, who was the King under the Mountain\nbefore its fall seated in the Lonely Mountain, according to _The\nHobbit_. It is not known if it had any magical properties, but Bard said\nthat he had successfully retrieved it every time he used it (like\nBeleg's arrow Dailir).\n",
    "owner": "Girion, Bard",
    "creator": "Dwarves",
    "location": "Lonely Mountain, Lake-town"
  },
  {
    "name": "White Tree of Gondor",
    "lotr_page_id": "583",
    "text": "The WHITE TREE OF GONDOR was the symbol of the realm of Gondor, growing\nin the Court of the Fountain at Minas Tirith. The White Tree was also\nthe motif of Gondor's flag.\n\n\nDescription\n\nThis iconic tree was in appearance a tall spacious tree of graceful\nform, white thin unwrinkled bark over white wood. In spring it bore\nnumerous white flowers, but few of these ever fructified; what shape the\nfruit was is never described, nor is it considered to be edible. The\nleaves were laurel-like, dark green above and bright silver beneath. The\nwood when burned gives off a dense, choking, volumnious smoke that forms\na fog capable of burying an entire country in darkness for several days.\n\nIt was fashioned in the image of Telperion, elder of the Two Trees of\nValinor, originally. This image was given to the Elves of Kortirion in\nValinor and named Galathilion. From it a sapling was taken to Tol\nEressëa, named Celeborn. This in turn sired the tree Nimloth of Númenor,\nfelled by Sauron and burned on the altars.\n\n\nHistory\n\nFirst White Tree\n\nThe first White Tree of Gondor came from a fruit that Isildur, at great\npersonal risk, managed to steal from Nimloth the Fair, the White Tree of\nNúmenor, before that one was destroyed at Sauron's insistence. He\nsuffered many wounds at this mission, and he came near death, but when\nthe first leaf opened in the spring, Isildur was healed of his wounds.\n\nThis sapling was brought to Middle-earth on Isildur's ship, and it was\neventually planted in Minas Ithil before the house of Isildur. But when\nSauron returned to Middle-earth, he launched a sudden attack that\ncaptured Minas Ithil, and he destroyed the White Tree. Isildur escaped\ntaking with him again a sapling.\n\nSecond White Tree\n\nIn the Year 2 of the Third Age, Isildur plants the seedling of the White\nTree in Minas Anor.\n\nThis White Tree lasts until TA 1636, when the Great Plague hits Gondor,\nkilling among many others King Telemnar and his children.\n\nThird White Tree\n\nA third sapling is planted in TA 1640 by King Tarondor. This one lasts\nuntil the year 2852 and the death of the Ruling Steward Belecthor II.\n\nAt this time no seedling of the tree could be found. As a result it was\nleft standing after its death.\n\nFourth White Tree\n\nWhen Aragorn becomes king he discovers (with Gandalf's help) a sapling\nof the White Tree upon the slopes of Mindolluin, high above the city,\nwhich he reverently plants in its place. The dead tree is removed from\nthe court but is placed in the Tombs of the Kings with all the honour\nthat would normally be accorded a fallen monarch. In June of TA 3019 the\nsapling blooms.\n",
    "other_names": "White Tree of Minas Tirith, White Tree of the Eldar",
    "location": "Minas Ithil, later Minas Tirith",
    "appearance": "A white tree with leaves dark on top and silver beneath; and clusters of, white blossoms"
  },
  {
    "name": "Two Trees of Valinor",
    "lotr_page_id": "2654",
    "text": "The TWO TREES OF VALINOR also known as the TREES OF THE VALAR,''' '''the\nTWO TREES: '''Laurelin '''(the Gold Tree) and '''Telperion '''(the\nSilver Tree), brought light into the Land of the Valar in ancient times.\nThey were destroyed by Melkor and Ungoliant, but their last flower and\nfruit were made by the Valar into the Sun and the Moon.\n\n\nCreation and destruction\n\nThe first sources of light for all of Arda were two enormous Lamps,\nIlluin, the silver one to the north, and Ormal, the golden one to the\nsouth. These were cast down and destroyed by Melkor. Afterward, the\nValar went to Valinor and Yavanna sang into existence the Two Trees,\nsilver Telperion and golden Laurelin. Telperion was considered male and\nLaurelin female. The Trees sat on the hill Ezellohar located outside\nValimar. They grew in the presence of all of the Valar, watered by the\ntears of Nienna.\n\n Each tree was a source of\nlight: Telperion's silver and Laurelin's gold. Telperion had dark leaves\n(silver on one side) and his silvery dew was collected as a source of\nwater and of light. Laurelin had gold-trimmed leaves and her dew was\nlikewise collected by Varda. One “day” lasted twelve hours. Each Tree,\nin turn, would give off light for seven hours (waxing to full brightness\nand then slowly waning again), so that at one hour each of “dawn” and\n“dusk” soft gold and silver light would be given off together.\n\nJealous, Melkor enlisted the help of the giant spider-creature Ungoliant\n(the mother of Shelob) to destroy the Two Trees. Concealed in Unlight,\nMelkor struck each Tree and the insatiable Ungoliant devoured whatever\nlife and light remained in them.\n\nAgain Yavanna sang and Nienna wept, but they succeeded only in reviving\nTelperion's last flower (to become the Moon) and Laurelin's last fruit\n(to become the Sun). These were assigned to lesser spirits, male Tilion\nand female Arien, after the 'genders' of the Trees themselves. This\nis why, in _The Lord of the Rings_, the Sun is usually referred to as\n“she” and the moon as “he”.\n\nHowever, the true light of the Trees, before their poisoning by\nUngoliant, was said to afterwards reside only in the Silmarils.\n\n\nTelperion's descendants\n\nBecause the Elves that first came to Valinor especially loved Telperion,\nYavanna made a second tree like it to stand in the city of Tirion where\nthe Vanyar and Ñoldor dwelt together at first. This tree,\nnamed Galathilion, was identical to Telperion except that it gave no\nlight of its own. It had many seedlings, one of which was planted in the\nisle of Tol Eressëa (named CELEBORN).\n\nIn the Second Age, a seedling of Celeborn was brought as a gift to the\nNúmenóreans - this was Nimloth, the White Tree of Númenor. It lasted\nthrough the majority of the realm's duration, but when Sauron took\ncontrol of the island he commanded King Ar-Pharazôn to chop it down.\n\nFortunately Isildur managed to save a single fruit of that tree. Of this\nfruit later came the White Tree of Gondor.\n\n\nInternal significance\n\nThe Two Trees of Valinor existed at a time when the only other source of\nlight was the stars (which had been created for the Elves' benefit by\nVarda from the dews collected from the Two Trees). When three Elven\nambassadors were brought to see Valinor for themselves, in order that\nthe Elves might be convinced to come to Valinor, it seems that the Two\nTrees affected them most significantly.\n\nIn particular Thingol is said to have been motivated in the Great\nJourney by his desire to see the Light of Valinor again (until he finds\ncontentment in the light he sees in Melian's face). Also in later times,\nthe Elves would be divided between the _CALAQUENDI_ who had seen the\nlight of the Trees, and the _MORIQUENDI_ who hadn't; with the former\ngroup having found enlightenment and near rapture in the light they\nbeheld.\n\nThe Silmarillion repeatedly states that those Elves who saw the Two\nTrees were mighty, with the light of Aman in their faces. As vassals of\nthe Valar, the trees somehow bestowed otherworldy power and\nunderstanding on those who were exposed to them. Galadriel in particular\nhad an affinity to Laurelin, as her hair was said to have captured the\ngolden light of that tree. In turn this inspired Feanor to make the\njewels that could hold that same light; the Silmarils.\n\nThe whole of the history of the First Age is strongly affected by the\ndesire of many different characters to possess the Silmarils, which\ncontain the only remaining unsullied light of the Trees. Yet upon his\nflight from Valinor after destroying the light of the Two Trees, Melkor\nstole the Silmarils and sparked the Oath of Fëanor (who renamed Melkor\nMorgoth) and after many years the Valar embarked on the War of Wrath,\nWhich ended the First Age\n\nIn the Second and Third Ages, the White Trees of Númenor and of Gondor,\nwhose likeness descends from that of Telperion, have a mostly symbolic\nsignificance. They stand both as symbols of the kingdoms in question,\nand also as reminders of the ancestral alliance between the Dúnedain and\nthe Elves. Even in this late age the two trees are remembered by some.\nGandalf obviously remembers them with reverence, as he speaks of them to\nPippin.\n\n\nExternal significance\n\nTolkien, as a Roman Catholic, would have been exposed to the\nsignificance of light in Catholic symbolism. Trees were of special\nimportance to him - in his short story _Leaf by Niggle_, which in a\nsense was an elaborate allegory explaining his own creative process, the\nprotagonist spends his life painting a single Tree.\n\nThe Two Trees represent the recurrent 'gold and silver' concept of the\nlegendarium. They are created after the lamps Ormal and Illuin - and\nfrom the trees themselves, the Sun and Moon are later created.\n\nTolkien may have also gotten inspiration for the trees directly from the\nSun, which rises in the day (as Laurelin, the golden tree), and the moon\nwhich rises in the night (Telperion, the silver tree).\n\n\nEtymology\n\nBoth Telperion and Laurelin are said to have been given many names among\nwhich are the following: Laurelin was also given the names of MALINALDA\nand CULÚRIEN,''' '''while Telperion was also named '''Silpion '''and\nNINQUELÓTË. Telperion's name in Valarin, the language of the Valar, is\nsaid to have been _IBRÎNIÐILPATHÂNEZEL_; Laurelin's name is recorded as\n_TULUKHEDELGORÛS._\n\nIn early writings of Tolkien, Telperion's names were SILPION ,\nBANSIL, and BELTHIL.\n\n\nQuotations\n\n“Yet even as hope failed  Telperion bore at last upon a leafless\nbough one great flower of silver, and Laurelin a single fruit of gold.”\n- _The Silmarillion_\n\n“... and perceive the unimaginable hand and mind of Feanor at their\nwork, while both the White Tree and Golden were in flower!” Gandalf to\nPippin, _The Two Towers_\n\n\nNotes\n\n-   Tolkien could have taken the creation of light mentioned in Genesis\n    as inspiration for the two trees, as both brought light into\n    Middle-earth and were turned into the moon and sun.",
    "location": "Ezellohar",
    "creator": "Yavanna, , V.Y. 3450–3500",
    "appearance": "Two tall trees, one of gold, the other of silver"
  },
  {
    "name": "Vingilot",
    "lotr_page_id": "5107",
    "text": "VINGILOT (Quenya; IPA: ), or VINGILÓTË or WINGILÓTË ), was the ship\nin which Eärendil and Elwing sailed to Aman in order to seek pardon and\nassistance from the Valar. Its name is Quenya for “Foam-flower”.\n\nGuided by the light of a Silmaril, Eärendil navigated Vingilot through\nthe Shadowy Seas to the Blessed Realm of Aman; he was the first Mortal\nto do so. He was not allowed, however, to return to Middle-earth, except\nto join the host of the Valar in the final War of Wrath against Morgoth.\nWith Vingilot, Eärendil slew Ancalagon the Black, the greatest dragon\nthat ever lived.\n\nAfter the War of Wrath, Eärendil, with the Silmaril upon his brow,\nsailed Vingilot into the sky where the jewel shines forever as a morning\nstar (the equivalent to Venus).\n\nThe ship was referred to as Wingilótë during much of the First Age, but\nmost instances of Quenya W became V after the First Age ended, yielding\nVingilótë. The name was finally abbreviated to Vingilot.\n",
    "other_names": "Vingilot, Rothinzil",
    "location": "Evening or morning sky",
    "owner": "Eärendil",
    "creator": "Eärendil and Círdan",
    "appearance": "Fairest ship ever built"
  },
  {
    "name": "Dramborleg",
    "lotr_page_id": "2547",
    "text": "DRAMBORLEG was the great axe wielded by Tuor during the First Age.\n\n\nHistory\n\nDuring the Fall of Gondolin, Tuor used Dramborleg and clove five Balrogs\nto death.\n\nAfter Tuor sailed for the West, the axe was kept by Elros and his\ndescendants, and eventually became a royal heirloom of Númenor. It was\nlost in the Downfall of Númenor near the end of Second Age.\n\n\nEtymology\n\nIn the language of the Gondolindrim, DRAMBORLEG means\n“Thudder-sharp”, from _daram_ (“beat, hew”) or _dram_ (“heavy\nstroke”).\n\nIts earlier name was DRAMBOR.",
    "owner": "Tuor",
    "creator": "Unknown",
    "location": "Gondolin, Númenor",
    "appearance": "Great axe",
    "created": "First Age",
    "destroyed": "Downfall of Númenor, S.A. 3319"
  },
  {
    "name": "Grond (Warhammer)",
    "lotr_page_id": "12225",
    "text": "GROND was the great warhammer of Morgoth, the first Dark Lord, which he\nwielded in the First Age. It was also referred to as the HAMMER OF THE\nUNDERWORLD, and was extremely powerful.\n\n\nHistory\n\nForged in an unknown time and place, Grond was mentioned only once, as\nthe weapon of Morgoth in his single combat with Fingolfin, High King of\nthe Ñoldor. Fingolfin had challenged Morgoth after the Ñoldor's\ndevastating defeat at Dagor Bragollach.\n\nEvery blow of the hammer brought down a lightning strike and left a\ncrater. Fingolfin evaded it, and struck Morgoth seven great wounds,\nfilling the pits with the enemy's blood. At last Fingolfin stumbled into\none of the craters and was pinned by the Dark Lord's left foot. As\nMorgoth readied a death blow, Fingolfin stabbed one last time, at his\nfoot. The blow crippled Morgoth, already weakened by his labors\nin corrupting Arda and grasping the Silmarils, and he limped for the\nrest of his life on earth.\n\nDuring the Third Age, Sauron, Morgoth's great servant and successor,\nrecalled his master's Hammer when he built a huge battering ram to break\nthe gates of Minas Tirith during the Siege of Gondor, also naming it\nGrond.\n\n\nEtymology\n\nThe name _Grond_ means “club”, from the Quenya _rud-_ or _runda_ (“rough\npiece of wood”). In Sindarin, the name means “very weighty and\nponderous”.\n\nAlso, ''Grond ''means “ground” in Dutch, perhaps referring to the fact\nthe hammer was able to form craters into the ground.",
    "other_names": "Hammer of the Underworld",
    "owner": "Melkor",
    "books": "_The Silmarillion_, _The History of Middle-earth_"
  }
]