[
  {
    "name": "Lord of the Nazgûl",
    "lotr_page_id": "9785",
    "text": "The LORD OF THE NAZGÛL is the title of the Witch-king of Angmar. It is\nalso often used to refer to the Witch-king himself. After the Witch\nKing's demise, his second-in-command, Khamûl, would take his place.",
    "other_names": "Black Captain, Chief of the Nine, Lord of Minas Morgul",
    "affiliation": "Sauron",
    "position": "Lord of the Nazgûl",
    "birth": "Second Age",
    "language": "Black Speech, Westron",
    "location": "Angmar\nMinas Morgul",
    "death": "15 March, T.A. 3019 (aged 4200+)\nBattle of the Pelennor Fields",
    "height": "Tallest of the Nazgûl",
    "gender": "Male",
    "hair": "Gleaming",
    "weapon": "Morgul-knife; Black Breath; A great black mace",
    "race": "Ringwraiths"
  },
  {
    "name": "Manwë",
    "lotr_page_id": "11793",
    "text": "MANWË (Quenya; IPA: - “Blessed One”) was the leader of the Ainur, one of\nthe Aratar, King of the Valar, husband of Varda, brother of the Dark\nLord Melkor, and King of Arda. He was also known as SÚLIMO, _'Mânawenûz\nOR Valahiru _'and lives atop Mount Taniquetil in Valinor, the highest\nmountain of the world. The winds and airs are his servants. He was the\ngreatest in authority, but not in power, of all the Valar, Melkor being\nmore powerful. He was however the greatest of the Aratar, among whom\nMelkor was not counted. Biography Manwë was (with Melkor) the eldest of\nthe Ainur, and the one that best understood the will of Eru. When Melkor\ncreated the discord in the Music of the Ainur, the Second Theme of Eru\nthat rose to counter the discord used Manwë as its chief instrument.\nWhen Arda was formed, Manwë was appointed Ruler of Arda, hence his most\ncommon title, the Elder King. Manwë was a kind, compassionate ruler,\nunconcerned with his own power. He oversaw all of the Valar's early\nattempts to order Arda, but was unable to stop Melkor's rampages until\nthe Vala Tulkas came to Arda to assist his brethren. Afterwards, the\nValar under Manwë made an abode on Middle-earth in the Isle of Almaren\nand constructed the two Lamps of the Valar to provide light to the\nworld. But Melkor destroyed the lamps, and the Valar retreated to the\ncontinent of Aman, which they heavily fortified. Eventually, the Elves\nawoke in Middle-earth, and Manwë at last went with the other Valar to\nsubdue Melkor. They succeeded, and Melkor was imprisoned in the Halls of\nMandos. He extended an invitation to the Elves to journey to Aman and\nlive there amongst the Valar. For the three Ages of Melkor's\nimprisonment, the Valar and the Elves lived in peace and happiness. But\neventually Melkor was allowed to plead for pardon before Manwë again. As\nManwë was completely free of evil, he was unable to comprehend it,\nleading him to believe Melkor's lies concerning his reformation. He\nreleased Melkor from Mandos, whereupon Melkor began plotting the\ndownfall of the Elves and the ruin of Aman's bliss. He began to cleverly\nspread lies amongst the Ñoldor, who soon grew to resent the Valar\nbecause of said lies. Eventually, due to the rebellious actions of the\nNoldor prince Fëanor, Melkor's lies were uncovered, but he escaped\nbefore he could be recaptured. Soon thereafter, Melkor recruited the\ngreat spider Ungoliant and poisoned the Two Trees. He then murdered the\nKing of the Noldor, Finwë, stole the Silmarils, and incited Fëanor's\nleaving Aman with most of the Noldor in rebellion. Soon thereafter,\nManwë learned that the rebellious Noldor had attacked and slaughtered\nmany of the Teleri. As such, he forbade the Ñoldor from returning to\nValinor once they left, and stated also that the Elves would receive no\nhelp from the Valar in their war against Morgoth. He then caused Valinor\nto be hidden by way of the Shadowy Seas and the Enchanted Isles to\nprevent the Ñoldor from returning. To hearten the Eldar, he had Aulë\nfashion the Sun and the Moon, for he knew the rising of the Atani was\ncoming soon, and sent Thorondor and the Eagles to watch them. After\nMorgoth's fall, Manwë cast him into the void. Manwë dresses in blue\nrobes and has blue eyes. He wields a scepter of sapphire made for him by\nthe Ñoldor. The Vanyar are his favorite Elves, and they live with him\nand Varda on Mount Taniquetil. Maiar of Manwë - Eönwë, Manwë's\nbanner-bearer and herald. In earlier conceptions of the legendarium,\nEönwë, then called FIONWË ÚRION, was envisioned as the son of Manwë and\nbrother of Erinti, renamed as Ilmarë, Varda's handmaiden. - In some\nversions, FIONWË, later named Eönwë, is the one who will kill Morgoth\nfor his love for Urwendi (Later named Arien). - Olórin (Gandalf), the\nsecond-in-command (and later leader) of the wizards sent to Middle-earth\nto fight against Sauron, and Manwë comforted him when Olórin showed\nuneasiness and fear of Sauron's powers. Etymology The name _MANWË_ means\n“blessed one” or “blessed person”, from the Quenya _man_ (“blessed”) and\n_wë_ (“person”). SÚLIMO literally means “the Breather”, from the Quenya\n_súlimë_ (“wind”) and Sindarin _sûl_ (“wind”). His Sindarin name is ARAN\nEINIOR, the “Elder King”. Titles - ELDER KING - KING OF ARDA - LORD OF\nTHE BREATH OF ARDA - KING OF THE VALAR - LORD OF THE WEST",
    "other_names": "Súlimo\nMânawenûz",
    "titles": "King of Arda\nLord of the Breath of Arda\nKing of the Valar\nElder King\nLord of the West\nLord of Aman",
    "birth": "Before the Creation of Arda",
    "rule": "After the Creation of Arda",
    "death": "Immortal",
    "spouse": "Varda",
    "weapon": "Powers of the Valar",
    "race": "Valar",
    "gender": "Male",
    "eyes": "Blue",
    "location": "Arda, Valinor"
  },
  {
    "name": "Nessa",
    "lotr_page_id": "2417",
    "text": "NESSA (Quenya; IPA: - “Young”) was an Ainu and a Valië and was ranked\nthe least among the Valar. She was notable for her speed, being fast “as\nan arrow in movement”, for which reason she was called _NESSA THE\nSWIFT_. Biography Nessa was the sister of Oromë. She was lithe and swift\nof foot and Nessa loved fast moving creatures such as deer. And the deer\nfollowed her train wherever she went even into the wild regions of Aman.\nNessa could outrun the deer with great speed with the wind in her hair.\nNessa married Tulkas aka _TULKAS THE STRONG_, during the Spring of Arda.\nBefore the destruction of the _Isle of Almaren_, the first dwelling of\nthe Valar, Nessa delighted in dancing and would often dance on the great\ngreen grass of Almaren; and later, in Valinor on never-fading green\nlawns. Henceforth, as the Valar had finished with their labours in the\ncreation of Arda, King Manwë ordained a great feast on Almaren. So the\nValar were gathered upon Almaren during the _Spring of Arda_; and it was\nsung that on this great feast, Nessa wedded Tulkas there at that time\nwhere Nessa's sister-in-law, _Vána the Ever-young_,'' ''wife of Oromë,\nrobed Nessa with her flowers. Thereon, Nessa danced before the Valar\nupon the green grass of Almaren. The dwelling of Nessa and Tulkas was\nsaid to be a house full of mirth and revelry. For in the House of\nTulkas, his warriors played and rivaled one another there in doughty\nfeats. At times, Nessa would bear goblets of wine and cooling drinks\namong the champions of her husband. After the flight of the Ñoldor to\nMiddle-earth, like most of the Valar, Nessa also desired ease and peace\njust like the ancient days of Valinor. Wishing not for the rumour of\nMelkor nor for the murmurs of the Ñoldor to come ever again among them\nand disturb their happiness. As a result for such reasons, most of the\nValar clamored for the concealment of their land. Hence, the Hiding of\nValinor took place. Etymology NESSA comes from the Quenya _neth_\n(“young”). Other names Two earlier names for Nessa were HELINYETILLE,\nthe “Eyes of Heartsease”, from _helin_ (“violet, pansy”), and MELESTA,\nfrom _mele_ (“to love”). Character Nessa loved most to retire to the\nfair ever-green lawns of Valinor which Oromë had cultivated from the\nrichness of all his forest glades. For it was told that, when Yavanna\n(_Queen of the Earth_) created the forests of Oromë, she had planted\nthere these forest glades with spells so that these glades would always\nremain green and smooth. There in the fair lawns of Valinor, Nessa along\nwith her maidens would dance as long as the great golden Tree Laurelin''\n_was in bloom._'' It was told that she herself was a greater dancer than\nVána, for Nessa was not just known for her notable speed but for her\ndancing abilities as well. Other Versions in the Legendarium In the\nearlier texts, Nessa and Estë were considered “highest among the Maiar”.\nLea the Young was the wife of Tulkas, and was later changed to Nessa.\nNessa was once envisioned as the daughter of Vána. Gallery",
    "other_names": "The Dancer",
    "titles": "Queen of the Valar",
    "birth": "Before the creation of Arda",
    "rule": "Years of the Lamps",
    "death": "Immortal",
    "spouse": "Tulkas",
    "weapon": "Powers of the Valar",
    "race": "Valar",
    "gender": "Female",
    "height": "Varies",
    "location": "Valinor"
  },
  {
    "name": "Melian",
    "lotr_page_id": "2354",
    "text": "MELIAN (Sindarin IPA: ) was a Maia of the race of the Ainur, Queen of\nDoriath and mother of Lúthien Tinúviel. Biography Before she came to\nMiddle-earth, Melian served both Vána and Estë, and dwelt in Lórien\ntending the trees that grew in the Gardens of Irmo. Among all of her\npeople none were wiser, (With the possible exception of Gandalf) more\nbeautiful, or more skilled in singing enchanting songs than Melian. She\nloved the deep shadows of the great trees. When the light of the Two\nTrees would mingle Melian would sing and the Valar would stop their work\nand listen. Nightingales went with her wherever she went, and she taught\nthem their song. Of all the Valar she was most akin to Yavanna. When the\nElves awoke on the shore of Cuiviénen she departed from Valinor and went\nto Middle-earth, where she filled its silence with her singing and the\nsinging of her birds. While in the forest of Nan Elmoth she met and fell\nin love with the Elven-king Elu Thingol, and later she ruled the kingdom\nof Doriath by his side. For thousands of years, she used her powers to\nguard and defend the city with a protection spell called the _Girdle of\nMelian_, but she predicted that one person would one day breach this\ndefense. The Girdle functioned to bewilder any who attempted to enter\nDoriath, and was so potent that even Ungoliant was unable to bypass it.\nShe and her husband had a child, a daughter named Lúthien. During her\nstay in Doriath she became a friend and mentor of Galadriel. Melian\nwanted to know the cause of the exile of the Ñoldor. Galadriel only\nbriefly narrated the story to her, leaving out the death of Finwë, the\nKinslaying at Alqualondë, and the burning of the ships at Losgar. But\neventually she and Thingol learned the truth. Melian's main line of\ndescent is of the Half-elven, and through her daughter the Maian blood\npassed to both Elves and Men. When Beren arrived as foretold, she\ncounseled Thingol against sending Beren for a Silmaril, a quest which\nwould eventually lead to Doriath's ruin. A friend of Mankind, she also\naided Húrin's family by hosting Túrin in Doriath and later helped Beleg\nCúthalion in his search for Túrin by giving him Lembas. When Húrin came\nto Doriath old and carrying a great grief and misery on him, Melian\nhelped him see through his ills. After Thingol's death she left Doriath,\nvisiting Beren and Lúthien for a time warning them of the Dwarves\ntreachery, and the curse on the Mîm's treasure. Shortly there-after, she\nwent back to Valinor, musing upon her sorrows in the gardens of Lorien\nwhence she came. Etymology _Melian_ is Sindarin, from the Quenya\n_Melyanna_, of which the roots are _mel_ (love) and _anna_ (gift). The\nname means “dear gift.” Earlier versions of Melian's name were\n'''Gwenniel '''and GWENETHLIN. _Beren and Lúthien_ (2017) reintroduces\nthe names GWENDELING and GWENDELIN into the 'complete story'. Her rare\ntitle-name _Tóril_ is a word for “Queen.”",
    "other_names": "Gwendeling\nMelyanna\nTóril",
    "titles": "Queen of Doriath",
    "birth": "Before the creation of Arda",
    "rule": "Years of the Trees ?",
    "death": "Did not die being a Maia, returned to Valinor after the death of her\nhusband Thingol",
    "spouse": "Thingol",
    "weapon": "Powers of the Ainur",
    "race": "Maiar",
    "gender": "Female",
    "hair": "Dark",
    "location": "Doriath"
  },
  {
    "name": "Carcharoth",
    "lotr_page_id": "3727",
    "text": "CARCHAROTH, also known as the RED MAW, lived in the First Age of the\nSun, and was the greatest werewolf who ever lived. He was of the line of\nDraugluin. Biography Carcharoth was created as a defence against Huan,\nand was reared by Morgoth's own hands on living flesh and filled with\ngreat power. So Carcharoth, who was also named ANFAUGLIR (IPA:\n/anˈfaʊglir/), the 'Jaws of Thirst', grew to great size and his strength\nseemed beyond compare. His eyes burned like red coals and his teeth were\npoisoned as the spears of the Orcish legions. Carcharoth was the\nguardian of the gate of Angband and none could pass him by strength of\nbody alone. He became involved with the Quest for the Silmaril when\nBeren and Lúthien had to pass him on their way in. He espied them on\ntheir way in, and grew suspicious of Beren because he was disguised as\nDraugluin, who Carcharoth knew to be slain. Before he could take action\nagainst the pair, Lúthien enchanted him with her magic, sending him into\na deep sleep. Unfortunately, on their way out Carcharoth awoke, and\nLúthien was too weary to spell him again. Beren held out the captured\nSilmaril in an attempt to slay the beast, but Carcharoth was not\ndaunted, and bit off Beren's hand at the wrist, Silmaril and all. The\nSilmaril burnt away Carcharoth's insides, and he became crazed with\npain, yet filled with great power. A terror to Eldar, Men and Orcs\nalike, he burst from Angband, slaying anything and everything in his\npath. He continued south through Beleriand, and eventually he arrived in\nDoriath. With the power of the Silmaril inside him, the Girdle of Melian\nhad no effect on him, and his presence placed the entire kingdom in\ngrave danger. To protect Doriath, Beren Erchamion, Elu Thingol, Beleg\nCúthalion, and Mablung joined with Huan the Hound to track down and slay\nthe Wolf. Carcharoth was killed in single combat by Huan in FA 466, but\nboth Huan and Beren were mortally wounded by the poison in Carcharoth's\nteeth. When Mablung cut open the wolf's belly, he found there the\nSilmaril with Beren's hand still closed around it, but when he touched\nthe flesh it was swept away by a wind leaving only the great Jewel.",
    "other_names": "Karkaras Knife-fang, The Red Maw, Anfarguil, the Jaws of Thirst",
    "titles": "Guardian of Angband",
    "birth": "Before the Creation of Arda",
    "death": "FA 466",
    "weapon": "Venom, teeth, claws",
    "race": "Werewolves",
    "gender": "Male",
    "height": "Gigantic",
    "hair": "Black with red stripes",
    "eyes": "Brown",
    "location": "Angband (under the stewardship of Melkor)"
  },
  {
    "name": "Ulmo",
    "lotr_page_id": "2408",
    "text": "ULMO (Quenya; IPA: - “Pourer” or “Rainer”) - also known as '''Ulubôz\n'''or '''Ullubôz - '''was an Ainu, one of the Aratar, and the\nVala responsible for the control over the oceans of Arda. A lover of\nwater, Ulmo was one of the Arda's chief architects and was always in a\nclose friendship with Manwë. He always distrusted Melkor, and the Dark\nLord feared the Sea almost as much as he feared Varda because the sea\ncannot be tamed. Ulmo had no dwelling in Valinor or any permanent\ndwelling on land, as he preferred the deeps of the seas and the rivers.\nHis palace, on the bottom of Vaiya, was called Ulmonan. Biography Ulmo\nseldom came to the Councils of Máhanaxar, and only when in great need.\nHe preferred to stay in Arda, not by walking on the land, as his form\nwould fill man or elf with great dread. All waters were under his\ngovernment: bays, rivers and even the waters under the earth. Where the\npower of Morgoth was strong, however, Ulmo's own power would be sapped\nfrom waters near to Morgoth's corruption. It is through the rivers that\nhe kept in touch with Arda, and thus knew more of the goings on with the\nChildren of Ilúvatar than even Manwë, for in that way he lived in the\nvery veins of the world. His visible form caused fear in mortals and\neven the Elves, as he dressed like a giant wave in glittering green\narmour, blowing his great horns, the Ulumúri. Ulmo always loved the\nEldar and the Edain, even when the Valar forsook Middle-earth. He\nopposed Oromë's plan to bring the elves to Aman, but helped those that\nwere willing to reach it. He uprooted a large island which was later\nknown as Tol Eressëa and used it to ferry them across the Belegaer to\nthe Blessed Realm. Afterwards, he anchored it in the Bay of Eldamar,\nwhich he did because he knew the minds of the Teleri. Ulmo was the Vala\nmost responsible for the fall of Morgoth, by urging Turgon to build\nGondolin and Finrod to build Nargothrond (FA 50). He appeared before\nTuor and urged him to go to Gondolin as a messenger to Turgon. When he\ngot there, he eventually married Turgon's daughter Idril and fathered\nEärendil. Ulmo saved Eärendil's wife Elwing from the sack of the Havens\nof Sirion, allowing her to take a Silmaril to her husband, which allowed\nhim to gain admittance to Valinor and plead for aid. Ulmo also defended\nthem in the council from the potential wrath of Mandos. Maiar of Ulmo -\nOssë, the vassal of Ulmo who guarded the waters around Middle-earth.   -\nUinen, the wife of Ossë whose love for all sea creatures calmed the\nviolent tidal waves and storms.   - Salmar, the music performer of Ulmo\nwho created the Ulumuri.   - Uin, the “primeval whale” served under\nUlmo. It is unknown whether this whale was actually an Ainur to have\nshape like other races of possible Ainur such as the Great Eagles.\nThrough these Maiar, Ulmo learned much of the Elves. Etymology _Ulmo_\nmeans 'pourer''' _or 'rainer_' ''in Quenya.",
    "other_names": "Ullubôz, Ulubôz, Lord of Waters",
    "titles": "King of the Sea, Lord of Waters",
    "birth": "Before the creation of Arda",
    "rule": "Years of the Lamps",
    "death": "Immortal",
    "spouse": "None",
    "weapon": "Powers of the Valar",
    "race": "Valar",
    "gender": "Male",
    "location": "Valinor (Ulmonan)"
  },
  {
    "name": "Òmar",
    "lotr_page_id": "35512",
    "text": "ÒMAR also known as AMILLO was a Valar in the earlier forms of the\nlegendarium. Biography Òmar was youngest of the Valar and the brother of\nSalmar when he entered into the world lastly. He was a master of\nlanguages and knew all tongues and sang great songs for all to hear. He\nwas known to be singing and trilling in the gardens of Oromë near the\nWoods of Oromë where Nielíqui, the daughter of Oromë and Vána danced. He\nwas later involved in the decision to capture Melko and participated in\nthe war with his brother Salmar and the other Valar. When the Elves\nlater came to the Aman, the Teleri learned much of song from him. When\ndarkness fell upon Aman, he spoke of the “lamentation of Vána” referring\nto her sadness over the loss of Laurelin.",
    "other_names": "Amillo",
    "birth": "Before the creation of Arda",
    "death": "Immortal",
    "spouse": "None",
    "weapon": "Powers of the Valar",
    "race": "Valar",
    "gender": "Male",
    "height": "Various",
    "hair": "Unknown",
    "eyes": "Unknown"
  },
  {
    "name": "Vána",
    "lotr_page_id": "2416",
    "text": "VÁNA (Quenya; IPA: - “Beautiful One”) is an Ainu and a Valië who was\nresponsible for the preserving of the youth made for all life in Arda.\nAmong the seven Valier, Vána  was considered a rank of six of the Queens\nof the Valar.She was sister of Yavanna and wife of Orome, and is\npossibly related to Melian. She was known as _VÁNA THE EVER-YOUNG_. \nBiography Vána was the younger sister of Yavanna (_Queen of the Earth_)\nand the wife of Oromë (_Huntsman of the Valar_). In Vána's dwellings she\nhad gardens filled with golden flowers; and often, Vána came to the\nforests of Oromë. Like her sister, the province of Vána was growing\nthings of the world and she was a lover of nature. Vána had influence\nwith the flora and fauna of Middle-earth, and she was associated\nespecially with flowers thus Vána was also known as the “Queen of\nFlowers”. It was said that when the Valar Tulkas & Nessa were wedded on\nthe Isle of Almaren, the first dwelling of the Valar, Vána robed her\nsister-in-law _Nessa the Swift_ (sister of Oromë) with her flowers. In\nthe Days of the Two Trees of Valinor, Arien of the Maiar, before she\ncame to carry the vessel of the Sun, had served Vána by tending to the\ngolden flowers of Vána's gardens watering them with bright dews from the\ngreat golden Tree Laurelin. Melian also was another Maia who initially\nserved Vána before she departed for Middle-earth. After the Darkening of\nValinor and the flight of the Noldor to Middle-Earth, most of the Valar\nwere glad to have their ancient peace back, wishing neither the rumors\nof Melkor and his violence nor the murmur of the restless Noldor to come\nupon them again. Thus for such reasons, they clamored for the\nconcealment of their land Aman. It was said that Vána was one among\nthem. Character According to _The Silmarillion_, “All flowers spring as\nVána passes and opens if she glances upon them; and all birds sing at\nher coming.” Vána robed herself in flowers and it was said that her hair\nwas golden in color. Vána had the beauty of both heaven and earth upon\nher face and in all her works. Like Nessa, Vána also sang and danced\nalong with her maidens. The Maiar of Vána - Arien, the Maia who guided\nthe Sun, was one of her Maiar in Valinor. - Melian, who later in\nMiddle-earth became Queen of Doriath by marrying the Elf-King Thingol.\nEtymology The name _VÁNA_ may have been derived from the Quenya word\n_vanima_ (“beautiful”), as she is often described as “fair”. Hence she\nwas also known as _VÁNA THE FAIR_.",
    "other_names": "The Ever-young\nthe Fair\nQueen of Flowers",
    "titles": "A Queen of the Valar",
    "birth": "Before the creation of Arda",
    "death": "Immortal",
    "spouse": "Oromë",
    "weapon": "Powers of the Valar",
    "race": "Valar",
    "gender": "Female",
    "hair": "Golden",
    "location": "Valinor"
  },
  {
    "name": "Thorondor",
    "lotr_page_id": "2406",
    "text": "THORONDOR (Sindarin; IPA: “Eagle Lord”) was the King of Eagles of\nMiddle-earth during the First Age. He was presumably the greatest of all\nthe Eagles in terms of size, with his wingspan measuring at 30 fathoms\n(180 feet). Biography Thorondor was sent by Manwë, King of the Valar, to\nwatch over the Ñoldor after they arrived in Beleriand. The Eldar first\nencountered him when he helped Fingon rescue Maedhros from imprisonment\nfrom Thangorodrim, upon which he had apparently made his home for a\nshort time. After that, Thorondor and the rest of the Eagles settled in\nthe Crissaegrim. When Gondolin was built, Thorondor became the ever\nvigilant guardian of the city. He rescued Fingolfin's body from\ndefilement after Morgoth killed him, giving the Dark Lord a scar on his\nface. He, Landroval, and Gwaihir rescued Beren and Lúthien when Angband\nwas aroused. When Gondolin fell, Thorondor rescued the survivors. During\nthe War of Wrath, Thorondor and Eärendil led the Eagles in battle with\nthe Dragons, and may have fought with Ancalagon the Black. Fate In\nTolkien's writings, Thorondor is not mentioned after the War of Wrath.\nIt is believed he returned to Valinor, although his descendants remained\nbehind. Gwaihir became the Lord of Eagles in Middle-earth after\nThorondor's departure. Etymology The name _THORONDOR_ was Sindarin for\n“Eagle Lord”, from the words _thoron_ (“eagle”) and _taur_ (“lord,\nking”). Thorondor was also named SORONTAR, which was the\nQuenyan translation of his Sindarin name and came from the words _soron_\n(“eagle”) and _tar_ (“king”).",
    "other_names": "Sorontar",
    "titles": "King of the Great Eagles",
    "birth": "Before the Creation of Arda",
    "death": "Immortal",
    "spouse": "Unknown",
    "weapon": "Talons, beak, raw strength",
    "race": "Great Eagles",
    "gender": "Male",
    "height": "30 fathoms",
    "eyes": "Gold"
  },
  {
    "name": "Nienna",
    "lotr_page_id": "2413",
    "text": "NIENNA (Quenya; IPA or - “Weeping” or “She Who Weeps”) was an Ainu, one\nof the Aratar and a Vala who was responsible for the mercy and grief\nspread across Arda. She was the sister of Mandos and Irmo and had no\nspouse. Her part in the Music of the Ainur was one of deep sadness, from\nwhich grief entered the world at its beginning. She had dominion over\nthe Halls of Nienna, which were on the western edge of Valinor, looking\nover the sea. Biography Nienna was concerned with mourning, and she\npitied the suffering of others, especially the Marring of Arda by\nMelkor. Yet the lesson of Nienna is not of endless grief, but rather of\npity, hope, and the endurance of the spirit. Nienna dwelt in far western\nValinor near Mandos, and she seldom came to Valimar. Her windows looked\nout beyond the Walls of the Night. During the creation of the Two Trees,\nshe watered the mound with her tears. The pity of Nienna is most clearly\nseen in her support for Melkor when he sued for the pardon of the Valar.\nThough she spent her time in the world mourning for the destruction he\nhad wreaked in Arda, when he sued for release after his three ages of\nCaptivity, Nienna spoke on his behalf. After the Flight of the Ñoldor,\nNienna mourned for the destruction of the Two Trees, and her tears\nbrought healing, but could not heal the mortal wounds. Thus, the trees\nbrought forth their last flower and fruit, and made into the Sun and\nMoon. All that is known about her appearance is that she wore a grey\nhood. Given that Gandalf was her greatest student, his being clothed in\ngrey may have been a mark of respect to his teacher. Maiar of Nienna -\nOlórin (Gandalf), Nienna's greatest pupil among all the others who dwell\nin the Halls of Awaiting. She taught him pity and many other things\nbefore he was chosen as the second wizard sent to lead the people of\nMiddle-earth into standing against Sauron. Etymology _NIENNA_ means\n''weeping ''or ''she who weeps _in Quenya and_ _comes_ ''from the root\n_nei_ (“tear”). Other versions of the legendarium In earlier versions,\nNienna was the sister of Manwë and Melkor, and was called “queen of\nshadow”. In _The Book of Lost Tales 1_, a character similar to Nienna\nwas called FUI (Night), the Death-Goddess. In Gnomish she was FUIL, the\nQueen of the Dark. She dwelt in halls that bore her name, and had a roof\nof bats' wings. As _Fui_, she was the spouse of Vefantur (Mandos in\nTolkien's later writings) and dwelt in his halls of Ve. She judged the\nhumans while Vefantur judged the elves. HESKIL (Winter One) and NÚRI\n(One who Sighs) were her names as well. She was also called QALME-TARI\n(Mistress of Death). Similarly, Vairë was an elven storyteller in\nTolkien's early writings, but in his later writings Vairë was the wife\nof Mandos and was responsible for weaving the story of the World. LIST\nOF NAMES AND PRONUNCIATION: - _NYENNA_  - _FUI_ (Quenya; IPA  - “Night”)\n- _HESKIL_ Quenya; IPA  - “Winter One”) - _NÚRI_ (Quenya; IPA  -\n“Sighing One”) - _QALMË-TÁRI_ (Quenya; IPA  - “Mistress of Death”)\nGallery",
    "other_names": "Lady of Mercy\nLady of Pity and Mourning\nNienna the Compassionate",
    "titles": "Queen of the Valar",
    "birth": "Before the creation of Arda",
    "rule": "Years of the Lamps",
    "death": "Immortal",
    "spouse": "None",
    "weapon": "Powers of the Valar",
    "race": "Valar",
    "gender": "Female",
    "location": "Valinor (Halls of Nienna)"
  },
  {
    "name": "Tulkas",
    "lotr_page_id": "2412",
    "text": "TULKAS (Quenya; IPA: - “Strong” or “Steadfast”) is an Ainu, a Vala who\nwas responsible for participating in war and the last of them to descend\ninto Arda, coming to the aid of the others when he heard of their war\nwith Melkor. He was also called TULUKASTĀZ or ASTALDO. Biography Having\nheard of his fellow Valar's struggle against Melkor, Tulkas was the last\nof the Valar to descend upon Arda, thus tipping the scales of battle\nagainst Melkor. Melkor fled before him, and the Spring of Arda was\nbegun. After the Two Lamps were erected and the Valar had made their\nfirst dwelling at Almaren, Tulkas wedded Nessa in a great feast. Being\nweary and content he slept, and Melkor decided his hour to retaliate had\ncome. When the Children of Ilúvatar awoke, there was a council among the\nValar regarding Melkor. Much to Tulkas's delight, it was decided that\nMelkor should be removed. During the War for Sake of the Elves, he\nwrestled with Melkor and bound him with Angainor, which was forged by\nAulë. Upon Melkor's release from captivity, Tulkas remained vigilant and\ndistrustful of him. Character Tulkas is described as delighting in\nwrestling and contests of strength. He wields no weapon, and rides no\nsteed. As he cares little about either past or future, he was not a good\ncouncillor, but nonetheless a very hardy friend. He is described as\nbeing slow to wrath, but also slow to forgive; for that reason, he was\none of the Valar that opposed the release of Melkor. In appearance,\nTulkas was described to have ruddy flesh and golden hair and beard. He\nalso tended to be impatient; before the Awakening of the Elves he urged\nthe other Valar to wage war against Melkor. After the Darkening of\nValinor he also hurried Fëanor to take a decision about surrendering the\nSilmarils. Tulkas was known for laughing in sport and in battle. He was\npossibly the only being on Arda with the courage to laugh in the face of\nMelkor, the most powerful being in Valinor (at the time) - and did so\nonce while engaged in battle with him. Despite not being one of the\nAratar, Morgoth feared Tulkas more than any of the other Valar. He was\nalso the strongest (physically) of all the Valar. Most likely, he was\nphysically stronger than Morgoth, as it was he who first chained him\nwith Angainor. Etymology In Quenya, the name _TULKAS_ means “Strong” and\n“Steadfast”, from the root _tuluk_. His Valarin name is TULUKHASTĀZ,\nwhich means “the golden-haired”, from the words _tulukha(n)_ (“yellow”)\nand _(a)sata-_ (“hair of head”). His Ñoldorin name is TULCUS (“Strong”).\nASTALDO means “the Valiant”. Other names An earlier name for Tulkas was\nTURENBO. Earlier versions of the legendarium In earlier texts, Tulkas\noverthrows Melkor during the battle of the Silent Pools and bounds him\nfor Lumbi. Here, the Hound of Mandos, Gorgumoth, guards Melkor in his\ncaptivity. In an earlier context, Tulkas had a son Telimektar, “whose\ntale is yet to tell”. Gallery",
    "other_names": "Tulukastāz,\nAstaldo,\nTulcus,\nThe Valiant",
    "titles": "Champion of the Valar",
    "birth": "Before the creation of Arda",
    "death": "Immortal",
    "spouse": "Nessa",
    "weapon": "Powers of the Valar,\nHis hands",
    "race": "Valar",
    "gender": "Male",
    "hair": "Golden"
  },
  {
    "name": "Vairë",
    "lotr_page_id": "2415",
    "text": "VAIRË (Quenya; IPA: or - “Weaver”) is an Ainu and Vala who was\nresponsible for the weaving of the story of Arda. Biography Vairë is\ncounted among the Valier, the Queens of the Valar; though not as great\nin power or prestige as some. Her “storied webs” cover the Halls of\nMandos, where she apparently lived. With the passage of time and its\nmany ages, her woven tapestries are expanding and will clothe all of the\nwalls of the Halls of the Dead. After the death of Finwë, Míriel\nreturned to life and dwelt thereafter in the house of Vairë. She was\ngiven the task to record the deeds of the House of Finwë. Etymology In\nQuenya, _Vairë_ means “Weaver”, and was derived from the Primitive\nQuendian _weirē_, which derives from the root _wey_ (“weave, wind”). Her\nÑoldorin name is GWÎR, from _gwi_ (“net, web”).",
    "other_names": "Gwîr,\nThe Weaver",
    "titles": "Queen of the Valar",
    "birth": "Before the creation of Arda",
    "death": "Immortal",
    "spouse": "Mandos",
    "weapon": "Powers of the Valar",
    "race": "Valar",
    "gender": "Female",
    "location": "Valinor (Halls of Mandos)"
  },
  {
    "name": "Oromë",
    "lotr_page_id": "2409",
    "text": "OROMË (Quenya; IPA: - “Horn-Blower” or “Sound of Horns”), also known\nas _'Aldaron (QUENYA; IPA: “HORN-BLOWER”), Araw (SINDARIN; IPA:\n“HORN-BLOWER”) OR Arômêz, _'was an Ainu, one of the Aratar and a Vala\nwho was responsible for the hunt. He was the brother of Nessa and the\nhusband of Vána. Biography During the Years of the Trees, after most of\nthe Valar had withdrawn completely from Middle-earth and hidden\nthemselves in Aman, Oromë still hunted in the forests of Middle-earth on\noccasion. Thus, it was he who discovered the Elves when they first awoke\nat Cuivienen and named them the _Eldar_ . Thereafter he remained close\nin friendship with them. A powerful huntsman, he was active in the\nstruggles against Morgoth. He had a great horn called the Valaróma and a\ngreat steed named Nahar. Huan, a Hound from Valinor, once belonged to\nhim but was later given to Celegorm, one of the Sons of Fëanor.\nEtymology _OROMË_ means “Horn-blowing” and “Sound of Horns”, and is\nderived from the Valarin name ARÔMÊZ. _ARAW_ is the Sindarin translation\nof Oromë. The Sindar additionally referred to him as _TAURON_, which\nmeans “Lord of the Forests” and “The Forester.” It is possible that the\nname comes from the Sindarin _taur_ (“forest”) or the Quenyan _taure_\n(“great wood”). Other names In the Old English translation of Eriol,\nOromë is called WADFREA (“The Huntinglord”), HUNTENA FREA (“Lord of\nHunters”), and WEALDAFREA (“Lord of Forests”). Among the Rohirrim and\nother Northmen, he was also sometimes called BÉMA (Old English,\noriginally _Béaming_; translating _Tauron_ “forest-lord”). Character\nOromë is described as being a mighty lord and a great huntsman, as he\nwould often train his folk and beasts in pursue of evil creatures. He\nloved the lands of Middle-earth and was initially unwilling to leave it.\nHe contrasts with the Vala Tulkas in demeanor; whereas Tulkas laughs in\nsports, Oromë is said to be dreadful in anger. Maiar of Oromë - Tilion,\nthe Maia who guided the Moon, was one of his Maiar in Valinor.   -\nAlatar and Pallando, the last two of the five wizards, were Maiar sent\nby Oromë to Middle-earth. What became of them is not known, although\napparently they journeyed into the east with Saruman, but did not\nreturn. Earlier versions of the legendarium Oromë and his wife Vána were\nonce envisioned to have had a daughter named Nielíqui.",
    "other_names": "Tavros\nAldaron\nAraw\nArômêz\nBéma\nThe Great Rider\nOromë the Great\nTauron",
    "titles": "The Huntsman of the Valar\nLord of Forests",
    "birth": "Before the creation of Arda",
    "death": "Immortal",
    "spouse": "Vána",
    "weapon": "Powers of the Valar\nBow\nSpear",
    "race": "Valar",
    "gender": "Male",
    "height": "Varies"
  },
  {
    "name": "Aulë",
    "lotr_page_id": "35",
    "text": "AULË (Quenya; IPA: - “Invention”) was an Ainur, one of the Aratar and a\nValar, who was responsible for fashioning and crafting the substances of\nwhich Arda, the world, was composed. He was also called '''Mahal\n'''(Khuzdul; IPA: “Maker”), '''Oli '''(Sindarin; IPA: “Dream”) or\nNÁVATAR and delights in the nature of substances and in works of skill,\nbut not concerned with possession or mastery. Besides the shaping of\nArda, Aulë's greatest works were the Two Lamps of the Valar, the vessels\nof the Sun and Moon, and the Dwarves, whom he created out of impatience\nfor the Children of Ilúvatar. He also created Angainor (the chain of\nMelkor). Biography As Aulë was a smith, he was the Valar most similar in\nthought and powers to Melkor, in that they each gloried in the\nfashioning of artful and original things. Both also came to create\nbeings of their own. But while Aulë strove to be true to the original\nintent of the Music of the Ainurs, and submitted all that he did to the\nwill of Ilúvatar, Melkor wished to control and subvert all things, and\nwas jealous of the creations of others so that he would try to twist or\ndestroy all that they made. There was long strife between Aulë and\nMelkor both before and after the creation of Arda. Aulë, however,\ntraditionally opposed attempts to fight Melkor, for fear of the damage\nthat would be wrought to Arda. When the Elves came to Valinor, the\nÑoldor became the students of Aulë. Fëanor was his greatest pupil, and\nfrom him learned to make gems through craftsmanship that is now\nforgotten. This would eventually lead to the Silmarils, the greatest\ncreation of handiwork within Arda. On the Flight of the Noldor, the\nNoldor who returned to Valinor under Finarfin named themselves the\n_Aulendur_, Followers of Aulë. Despite his lordly skill, Aulë was humble\nand compassionate, and indeed the Dwarves survived only because Aulë\nsubmitted them to the will of Ilúvatar. His spouse was Yavanna, with\nwhom he dwelt in central Valinor. The Creation of the Dwarves Desperate\nfor pupils onto whom he could pass his knowledge, and unwilling to wait\nfor the emergence of the Children of Ilúvatar, Aulë created his own race\nof beings, the dwarves. However, he did not have a clear idea of what\nthe Children of Ilúvatar would be like, and because of the presence of\nthe chaos caused by Melkor, Aulë made the Dwarves strong and unyielding,\nand not willing to endure the domination of others, as well as embodying\nsome of his values and desires for Middle-earth. However Aulë did not\nhave the power to give independent life to his creations, they could act\nonly when his thought was on them. When Aulë completed his work he began\nto instruct the Dwarves in a language he had made for them, Khuzdul.\nThen Ilúvatar spoke to Aulë, asking why he would seek to exceed his\npower and authority by attempting to make new life. Aulë repented,\nanswering that the drive to create was kindled in him by Ilúvatar, and\nthat he only wished for other beings to love and teach, with whom to\nshare in the beauty of the world. He admitted that his impatience had\ndriven him to folly and submitted his creations to Ilúvatar. Assuming\nthat they should be destroyed, he made to smite the seven Fathers of the\nDwarves with a great hammer.  As he raised the hammer the Dwarves shrank\nfrom the coming blow, but Ilúvatar stayed Aulë's hand and showed that he\nhad accepted Aulë's offer by gifting the Dwarves with spirits of their\nown, else they could not have been afraid. Ilúvatar accepted the Dwarves\nas his adopted children however, as it was ordained that the elves were\nto be the first-born race, Ilúvatar set the Dwarves to sleep until after\nthe Awakening of the Elves. He told Aulë that while both were his\nchildren, their creation was outside the scope of the Music of the\nAinur, and strife would arise between the Dwarven race and the Elven\nrace as the events of the world unfolded. The Dwarves believe that after\nthey die their spirits move to halls that Aulë has set aside for them\nalone, and that their role will be to rebuild Arda after the Final\nBattle. Maiar of Aulë - Mairon (Sauron), the mightiest of the Maiar of\nAulë who used his knowledge of the metaphysical structure of Arda to\ngreat effect as a servant of Melkor in the First Age of Middle-earth and\nthen was his own master in the Second and Third Ages. When Sauron sought\nto corrupt the elves in the Second Age one of the names he assumed was\nAulendil, meaning devotee of Aulë.   - Curumo (Saruman), the leader of\nthe wizards sent to lead the people of Middle-earth against Sauron, only\nto betray his fellow wizards and ally with Sauron himself (who he also\nbetrayed in the end). It is interesting to note that two of the greatest\nMaiar sent to Middle-earth, that fell, were in the beginning both\naligned with Aulë. The reason for this is probably that this is the\norder most associated with craft, skill, and by these means, power.\nWeaker-willed spirits often fall prey to craving for power in Tolkien's\nworks, and these prove no exception. Also, Tolkien generally sees\nindustry as corruption. It seems Maiar of Aulë are the most powerful\nMaia because they are the closest to Ilúvatar's creation skills. Powers\nAulë seems to have a power most akin to Ilúvatar's - he can create an\ninnumerable amount of things. He made the Two Lamps, and made Angainor,\nMorgoth's chain. Although he does not have access to the Flame\nImperishable, he was able to create life (although it does not have free\nwill). As a Valar, he possesses incredible strength, and has been noted\nto have rebuilt Arda during and after Morgoth's period of destruction\nbefore the coming of the Elves. He likely forged the Valar's weaponry\nand armor for the War of Wrath. His strength is in the construction of\nnew things, and he is as near to the antithesis of the destructive\nMorgoth as one can be.﻿ Etymology _Aulë_ means ''invention ''in Quenya.\n_Mahal_ means ''maker ''in Khuzdul. _Oli_ means _dream_ in Sindarin.",
    "other_names": "Mahal\nNávatar",
    "titles": "The Smith",
    "birth": "Before the creation of Arda",
    "death": "Immortal",
    "spouse": "Yavanna",
    "weapon": "Powers of the Valar",
    "race": "Valar",
    "gender": "Male"
  },
  {
    "name": "Ancalagon",
    "lotr_page_id": "83",
    "text": "ANCALAGON, also known as ANCALAGON THE BLACK, was the greatest of all\nwinged dragons. He was bred by Morgoth during the First Age, and was the\nlargest dragon to have ever existed in Middle-earth. Biography After\nEärendil made his journey to Valinor to convince the Valar to overthrow\nMorgoth and rescue the overmatched and defeated Elves and Edain, The\nHost of Valinor made war upon Morgoth and destroyed his armies. Facing\nfinal defeat, Morgoth unleashed his last and greatest weapon; a fleet of\nwinged fire drakes, led by Ancalagon. So terrible was their onslaught\nthat the armies of the Valar were driven back from the gates of Angband,\nand their coming was said to have been accompanied by a tempest of fire\nand lightning. But Eärendil came out of the West in his blessed ship\nVingilot, accompanied by the Eagles of Manwë led by Thorondor. The\nEagles and Eärendil dueled with Ancalagon and the other Dragons for an\nentire day. Eventually, Eärendil was victorious, casting Ancalagon down\nupon Thangorodrim and destroying the volcanic mountains in his fall. The\ndeath of Ancalagon marked the end of Morgoth's final resistance. Later\nmentions Gandalf spoke of him as he told Frodo the true origin of his\nRing. “It has been said that dragon-fire could melt and consume the\nRings of Power, but there is not now any dragon left on earth in which\nthe old fire is hot enough; nor was there ever any dragon, not even\nAncalagon the Black, who could have harmed the One Ring, the Ruling\nRing, for that was made by Sauron himself.” Etymology The name\n_Ancalagon_ is Sindarin, meaning “Rushing Jaws” from _anca_ (“jaws”) and\nthe root _alak-_ (“rushing”). Other Names The Middle English translation\nfor _Ancalagon_ is ANDRACCA, from _and-_ (“opposition”), _anda_\n(“hatred, envy”), and _draca_ (“dragon”). Character Ancalagon's size is\nnot specified, but must have been colossal due to the destruction of\n“the towers of Thangorodrim”, which are elsewhere identified with the\nthree smoking peaks of the mountain. He was however, said to be as big\nas a mountain. However, his size is never directly specified and some\npowerful but small creatures are able to cause great destruction even in\ndeath, such as Durin's Bane breaking the slopes of Celebdil. Like all\nother Urulóki, Ancalagon breathed fire, which was said to be hotter than\nany other dragon's flame.",
    "other_names": "Ancalagon the Black",
    "titles": "The Black One",
    "birth": "Possibly during the First Age",
    "death": "FA 587",
    "weapon": "Fire, natural body weapons",
    "race": "Dragons",
    "gender": "Male",
    "height": "Not specified, \"As tall as a mountain\""
  },
  {
    "name": "Mandos",
    "lotr_page_id": "2410",
    "text": "MANDOS (Quenya; IPA: - “Prison-Fortress”) is an Ainu, one of the Aratar\nand a Vala who is responsible for the judgement of the Spirits, or Fëa\nof all Elven dead. He also has responsibility for pronouncing the dooms\nand judgments of Eru Ilúvatar under Manwë. His real name is NÁMO\n(Quenya; IPA: “Ordainer” or “Judge”) but was later known by the Elves as\nMandos after his sacred Halls of Mandos, over which he presides and\nwhere ultimately the Elves go after they are slain. Mandos was the sixth\ngreatest of the Lords of the Valar, and fifth greatest Aratar. Biography\nMandos was the brother of Irmo (Lórien) and Nienna in the mind of Eru\nIlúvatar. He and his brother Lórien are the Fëanturi, the MASTERS OF\nSPIRITS. His wife was Vaire the Weaver. He it was who pronounced Manwë's\nDoom concerning the espousals of the Eldar on YT 1172, when Finwë asked\ncounsel for a second marriage, after the death of his wife's passing to\nthe Halls of Mandos. When Melkor began marring Arda before the coming of\nthe Elves, Tulkas arrived and wanted to make war swiftly. At the bidding\nof Manwë, Mandos pronounced the doom of the Firstborn. After the\ncaptivity of Melkor, Mandos had once again pronounced the Doom. Melkor\nspent three Ages in the duress of Mandos thereafter, guarded by his\nhound Gorgumoth in Lumbi. Mandos judged Fëanor to leave Tirion for\ntwelve years after Fëanor's drawing of sword against Fingolfin. After\nthe destruction of the Two Trees, Yavanna asked for the light of the\nSilmarils, which Fëanor denied and he shall be slain, the first in Aman;\nbut Mandos had spoken and revealed that Finwë was the first, having been\nslain at the steps of Formenos by Melkor. When the Ñoldor revolted\nagainst the Valar, Mandos appeared before them and pronounced the Doom\nof the Ñoldor. Only once has he been moved to pity, when Lúthien sang of\nthe grief she and her lover Beren had experienced in Beleriand. Then,\nwith the Elder King's approval, he released them to Middle-earth to\nbegin their second life there as mortal beings with no certitude of\nlife. When Eärendil arrived in Aman to beg for assistance from the\nValar, Mandos considered Eärendil and Elwing's fate as Half-elven and\ngave them and their descendants a choice: either to be counted among\nElves or Men. Character Mandos, upon appearing before the Ñoldor, was\nreferred to be a dark figure with a loud voice, solemn and terrible. He\nwas described as being stern, dispassionate and never forgetting a\nthing. He was the Vala who cursed the Ñoldor leaving Aman, and\ncounselled against allowing them to return. But unlike Morgoth, his\nDooms are not cruel or vindictive by his own design. They are simply the\nwill of Eru, and he will not speak them unless he is commanded to do so\nby Manwë. Etymology His common name _MANDOS_ means “Prison-fortress”. It\nstems from _Mandost_ (“castle of custody”) or _mbando_ (“custody”) and\n_osto_ (“fortified building or place”). His real name, NÁMO, means\n“Ordainer” or “Judge” in Quenya. Other Names The Old English translation\nfor Mandos is NEFREA “Corpse-ruler” from _neo_ (“corpse”) and _frea_\n(“lord”). His title is NEOAERNA HLAFORD (“Master of the houses of the\ndead”). He was also called MORIMANDO, the “Dark Mando”, as opposed to\nManwë's _Kalamando_, the “Light Mando”. In Tolkien's earlier work,\nMandos was named VEFANTUR. Other versions of the legendarium As\nVefantur, his wife was Fui Nienna and together they were called the\n“Gods of Death”. Their halls were located beneath the roots of the\nMountains of Valinor.",
    "other_names": "Námo\nBannoth\nBadhron\nThe Judge\nThe Just",
    "titles": "Doomsman of the Valar, Fëanturi, Keeper of the Houses of the Dead,\nRuler of the Dead",
    "spouse": "Vairë",
    "weapon": "Powers of the Valar",
    "race": "Valar",
    "gender": "Male",
    "location": "The Halls of Mandos"
  },
  {
    "name": "Nielíqui",
    "lotr_page_id": "35481",
    "text": "NIELÍQUI was a Valar and the daughter of Oromë and Vána in the earlier\nforms of the legendarium. Biography Little is known about Nielíqui save\nthat she was small and a maiden that often danced in her father's woods.\nThe Vala Òmar was known to sing in gardens of Oromë nearby while she was\ndancing.",
    "birth": "unknown",
    "death": "Immortal",
    "spouse": "None",
    "weapon": "Powers of the Valar",
    "race": "Valar",
    "gender": "Female",
    "eyes": "Unknown"
  },
  {
    "name": "Ungoliant",
    "lotr_page_id": "2378",
    "text": "UNGOLIANT (Sindarin IPA: - “Dark Spider”) was a primordial taking the\nshape of a gigantic spider. She was initially an ally of Melkor in Aman,\nand for a short time in Middle-earth as well. She is the mother of\nShelob, and therefore the oldest, and first spider of the south,\npossibly even the first spider of Arda. Biography Origins The true\norigin of Ungoliant is unknown, and was not even known by the Valar. It\nis said by some that she came from the Darkness itself that lies about\nArda and was once an ally of Melkor when he looked down upon the world\nwith envy. Later, she changed her allegiance from him to herself,\ndesiring only to be a mistress of her own insatiable craving to devour\nall light - to feed her everlasting emptiness. Early years When Melkor\nwas defeated and imprisoned by the Lords of the West after the first\nElves awoke in Cuiviénen, Ungoliant escaped the attacks of the Valar and\nthe hunters of Oromë and fled to the southern part of Aman. There, in a\nravine south of the mountain Hyarmentir, she established her dark abode\nand took the physical form of a monstrous spider, and sucked up all the\nlight she could find. After every feeding, she spun forth dark nets of\ngloom that strangled any light from entering her lair of darkness. Yet\nshe hungered for more of it: for although she hated light, she craved\nits sustenance as well. Alliance with Melkor Eventually, Melkor sought\nout Ungoliant in order to exact his revenge against the Valar and the\nElves. He came to her and told her of his plans. Though she was tempted\ngreatly by Melkor's plan for her to drink the light of the Two Trees of\nValinor, she feared the power of the Valar and was hesitant to accompany\nhim. To mollify her, Melkor offered to sate her hunger with whatever she\nwished if she would aid him in his vengeance. She agreed, and they came\nshortly thereafter to Ezellohar, where she drained the Trees of their\nsap, poisoned them, and drank the Wells of Varda dry. The Unlight\nproduced by Ungoliant stymied the pursuit of Oromë and Tulkas, and\nMelkor escaped to Middle-earth with her. However, her consumption of\npower of the Trees and the Wells caused her to swell to a size and shape\nso vast and hideous that even Melkor began to grow afraid. When they\narrived in Lammoth in Middle-earth, Melkor, now known as Morgoth, hoped\nto escape to the ruins of Angband where the remnants of his forces\nawaited him. Suspecting that he intended to leave his promise to her\nunfulfilled, Ungoliant demanded the gems that Morgoth had stolen from\nFormenos before they could reach Angband. She devoured them, and grew to\nan even more monstrous size. She then demanded that Morgoth surrender to\nher the Silmarils. However, Morgoth refused, and she attacked him.\nWeaving her dark webs, she attempted to enmesh him in her nets and take\nthe Silmarils by force. Morgoth gave out a terrible cry of pain as she\nattacked, which was heard by the Balrogs hibernating under the ruins of\nAngband. They awoke and immediately rushed to the aid of their Lord,\ntearing apart Ungoliant's webbing with their fiery whips and forcing her\nto break off her attack. She fled, and the Balrogs prepared to pursue\nand destroy her, but they were checked by Morgoth, who ordered them to\nreturn with him to Angband. Ungoliant's attack upon Morgoth left an\nechoing scream ever after on the land that gave the area the name\nLammoth, and it is said to this day that when one screams in that place,\nthe voice of the Dark Lord echoes back from the surrounding hills. Final\nYears and Legacy Driven off by the Balrogs, Ungoliant fled to Nan\nDungortheb, where she bred with the Great Spiders that dwelt there,\nincreasing the terror and power of her kind. The creatures that later\ninfested the area were her surviving offspring and descendants,\nincluding her infamous daughter, Shelob, who dwelt from the Second and\nThird Ages onwards on the borders of Mordor, as her last surviving\nchild. It is said that Ungoliant ultimately perished at her own hands\nwhen, in her ever growing and eternal hunger, she eventually devoured\nherself. Others say Ungoliant, after retreating to an isolated island in\nthe Belegaer, was slain by Eärendil, and with her darkness destroyed,\nlight came to many regions from which it had long been hid. Towards the\nend of the First Age, she had captured the sun (Arien/Urwendi) with her\ngloom nets and Earendil encountered her on his journey across the seas\non the Vingilot. Earendil ultimately freed Urwendi freeing the Magic\nSun.Similarly, Tolkien projected a tale wherein Ungoliant ensnared the\nSun in her webs while it sailed under the earth: with the result that\nthe Sun was no longer enchanted, only the Moon: Urwendi imprisoned by\nMóru (upset out of the boat by Melko and only the Moon has been magic\nsince). The Faring Forth and the Battle of Erumáni would release her and\nrekindle the Magic Sun. Tolkien, J. R. R.; John D. Rateliff. The History\nof the Hobbit: Mr Baggins and Return to Bag-End: Mr Baggins v. 1 (Kindle\nLocations 7303-7306). HarperCollins Publishers. Kindle Edition.\nEtymology The name _Ungoliant_ in Quenya is UNGWELIANTË, which means\n“Dark Spider”, from _ungwë_ (“dark”) and _liantë_ (“spider”). UNGOLIANT\nis the Sindarin translation of her Quenya name. Other names The Eldar\ncalled her VIRILOMË (WIRILOMË in Vanyarin) or GLOOMWEAVER. In Sindarin,\nthis name is translated into GWERLUM.",
    "other_names": "Ungweliantë,\nSpider of Night,\nUngweliant,\nWirilómë,\nGloomweaver,\nMóru,\nPrimeval Night\nNight\nGwerlum",
    "death": "Possibly end of First Age",
    "weapon": "Unlight",
    "race": "Great Spiders",
    "gender": "Female",
    "height": "Enormous",
    "eyes": "Red"
  },
  {
    "name": "Huan",
    "lotr_page_id": "2365",
    "text": "HUAN was a great wolfhound of the First Age. He was given by the Vala\nOromë the Hunter to his friend Celegorm, one of the Sons of Fëanor. Huan\nwas as large as a small horse, and accompanied Celegorm on his huntings.\nWhen the Ñoldor under Fëanor rebelled, Huan went with his master to\nMiddle-earth. Huan had been granted special powers by the Valar, and was\nallowed to speak three times before he died. It was also prophesied that\nhe could not be killed unless it was by the greatest wolf that ever\nlived. Biography Huan was originally a Hound of Oromë in Valinor and was\neventually given to Celegorm, Fëanor's third son. He went into exile\nwith his master during the Flight of the Ñoldor. He might have stayed\nwith his master in Himlad and later fled with him to Nargothrond after\ntheir defeat in the Dagor Bragollach. He became involved with the Quest\nfor the Silmaril. When Beren had left Lúthien and gone with Finrod\nFelagund to Angband but had been captured in Tol-in-Gaurhoth, Lúthien\nset out to rescue him. She was intercepted by Celegorm and Curufin, who\nwere living in Nargothrond at the time and were hunting. Huan smelt\nLúthien and captured her, and she was brought before Celegorm. Celegorm\nand Curufin did not reveal to her that they had sent Beren to his death\nby the hand of Sauron, and took her as a prisoner to Nargothrond, “for\nher own protection”, secretly plotting to wed her to Celegorm and\nthereby force an alliance with Lúthien's father Thingol. Huan felt pity\nfor Lúthien, and sought her out. Speaking for the first time, he told\nher of a way to escape, using a secret exit, and then accompanied her to\nTol-in-Gaurhoth where, with the help of Lúthien's magic, he killed all\nof Sauron's werewolves until Sauron himself came out, knowing of the\nprophesy about Huan's death he took the shape of the greatest wolf that\nhad ever lived up to that point. Huan nevertheless managed to defeat\nhim, and Sauron was forced to flee. Huan went back to his master, while\nLúthien and Beren went on their way back to Doriath, they came across\nCelegorm and Curufin once more, who had been exiled from Nargothrond by\nOrodreth when he learned of their deeds. Curufin tried to kill Lúthien,\nbut Huan turned against his master, defending Beren and Lúthien.\nSpeaking for the second time, Huan told Beren and Lúthien of his plan to\ngain entrance to Angband, bringing them the skin of the werewolf\nDraugluin and the bat-skin of Sauron's messenger Thuringwethil. Using\nthese skins as disguise Beren and Lúthien went to Angband, while Huan\nhunted in the wild. After Beren and Lúthien had won the Silmaril but\nBeren had lost his hand to the werewolf Carcharoth, Huan joined Beren,\nThingol, Beleg Cúthalion and Mablung in the Hunt for the Wolf. Huan and\nBeren managed to kill Carcharoth, but Huan was mortally wounded.\nSpeaking for the third and last time, he wished Beren and Lúthien\nfarewell, and died. Etymology _HUAN_ literally means “great dog, hound”,\nderiving from the Sindarin _hû_ (“hound”). In Quenya, Huan also means\n“hound”, which comes from the word _khugan_ or _hunen_. Other versions\nin the legendarium In earlier texts, Huan was described to be the\n“Captain of Dogs” and a rival to Tevildo (later Sauron), the Prince of\nCats. Here, Huan met Tinuviel (Lúthien), who was initially afraid and\nfled from him. With his speed Huan overtook her in two leaps and spoke\n“soft and deep the tongue of the Lost Elves”.",
    "titles": "Wolfhound of Oromë\nMount of Celegorm\nCaptain of Dogs",
    "birth": "First Age",
    "death": "FA 466",
    "weapon": "Teeth, claws, Powers of the Valar",
    "race": "Great Dogs",
    "gender": "Male",
    "height": "Horse-sized"
  },
  {
    "name": "Lungorthin",
    "lotr_page_id": "7165",
    "text": "LUNGORTHIN was a Balrog mentioned in earlier versions of _The\nSilmarillion_. Biography Like Gothmog, he bore the title of “Lord of\nBalrogs”. He was the captain of security in Angband and, like his\nsuperior officer, Gothmog, was fiercely loyal to his lord, Morgoth. It\nis unknown if he was an earlier version of Gothmog, but he might have\nbeen a different Balrog altogether. de:Lungorthin es:Lungorthin\nit:Lungorthin ru:Лунгортин",
    "titles": "Lord of Balrogs, Captain of Angband",
    "birth": "Before the creation of Arda",
    "death": "First Age ??",
    "weapon": "Fiery weapons",
    "race": "Balrogs",
    "gender": "Male",
    "hair": "Mane of red flame"
  },
  {
    "name": "Estë",
    "lotr_page_id": "2414",
    "text": "ESTË (Quenya; IPA: ) was a Ainu and a Vala who was responsible for the\nhealing of the hurt and weary. Biography Estë lived with her husband in\nLórien. She did not walk by day, but instead she slept upon an island of\nthe tree-shadowed Lake of Lórellin in Lórien. And all those who dwelt in\nValinor drew refreshment from the fountains of Estë and her spouse Irmo\nin Lórien. In like manner, to the gardens of Lórien, theValar themselves\noften came and would find easing and reposing there from the burdens of\nArda. Melian had formerly served both the Estë and Vána. In Lórien,\nMelian dwelt there long tending to the trees that flowered in the\nGardens of Lórien before she departed for Middle-earth . After a time,\nwhen the Elves dwelt in Valinor, the King of the Ñoldor, Finwë, was\ngrieved that his first wife had no more strength to carry on any longer.\nAfterwards, Manwë surrendered the care of Miriel to the spouse of Estë,\nIrmo in Lórien. Estë and her maidens still tended to the body of Miriel,\nand it remained unwithered, though Miriel never came back among the\nliving. It was said that Estë did not indeed attend the 'Councils of the\nValar'. Thus, she was not reckoned among the Valier but was counted\ninstead as the Chief of the Maiar. She dressed in grey. Etymology _ESTË_\nis a Quenyan word that meant 'rest'.",
    "birth": "Before the creation of Arda",
    "death": "Immortal",
    "spouse": "Irmo (Lórien)",
    "weapon": "Power of the Valar",
    "race": "Valar",
    "gender": "Female"
  },
  {
    "name": "Bregalad",
    "lotr_page_id": "2486",
    "text": "BREGALAD, known mainly as QUICKBEAM, was a middle-aged Ent at the time\nof the War of the Ring. He wasn't as old as Treebeard, as he can be\ndescribed as quite young. He guarded the Rowan trees, as he resembled as\na rowan himself. He was one of Skinbark's people, and he made his home\non the mountain-slopes at the west of Isengard until the Orcs cut down\nthat forest, then he had no choice but moved to an ent-house near\nDerndingle in the area of Fangorn forest. Biography At the Entmoot,\nBregalad lived up to his reputation for hastiness; he was the first Ent\nthat decided to attack Isengard, since Saruman's orcs had destroyed many\nof his rowan groves, so he was especially angry with it. Seeing that\nBregalad's mind had already been made up, Treebeard then sent him to\nwatch over Merry and Pippin while the debate at Entmoot among the other\nEnts continued. He sang songs and laughed with the Hobbits; they stayed\nat his ent-house near Derndingle, where the Entmoot was held. Bregalad\nlater played an important role in the attack on Isengard, as he fought\nalong side with Treebeard, and he nearly captured Saruman himself. After\nthe water from Isen River had flooded Isengard, he stood guard at the\nbottom of the stairs of Orthanc. After the War of the Ring, his furthur\nfate is unknown, but he possibly died in Fourth Age.",
    "other_names": "Quickbeam",
    "titles": "Guard of the Rowan Trees",
    "birth": "TA 2519",
    "death": "Unknown",
    "race": "Ents",
    "gender": "Male"
  },
  {
    "name": "Gothmog (Balrog)",
    "lotr_page_id": "4883",
    "text": "GOTHMOG (Sindarin IPA: - “Strife and Hate”) was the Lord of Balrogs\nduring the First Age, and the greatest Balrog ever to walk Middle-earth.\nAs the High Captain of Angband, his only equal in rank was Sauron. He\nfought many battles in the name of his master Morgoth, and was\npersonally responsible for killing two of the High Kings of the Ñoldor.\nGothmog, like the rest of his kind, carried a fiery whip into battle,\nbut he was also known to have wielded a great black axe, which was\nfeared by elves across the continent of Beleriand. Biography Gothmog was\ninitially one of the Maiar who were under the allegiance of Melkor.\nPrior to the Revolt of the Ñoldor, he was the High Captain of Angband\nand given the title “Lord of the Balrogs.” During the Dagor-nuin-Giliath\nin YT 1498, Fëanor pressed to Angband with his company, and in that\nhour, the Balrogs were issued forth. Gothmog was among them. Fëanor came\neven within sight of Angband, but was ambushed with few elves about him.\nSoon he stood alone, but long he fought on alone with all balrogs.\nGothmog turned in at the end of the bout, and at the last Gothmog, Lord\nof the Balrogs, smote him to the ground, inflicting a mortal wound, and\nthe High King of the Ñoldor plunged to the ground. The Sons of Fëanor\narrived and carried the body of their father away, but Fëanor had\npassed. Gothmog reappeared as a general of Angband in several more major\nconflicts, including the Dagor Aglareb and the Nirnaeth Arnoediad.\nDuring the Nirnaeth, Gothmog engaged the High King of the Ñoldor,\nFingon, in battle. Gothmog separated Fingon from the main host but was\nunable to kill Fingon until another Balrog appeared behind the Ñoldor\n“cast a throng of steel about him”. This allowed Gothmog to slay Fingon\nand beat the body to dust. Thereafter, he captured Húrin, father of\nTúrin Turambar, and dragged him back to Angband. In FA 510, Gothmog and\nthe forces of Angband beseiged the Hidden City of Gondolin. They held\nthe northern gates and were later confronted by Ecthelion of the\nFountain, whom Gothmog dueled. Knocking Ecthelion's sword out of his\nhands, Gothmog prepared to strike at him but, as he raised his axe,\nEcthelion ran forward at the Balrog lord, ramming his pointed helmet\ninto the beast's chest and forcing both of them into the Fountain of the\nKing. The waters quenched the flames of Gothmog that kept him alive and\ndrowned Ecthelion, ending the Battle of Gondolin. Etymology The name\n_Gothmog_ is from the Quenyan terms _gos_ or _goth_ (“dread”) and\n_-mbaw_ (“compel, force, subject, oppress”). Gothmog's Quenya name was\nOSOMBAUKO (or OÞOMBAUKO; IPA: or Vanyarin ). His name in Sindarin means\n“Strife and Hate”. Other versions of the legendarium Gothmog was briefly\nconceived as a “son of Melkor and the ogress Fuithluin”, and went by the\nname of KOSOMOT. The root of the name _moko_ translates to “hate”. There\nwas another concept of the Children of the Ainur, Melkor had a son\nKosomot (later Gothmog) with an ogress called Fuithluin. Gallery",
    "titles": "Lord of Balrogs, High Captain of Angband",
    "birth": "Before the creation of Arda",
    "death": "FA 510",
    "weapon": "Fiery whip, Large black axe",
    "race": "Balrogs",
    "gender": "Male"
  },
  {
    "name": "Landroval",
    "lotr_page_id": "5191",
    "text": "LANDROVAL was one of the Great Eagles of Middle-earth and the brother of\nGwaihir the Windlord. Biography Landroval was a descendant of Thorondor.\nIt was said that Landroval and his brother Gwaihir helped Thorondor\nrescue Beren and Luthien from Angband. During the Third Age, it is\npossible that Landroval fought in the Battle of the Five Armies with the\nother Great Eagles. Landroval assisted Gwaihir in his many associations\nwith Gandalf and his companions. He was present at the Battle of the\nBlack Gate, swooping to attack the Nazgûl on their fell beasts. Together\nwith Gandalf, Gwaihir and Meneldor, he also rescued Frodo Baggins and\nSam Gamgee from Mordor after the completion of the Quest of the Ring.\nEtymology The name _Landroval_ is Sindarin and means “Broad Wing”. It\ncame from the words _land_ (“broad”) and _roval_ (“pinion, wing”).",
    "birth": "Possibly First Age",
    "death": "Possibly still alive",
    "weapon": "Claws, beak",
    "race": "Great Eagles",
    "gender": "Male"
  },
  {
    "name": "Scatha",
    "lotr_page_id": "2273",
    "text": "SCATHA was one of the greatest of the Long-worms that infested the Grey\nMountains in the north of Middle-earth. Biography Of his life, little is\nknown. However it is possible that Scatha was a remnant of the dragons\nof Morgoth that fled into Northeast after the War of Wrath at the end of\nthe First Age. It is not certain whether Scatha was the dragon which\nkilled Dain I and his son Frór. He appeared in the Third Age, and his\nlair was in the southern slopes of the Grey Mountains. He greatly\ntroubled the Dwarves and Men living in the lands North of the Wilderland\nand had stolen a great deal of their treasure. He was slain by the\nÉothéod leader Fram, son of Frumgar (an ancestor of Eorl the Young) in\nthe early days of the Éothéod (roughly TA 2000). After Scatha's demise,\npeace came to the land save for a dispute over his stolen treasure. In\nhis hoard was found a silver horn, the Horn of Rohan later given to\nMeriadoc Brandybuck by Éowyn. The Dwarves also claimed the horn\n(partially justified as the Horn of Rohan was said to be Dwarven make)\nbut Fram would not give them anything. Instead, Fram sent them a\nnecklace made out of Scatha's teeth. The Dwarves were insulted and may\nhave slain him and took what they wanted. Etymology His name was likely\ntaken from Anglo-Saxon _sceaða_, “injurious person, criminal, thief,\nassassin”. Speculations - It is likely that Scatha was not the one\nresponsible for death of Dain I as Scatha was killed in TA 2000, long\nbefore the Dain's incident happened in TA 2589. Thus, Scatha could or\ncould not be a fire-breathing one.   - It's possible, as a flightless\ndragon, that Scatha participated in the attack on Gondolin and looted\nthe city after its fall. Thus the Elvish swords, Glamdring, Orcrist, and\nSting, may have been part of the hoard that Fram now possessed. Gallery",
    "other_names": "The Worm",
    "death": "Around TA 2000",
    "race": "Dragons",
    "gender": "Male",
    "location": "Grey Mountains"
  },
  {
    "name": "Ilmarë",
    "lotr_page_id": "2588",
    "text": "ILMARË (Quenya; IPA: - “Starlight”) was a chief amongst the Maiar and\nthe handmaiden to Queen Varda. Biography Ilmarë was the handmaiden of\nVarda, thereby a guardian spirit of the stars, and one of the chiefs of\nthe Maiar, along with Eönwë, the Herald and Banner-Bearer of King Manwë.\nEtymology In Quenya, _ILMARË_ means “Starlight”, from _ilma_.\nChristopher Tolkien has noted that _Ilmarë_ is related to such words as\n_Ilmen_ and _Ilmarin_. Her name was possibly inspired by _Kalevala_,\nwhere one of the heroes is called Ilmari. Other versions of the\nlegendarium Earlier in the legendarium, Ilmarë and Eönwë were conceived\nas the son and daughter of Manwë and Varda, previously referred to as\nERINTI and Fionwë Urion. Later, Tolkien abandoned the idea of the\nChildren of the Valar. As Erinti, she was a Valië here of love, music,\nand beauty, also named Lotesse and Akairis (“bride”), sister of Noldorin\nand Amillo. The three of them left Valinor and dwelt in Inwenore (later\nTol Eressëa). The second half of January was called Enrintion, which was\nnamed after her.",
    "titles": "Handmaid of Varda",
    "birth": "Before the creation of Arda",
    "weapon": "Powers of the Ainur,",
    "race": "Maiar",
    "gender": "Female"
  },
  {
    "name": "Draugluin",
    "lotr_page_id": "3729",
    "text": "DRAUGLUIN was the first werewolf to be bred by Morgoth during the First\nAge of Middle-earth. Biography Draugluin was bred from the Wolves and\nimbued with an evil spirit sent by Morgoth himself. Draugluin was a\ndreadful, old, and evil abomination and was the lord and sire of all\nwerewolves of Beleriand, and dwelt with his master Sauron in\nTol-in-Gaurhoth, the former watchtower of Finrod Felagund. Draugluin was\nslain by Huan during the Quest for the Silmaril after a long battle, and\nBeren and Lúthien used his pelt to sneak into Angband. Draugluin was the\nsire of Carcharoth and many other werewolves. It is probable the Wargs\nof the Third Age and the White Wolves were descended from him, as these\nwolves could speak, suggesting they had Fëar. Etymology _DRAUGLUIN_\nmeans “Blue wolf” in Sindarin, from _draug_ (“wolf”) and _luin_\n(“blue”). DRAUGLIR was an earlier form of the name.",
    "other_names": "Drauglir",
    "death": "FA 465",
    "race": "Werewolves",
    "gender": "Male"
  },
  {
    "name": "Thuringwethil",
    "lotr_page_id": "5372",
    "text": "THURINGWETHIL was a Vampire servant of Sauron in his fortress of\nTol-in-Gaurhoth (the former Tol Sirion), during her time serving Morgoth\nduring the First Age. Biography Thuringwethil was Sauron's herald and\nwas stationed at Tol-in-Gaurhoth by the time of the Quest for the\nSilmaril. She was probably slain or died during the fight between Sauron\nand Huan in the fortress. She served as a herald, or a messenger, for\nSauron at Tol-Sirion. Her origins were not mentioned, but her ability to\ntake forms suggest that she could be a Maia. She was described to have\nfingered-wings and iron claws. Lúthien was disguised as Thuringwethil\nand introduced herself as such upon infiltrating Angband. 'Thuringwethil\nI am, who cast a shadow o'er the face aghast of the sallow moon in the\ndoomed land of shivering Beleriand.' ― Lúthien in her disguise, Lay of\nLeithian, Canto XIII Etymology _THURINGWETHIL_ means “Woman of the\nSecret Shadow” from the Sindarin _thurin_ (“secret”) and _gwath_\n(“shadow”).",
    "birth": "Unknown",
    "death": "FA 465",
    "race": "Vampire",
    "gender": "Female"
  },
  {
    "name": "Gostir",
    "lotr_page_id": "21895",
    "text": "GOSTIR was the name of one of the Dragons of Morgoth about whom almost\nnothing is known. Biography Gostir was a dragon only known by name.\nEtymology _GOSTIR_ means “terrible sight” in Sindarin, from _gos_\n(“horrible”) and _thîr_ (“opinion, expression, face”). The earlier form\nof the name was GORSTHIR.",
    "birth": "Unknown",
    "race": "Dragons",
    "gender": "Male"
  },
  {
    "name": "Finglas",
    "lotr_page_id": "3464",
    "text": "FINGLAS (Sindarin for 'hair-leaf'), also known in Westron as LEAFLOCk,\nwas an Ent of Fangorn Forest. Finglas was one of three oldest Ents still\nliving during the end of the Third Age. He, Skinbark, and Treebeard were\nthe only ones left of the first and eldest of the Ents in Middle-earth.\nBy the time of the War of the Ring, Finglas had become sleepy and\n“treeish” (dormant and inanimate, like a tree). He stood alone in a\nmeadow and dozed during the summer. At first he would awake in\nwintertime, but eventually he remained in place year-round, preferring\nto remain dormant to avoid the troubles of the world.",
    "other_names": "Leaflock",
    "race": "Ents",
    "gender": "Male",
    "location": "Fangorn forest"
  },
  {
    "name": "Meneldor",
    "lotr_page_id": "7617",
    "text": "MENELDOR was a Great Eagle who dwelt at the Eagles Eyrie, at the north\nhalf of the Misty Mountains. Biography He was a friend and follower of\nGwaihir and probably dwelt with him on their eyrie in the Misty\nMountains. He along with Gwaihir and Landroval was one of the Eagles who\nrescued Frodo and Sam from the slopes of Mount Doom (Orodruin), after\nthe destruction of the Ring. Etymology The first element of his name,\n_menel_, means “heaven”.",
    "race": "Great Eagles",
    "gender": "Male"
  },
  {
    "name": "Fimbrethil",
    "lotr_page_id": "3462",
    "text": "FIMBRETHIL was Treebeard's long-lost wife. The pair were beloved since\nbefore even Morgoth first arose in power during the youth of the world.\nTranslated, her name meant, according to the _1966 Index,_ 'slim-birch'\n(according to Appendix F, 'slender-beech'). As with all of the other\nEntwives, Fimbrethil had been missing since Sauron's forces destroyed\nthe gardens of the Entwives during the Second Age. At the time of the\nWar of the Ring, Treebeard had not seen his beloved Fimbrethil for over\n3,000 years.\n\nMany other races wrote tragic songs about the loss of the Entwives and\nthe remaining Ents' sad search for them; the Elves made many songs about\nit, one of which Treebeard recited to Merry and Pippin.\n\nTreebeard said that the Ents made no great songs about the lost\nEntwives; they were content to chant their beautiful names under their\nbreath whenever their thoughts turned back to them.\n\nDuring the Last March of the Ents against Isengard, Treebeard felt that\nmany of the Ents were marching to their doom, and that he might never\nsee his Fimbrethil ever again. Treebeard told Merry and Pippin that\nSaruman had to be stopped, although he would dearly have liked to see\nFimbrethil once again",
    "location": "Brown Lands, throughout Eriador and Beleriand (First Age)",
    "language": "Entish",
    "death": "Fate unknown; went missing by the late Second Age",
    "spouse": "Treebeard",
    "other_names": "Wandlimb",
    "gender": "Female",
    "race": "Ents"
  },
  {
    "name": "Ulrad",
    "lotr_page_id": "10209",
    "text": "ULRAD was one of the men in the outlaw band led by Turin. He was a\nfriend of the man that Turin killed to gain entry to the band. He\ncontested Turin's right to be accepted into the outlaws. He is partly\nheld responsible by Mim the petty dwarf for not being able to speak to\nhis so before he died because Ulrad was one of the men that bound him.\nUlrad's fate is not revealed after this.",
    "position": "Outlaw",
    "death": "F.A. 489\nAmon Rûdh",
    "location": "Dor-Cúarthol",
    "affiliation": "Gaurwaith",
    "gender": "Male",
    "race": "Men"
  },
  {
    "name": "Glaurung",
    "lotr_page_id": "2448",
    "text": "GLAURUNG was the first terrestrial, fire-breathing Dragon in\nMiddle-earth. He is known as the Father of Dragons.\n\nBiography\n\nEarly Years\n\nAfter suffering a number of defeats at the hands of the Ñoldor in\nBeleriand, Morgoth came to realize that his armies of Orcs were no match\nfor the Noldor unaided. As such, he began to experiment with ways to\ncreate new, deadlier creatures for use in his armies. Glaurung was the\nresult of these experiments. After a century of brooding and growing in\nthe dark pits of Angband, Glaurung first emerged in FA 260 and attacked\nthe Elves maintaining the Siege of Angband. Though Glaurung was not of\nthe winged race that would later arise, he was the greatest terror of\nhis time. He burned and ravaged Ard-galen, the land of the Elves in\nHithlum and Dorthonion. However, he was not yet at his full strength, so\nwas driven back by Fingon, the prince of Hithlum at that time, and his\narchers. Morgoth was displeased with Glaurung for revealing himself\nbefore he had grown to full strength, as Morgoth had planned for\nGlaurung's existence to be a complete surprise.\n\nTo Glaurung, this attack was merely a youthful testing of his strength.\nTerrible as he was to the Elves, the armor of his scales was still\nvulnerable to the bite of weapons. However, despite his untimely foray,\nMorgoth's plans were not disrupted.\n\nWar upon the Elves\n\nDagor Bragollach\n\nGlaurung was contained in Angband for another two centuries before he\nwas again loosed during the Fourth Battle of the Battles of Beleriand.\nKnown as the Dagor Bragollach for the fires unleashed by Morgoth from\nthe Iron Mountains, Glaurung in full power led Melkor's forces against\nthe High Elves of Beleriand. Now fully grown, none could withstand his\nmight, and with the Balrogs at his side, Glaurung led the Orcs to an\noverwhelming victory and broke the siege of Angband.\n\nNirnaeth Arnoediad\n\nIn the fifth battle, the\n\nNirnaeth Arnoediad, Glaurung caused even more destruction, as he had\nfathered a brood of lesser Dragons to follow him into battle. So a great\narmy of Elves and Men fell before the onslaught, for none could\nwithstand the Dragonfire save the Dwarves of Belegost, who had come to\nbattle a common foe.\n\nAfter the Elven and Edain armies had been broken, Morgoth used Glaurung\nto hold the territories he gained; but force in battle was not the only\npower the monster knew. He brought many under his sway with the binding\npower of his serpent eye and hypnotic Dragon Spell.\n\nThe Sack of Nargothrond\n\nAfter Glaurung aided Morgoth during the Battle of Unnumbered Tears, he\nwas given the assignment to complete the Sack of Nargothrond, one of the\nElven fortresses in Beleriand. Glaurung came upon Nargothrond with great\nforce, and sacked the kingdom easily. He faced Túrin, son of Húrin, at\nthe gate and so he froze Túrin with his eyes. Túrin heard the screams of\nFinduilas, daughter of Orodreth, as he stood there. When the captives\nhad been taken away, Glaurung unfroze Túrin and gave him two choices:\nthe first to follow Finduilas, and the second to aid his mother and\nsister, who were suffering in Dor-lómin. Túrin chose the latter, and in\nthis way he was deceived by the dragon, for his mother and sister were\nliving well in Doriath. Glaurung then gathered up all the treasures of\nFelagund and hoarded them deep within Nargothrond's underground halls,\nhe then sat atop his hoard, guarding it jealously, and so he rested.\n\nLast Years\n\nGlaurung received knowledge of Morwen and Nienor's departure to seek\ntheir family members. In the forest where they were travelling, Glaurung\nfound Nienor and caused her to lose her mind. This caused her to run\nthrough the forest “like a deer”. Soon after this, Túrin found her\ncrying on Finduilas's grave. Not knowing that she was his sister, Túrin\nnamed her Níniel (Tear maiden) and took her to his home with the folk of\nBrandir. There they lived for the next three years, during which they\nfell in love.\n\nDeath\n\nAfter those years, Glaurung attacked the area around their home. Túrin\nresolved to kill the dragon. Two men went with him. One became afraid\nand fled, and the other was crushed by rocks. However, Túrin was able to\nkill Glaurung by thrusting his sword, Gurthang, into Glaurung's belly.\nGlaurung felt his death wound and screamed. When the dragon's blood\ntouched Túrin, he fell into a swoon. Glaurung screamed until his\nstrength was gone. Nienor found him there, with Túrin beside him. With\nhis last breath, Glaurung gave Nienor her memory back, and died. Shortly\nthereafter, Nienor jumped into the river below, and Túrin awoke and\nthrew himself on his sword.\n\nEarliest version\n\nIn _The Book of Lost Tales II_, _Glorund_ was the early name of\nGlaurung.",
    "other_names": "Undolaurë\nLaurundo\nGlorund (in the Lost Tales)",
    "titles": "The Father of Dragons\nThe Great Worm\nThe Deceiver\nThe Golden",
    "location": "Angband",
    "affiliation": "Morgoth",
    "death": "F.A. 499\nCabed-en-Aras",
    "skin_color": "Golden",
    "race": "Dragons",
    "gender": "Male",
    "height": "gigantic"
  },
  {
    "name": "Smaug",
    "lotr_page_id": "397",
    "text": "SMAUG was a fire drake of the Third Age, considered to be the last\n“great” dragon to exist in Middle-earth. He was drawn towards the\nenormous wealth amassed by the Dwarves of the Lonely Mountain during the\nreign of King Thror, and laid waste to the neighboring city of Dale and\ncaptured the Lonely Mountain, driving the surviving Dwarves into exile.\n\nFor almost two hundred years, Smaug hoarded the Lonely Mountain's\ntreasures to himself, staying within the mountain, until a company of\nDwarves managed to enter the Lonely Mountain and awaken him from\nhibernation. Correctly believing that the dwarves had received\nassistance from the men of Lake-town in entering the Lonely Mountain,\nSmaug left the mountain to wreak destruction upon Lake-town, nearly\ndecimating it before being slain by Bard the Bowman.\n\n\nBiography\n\nOrigins\n\nDetails of his origin are unknown (presumably bred in Angband in the\nlate First Age), but in TA 2770 he attacked the Lonely Mountain and the\ntown of Dale.\n\nThird Age\n\n[Smaug in the original illustration by J.R.R. Tolkien]\n\nIn TA 2770, Smaug came from the mountains in the north, drawn by great\nwealth amassed by the Dwarven kingdom of the Lonely Mountain, which\nincluded gold, gemstones, silver, pearls, the many-faceted crystals of\nemerald, sapphire and diamond, and the famed Arkenstone. He took the\nmountain, killing many dwarves inside it. Thrór and Thráin used the\nsecret door to escape, and the dragon continued ravaging the surrounding\ncountryside for a long time.\n\nFor two centuries, Smaug ruled the Lonely Mountain uncontested, lying\nwithin the great treasure hoard of the Lonely Mountain and ensuring that\nno one entered in an attempt to steal from him. The surrounding domain\nbecame a scarred wasteland known to the Dwarves and men as the\nDesolation of Smaug. Yet in the year TA 2941, a company of fourteen\nadventurers consisting of twelve Dwarves, the hobbit Bilbo Baggins, and\nled by the heir of the Lonely Mountain, Thorin Oakenshield, entered\nSmaug's mountain lair by a secret door in a daring attempt to reclaim\nthe ancient treasure from the dragon. \n\nBilbo, the company's appointed “burglar,” was sent into the treasure\nchamber alone in an attempt to stealthily gather information and steal\nwhat he can without waking Smaug. Once inside, Bilbo was surprised to\nfind that Smaug was much larger than he had expected and covered in\nimpenetrable armor, save for his underbelly. Aware of this\nvulnerability, Smaug deliberately had spent years sprawled on the wealth\nof his hoard, allowing diamonds and hard gemstones to be embedded into\nhis belly, armoring his only weakness. However, while examining the\ndragon, Bilbo noticed a single bare patch on the monster's left breast,\nnearest his heart. With this invaluable information, he escaped the\ndragon's lair and returned to the Dwarves, sharing his discovery of\nSmaug's weakness with them, unaware that he was overheard by a thrush,\nwho carried the secret to Bard the Bowman in nearby Esgaroth, the city\nknown as “Lake-town”.\n\n[Smaug's previous wound in his scales]\n\n[Smaug destroys Lake-town|250x250px|left]\n\nReturning to the treasure chamber, Bilbo attempted to steal a single\ncup, but its theft is immediately noticed by Smaug, who awakens from his\nslumber. Amused by the Hobbit, Smaug converses with Bilbo, attempting to\ndeduce his origins and purpose in the mountain. He quickly surmises that\nBilbo was aiding Thorin and the rest of the Dwarf company in an attempt\nto steal back the Arkenstone and reclaim the Mountain. Smaug flies into\na rage, erupting from the mountain in a fiery wrath and loosening his\nflame upon the land. He flies to Lake-town upon the Long Lake and\ndevastates it. In the midst of the wreck, Bard the Bowman, heir to the\nthrone of Dale, does his best to rally men to repel the dragon's\nassault. Bard, guided by his knowledge of Smaug's secret weakness, fires\na black arrow into the beast's vulnerable spot on his belly. Roaring in\nfury and pain, Smaug falls from the sky and crashes into the flaming\nruins of Lake-town, his death signaled the end of the presence of\ndragons in Middle Earth. \n\nAfter Death\n\n[Smaug's body falls upon burning Lake-town.|250x250px]\n\nAfter Smaug's death, Thorin and Company claimed the treasures of the\nLonely Mountain as theirs by birthright. This created a conflict with\nBard and the Elvenking Thranduil of Mirkwood, each of whom wanted a\nportion of the gold as reimbursement for all the damage Smaug had caused\nto their kingdoms over the years. Thorin refused to share the treasure\nand, as a result, they both declared war on him.\n\nIt is said that a vast fortune in gemstones lay with Smaug's rotting\ncarcass amongst the pilings of old Lake-town, but few had the courage to\ndive for them in later years. With no Dragon to contend with, the\nsurvivors of the town rebuilt on dry land next to the lake. Gandalf\nwould later note the good fortune of the dragon's destruction, as\notherwise Smaug might have proved a continual menace.\n\n\nEtymology\n\nThe name _SMAUG_ is derived from the past tense of the primitive\nGermanic verb _smugan_ (“to squeeze through a hole”). The name is\nassociated with _smeag_ (as in Smeagol), which is a form of the Old\nEnglish _smygel_ (“to burrow”).\n\nThe diphthong “au” in _Smaug_ is pronounced like the “ou” in _sound_ or\n_house_, though the name is often erroneously pronounced _Smog_, most\nnotably in the Rankin/Bass animated movie.\n\nIn Dalish, the language of Dale, the name of Smaug is _'Trāgu'_. It\nis noted to be similar with to the Norwegian word for dragon, _drágë._'\n\nOther names\n\nDuring the conversation between Smaug and Bilbo, Bilbo calls him several\nnames and epithets, such as SMAUG THE:\n\n-   '''Magnificent '''\n-   TREMENDOUS\n-   UNASSESSABLY WEALTHY\n-   MIGHTY\n-   TERRIBLE\n-   STUPENDOUS\n-   TYRANNICAL\n-   CHIEFEST AND GREATEST OF CALAMITIES\n-   YOUR MAGNIFICENCE\n\n\nSize\n\nSmaug's actual size is unknown, as it is never explicitly mentioned in\nthe _The Hobbit_. In _The Atlas of Middle-earth_ by Karen Wynn Fonstad,\nSmaug is said to be about 20 meters (66 feet) in length. This\nmeasurement corresponds with drawings by Tolkien in which Smaug seems to\nbe around 25 meters (82 feet).\n\nIt is unclear whether Smaug, the largest specimen in the Third Age,\nwould compete in mightiness to his ancestors of average size in the\nFirst Age, though he was clearly smaller than Ancalagon, the largest\nknown dragon to have existed.\n\n\nAbilities\n\n[Smaug preparing to shoot fire at Bilbo]\n\nBeing a fully-grown dragon, Smaug was both massive and powerful,\npossessing physical strength capable of crushing stone with ease, as\nseen by his attack on the Lonely Mountain. He was able to fly thanks to\nhis large wings, and had the ability to breathe streams of searing hot\nflame from his mouth. Some comments in _The Hobbit_ imply that his\nentire body was imbued with fire, as he was seen to glow in the darkness\nof the Lonely Mountain's depths, and his usual paths were said to have\nbeen “smoothed and slimed” (i.e. melted) by his passage.\n\nLike many dragons of Middle-earth, Smaug's monstrous appearance also\nbelied keen senses and a dangerously sharp mind. He had an encyclopedic\nknowledge of his treasure hoard, immediately registering the theft of a\nsingle cup after Bilbo made his first visit to his lair. When the hobbit\nreturned a second time, Smaug was already expecting him by feigning\nsleep, and immediately declared that he could sense the thief even if he\ncould not see him. Although Bilbo was clever enough not to fall for\nSmaug's attempts to trick him into revealing his exact position, the\ndragon used the resulting conversation to plant doubts in Bilbo's mind,\ncorrectly guessing that the “burglar” had allied himself with the\nDwarves and the men of Lake Town and asking if Bilbo had ever considered\nthe logistical difficulties of getting his share of Smaug's treasure\nback to his home. Despite his size, Smaug is shown to be agile and\nquick, able to leap over objects with ease, and he can dive at very high\nspeeds with little effort.\n\n[Fire breath, as seen in the film]\n\nDefensively, Smaug's reddish-gold scales rendered him impervious to\nnearly all weapons, but his underbelly was relatively soft and\nvulnerable. To compensate for this, Smaug took to sleeping upon the\ngathered treasure of the Lonely Mountain, allowing bits of gold and\njewels to embed themselves in his body. This “diamond waistcoat” was\nintended to cover his only physical weak spot, but when Bilbo Baggins\nconfronted the dragon in his lair, he discovered a bare patch on the\nleft side of his chest. Bard was told this by an ancient thrush that\noverheard Bilbo relating this information to the Dwarves, enabling\nhim to defeat Smaug by shooting his Black Arrow into the bare patch.\n\n\nPersonality\n\nSmaug is portrayed as being psychopathic, extremely sadistic, confident,\nviolent, cruel, arrogant, intelligent and greedy, possessing an\nunquenchable desire for gold. His most distinguishing characteristic\n(aside from his greed) is his arrogance, as Smaug proudly boasts of his\nsuperiority and impregnability to Bilbo during their encounter. However,\nthis proves to be his downfall, as he unwittingly reveals the weak spot\nin his chest to Bilbo when showing the Hobbit how he had willfully\ncoated his underbelly in treasure to protect it.\n\nSmaug seems primarily motivated by personal greed rather than a desire\nto do evil, and does not seem to serve any allegiance other than his\nown. While he does ruthlessly destroy Dale and lays waste to the Dwarves\nof the Lonely Mountain during his attack on the Lonely Mountain, once he\nhas assumed dominion of the region he seems content to allow the rest of\nMiddle Earth to go about its business, so long as he or his treasure\nremains undisturbed; although this could be because he feels that the\npeople living in the region have nothing he wants. Highly intelligent,\nSmaug appears to possess a rather sardonic sense of humor, darkly\nmocking Bilbo while they converse within the Lonely Mountain's treasure\nchamber. Smaug seems to dislike Dwarves, considering them to be weak and\npathetic creatures far beneath him, making unfavorable comments\nabout Thror and showing no remorse over his slaughter of their kind and\nclaiming of their kingdom. While conversing with Bilbo, Smaug is also\nable to quickly surmise the reason for Bilbo's presence in Erebor, and\nalso correctly deduces that the Dwarves received aid from the men of\nEsgaroth in reaching the mountain.",
    "other_names": "Smaug the Golden\nLord Smaug the Impenetrable\nTrāgu",
    "location": "Erebor",
    "death": "T.A. 2941\nLake-town",
    "skin_color": "Red-golden",
    "race": "Dragons",
    "gender": "Male"
  },
  {
    "name": "Boldog",
    "lotr_page_id": "12749",
    "race": "Orcs of Angband",
    "gender": "Male",
    "text": "BOLDOG was an Orc-captain of the host of Angband during the First Age,\nwho is only told of in the original ''Lay of Leithian, ''and does not\nappear in the stories of _The Silmarillion_.\n\nBiography\n\nHistory\n\nAs it is told in _The Lays of Beleriand_, Boldog was a formidable leader\nof Orcs, commanded by Morgoth to lead them on a great raid upon the\nrealm of Doriath and to capture Lúthien, daughter of King Thingol and\nQueen Melian the Maia. Boldog drove his host south over the highlands of\nDorthonion and the through enchanted forest of Taur-nu-Fuin following\nthe Orcs' Road of Haste into the Pass of Anach. Where fell darkness met\nthe mists of the magic, which were the Girdle of Melian, just east of\nthe river Mindeb, the Orc-host reached the border of Doriath. To meet\nthe deadly threat posed by Boldog's invasion in force, Thingol musters\nhis full might with his two great Captains, Beleg and Mablung. He leads\nthe army of Sindarin Elves beyond the North March of Doriath. Thingol\nand Boldog meet in single combat in the midst of the battle. Thingol\nwielded his Dwarf-forged sword, Aranrúth, Boldog fought with an iron\nspear of some note that was later used by Mablung in the Hunting of the\nWolf. Thingol slays Boldog, the Orc-host is utterly defeated and the\nremnants destroyed by being driven into Taur-nu-Fuin.\n\nThe Battle of the Northmarch was the culminating battle of a series of\nattacks in Morgoth's campaign against Doriath, following his victories\nin the Dagor Bragollach (Battle of Sudden Flame), the fourth of the\ngreat Battles of Beleriand that broke the Siege of Angband.\n\nCanon\n\nDetails of Boldog's raid are scattered through numerous versions of\ntexts within ''The Lays of Beleriand, ''compiled by Christopher Tolkien\n- however, no aspect of the plot-lines involving Boldog are in serious\ncontradiction with the “final” canon of _Quenta Silmarillion._ Boldog's\nindependent command of a host of orcs with its formidable objectives\nindicates that he would have been several ranks above most other\nOrc-Captains and champions (such as Orcobal or Balcmeg, who both were\nfrom a different century), and it is thought elsewhere in the sources\nthat Boldog was of some lesser order of the Maiar corrupted by Morgoth\nthat took the form of an Orc, as opposed to previously being an Elf that\nbecame mutilated (which was the ancient origin of Orcs in general).",
    "titles": "Captain",
    "affiliation": "Morgoth",
    "death": "F.A. 465\nNorth-marches of Doriath; killed by Thingol",
    "weapon": "Iron spear"
  },
  {
    "name": "Nan",
    "lotr_page_id": "21837",
    "race": "Giants",
    "gender": "Male",
    "text": "NAN was a Giant, mentioned only in ''The Book of Lost Tales 2, ''for\nwhom the Nauglafring (the early name of the Necklace of the Dwarves) was\nmade. He and another Giant Gilim are not told of in _The Silmarillion_.\n\nNan is told in _The Tale of Tinúviel_ to have owned a particularly long\nsword, named Glend."
  }
]