{
  "name": "Mouth of Sauron",
  "lotr_page_id": "3210",
  "text": "The MOUTH OF SAURON was a living man, the ambassador and messenger of\nSauron, the Lieutenant of the Dark Tower of Barad-dûr in Middle-earth\nand one of the most devoted and dark servants of Sauron at the time of\nthe War of the Ring. His true name had been forgotten, even by himself.\n\n\nBiography\n\nThe Mouth of Sauron's early history is unknown, as is his true name and\nhow he first met Sauron. He was a Black Númenórean who briefly appeared\nin person when he haggled with the Army of the West in front of the\nMorannon, trying to convince Aragorn and Gandalf to give up and let\nSauron win the battle for Middle-earth. Had the plans of Sauron\nsucceeded, the Mouth of Sauron would have become the new lord of\nIsengard, replacing Saruman. When Gandalf turned down his proposal, the\nMouth of Sauron set all the armies of Udûn upon them.\n\nThe Mouth of Sauron was the Lieutenant of the Tower of Barad-dûr, and\ncommanded the Orc armies of Gorgoroth. The Mouth of Sauron communicated\ndirectly with the Dark Lord. A man of great stature, potentially the\nequal of other Dúnedain, the Mouth of Sauron had fallen into darkness.\n\nThe Black Númenóreans had established their dwellings in Middle-earth\nduring the years of Sauron's domination and worshipped him. The Mouth of\nSauron entered the service of the Dark Tower when it first rose again\n(its rebuilding began in 2951 of the Third Age), and through cunning\ngrew to power under Sauron and learned great sorcery.\n\nWar of the Ring\n\n[The Mouth of Sauron confronting Gandalf, in the Extended Edition of the\nfilm]\n\nThe Mouth of Sauron appeared briefly before the host of the West prior\nto the Battle of the Black Gate. He insulted the host, asking who had\nauthority to treat with him, and dismissed Aragorn's claim as King. But\nthen Aragorn's gaze frightened him, and he cried out that he was a\nherald and an ambassador, and must not be attacked. Gandalf assured him\nhe would not be, so the Mouth took Gandalf to be the spokesman. He then\nbrought forth Sam's sword, a grey cloak with an Elven-brooch, and\nFrodo's mithril-vest, and said that the fate of the “spy” who carried\nthem would depend on their actions, and insinuated that if they did not\ndo as Sauron demanded, the “spy” would be tortured for many years.\n\nGandalf asked what the terms were, and the Mouth said that the Hobbit\nwould be allowed to go free, so long as the captains follow Mordor's\nconditions: that the “rabble of Gondor and its deluded allies” withdraw\nbeyond the Anduin River, swearing oaths “never again to assail Sauron\nthe Great in arms, open or secret”; that all lands East of the Anduin\nRiver would belong to Sauron alone, forever; that all lands West up to\nthe Gap of Rohan would pay tribute to Mordor; that they could no longer\nkeep and bear arms, though Sauron would allow them to govern their own\naffairs so long as they helped to rebuild Isengard, which would be then\nruled by a master more reliable than Saruman (presumably the Mouth\nhimself). Gandalf replied that was too much for the ransom of one\nservant, and in any case he doubted that Sauron would keep his word.\nGandalf demanded that the prisoner be brought forth, but of course the\nMouth could not comply except to say, “These are the terms. Take them or\nleave them!” Gandalf responded, “These we will take!” and seized the\nMithril coat, the cloak, and the sword, and utterly rejected Sauron's\nterms, before telling the Mouth to be gone, as they had not come to\nbargain with Sauron, much less with one of his slaves. Enraged and\nfearful at the same time, the Mouth fled back to the Gate and set\nMordor's forces upon the West.[1]\n\n\nAge\n\nThe Mouth served Sauron after Sauron came to Mordor. There is some\ndispute over the length of time this implies. If it refers to Sauron's\nmost recent return to Mordor, the Mouth of Sauron would have served\nSauron for some 68 years when he encountered Aragorn and Gandalf. But\nsome have stated that since Mordor “first rose again” during Sauron's\nreturn shortly after the destruction of Númenor, the Mouth of Sauron may\nbe well over thousands of years old. Since no mortal could live that\nlong, and Tolkien says explicitly that he was a living man and not a\nwraith, he is believed to be around the same age, or less, as Aragorn.\nThis is further suggested by drafts of _The Return of the King_, in\nwhich he is a renegade Man of Gondor.",
  "other_names": "Mordu",
  "titles": "Lieutenant of Barad-dûr, Messenger of Mordor, Emissary of the Dark Lord,\nAmbassador of Sauron, Captain of the Black Uruks, the \"Mannish\nLieutenant\" of all Orcs of Mordor",
  "birth": "Second Age, Numenor",
  "death": "Probably died on March 25 TA 3019",
  "weapon": "Dark sorcery, sword",
  "race": "Men",
  "gender": "Male",
  "height": "6-7 feet",
  "culture": "Black Númenóreans"
}