{
  "title": "Easterlings",
  "lotr_page_id": "283",
  "text": "EASTERLINGS, known in early times as SWARTHY MEN, were a race of Men who\nlived in the vast and uncharted lands of Rhûn, east of Mordor and the\nSea of Rhûn. Easterlings were enemies of the Free Peoples and were\nallies of Sauron. There were many different nations and kingdoms of\nEasterlings living in the vast lands of Rhûn. These ranged from\ncivilized empires to barbaric horse nomads of the open steppes.\n\nDescription\n\nEasterlings, being of many different races and people, were either tall\nand sallow-skinned or short and swarthy. However, there were also said\nto be a different type of Easterlings that appeared during the Siege of\nGondor from unknown eastern lands, who were broad, short, and\nbearded, and wielded axes like Dwarves. Easterlings were the most\nnumerous and deadly of the enemies of the Free Peoples, and it is said\nif the Blue Wizards had not been sent into Rhûn the hosts of the East\nwould have outnumbered the Western peoples. Their skin was either sallow\n(a pale yellow) or olive. Their eyes were dark (dark brown and black),\nand their straight hair was black. The “swarthier” Easterlings of the\nFirst Age and the Fourth Ages were not a related people, as those of the\nFirst came from the then-unknown lands east of the Blue Mountains, and\ncould have had more relation to the Dunlendings than the later Balchoth\nand Wainriders.\n\nHistory\n\nFirst Age\n\nDuring the First Age, the term was applied to the sons of Bór and\nUlfang, or the _Swarthy Men_, who came into Beleriand much later than\nthe Edain, and who were for a part secretly in league with Morgoth. By\nsome men of Dor-lómin that appear in the Wanderings of Hurin, they are\ncalled EASTRONS.\n\nBór was a leader of Men who came into Lothlann, in Beleriand, during the\nFA 463. His sons were Borlach, Borlad, and Borthand. Bór was welcomed by\nMaedhros, who gave him and his followers land north and south of the\nMarch of Maedhros. Bór and his sons swore allegiance to Maedhros, and\nremained faithful, though he was told by Morgoth to betray the banner of\nCaranthir. All of them were wiped out during the Nirnaeth Arnoediad.\n\nUlfang also came in Lothlann, Beleriand, in 463, shortly after Bór. He\nwas the father of Ulfast, Ulwarth, and Uldor “the Accursed”. Ulfang was\nwelcomed by the sons of Fëanor, and he and his sons swore allegiance to\nCaranthir. They were given lands to dwell in the north and south of the\nMarch of Maedhros. Ulfang and his sons were secretly in the employ of\nMorgoth, and betrayed the Eldar and Edain during the Nirnaeth Arnoediad\nin what is now known as the Treachery of Men.\n\nRule in Hithlum\n\nAfter Nirnaeth Arnoediad at the bidding of Morgoth, the Easterlings\ninvaded Hithlum. They spread throughout the wide lands plundering,\ndestroying, and killing its inhabitants. The Eldar of Hithlum were able\nto escape from the invaders by taking refuge in the southern mountains\nthat later the Easterlings avoided out of fear of the Elves. The\nEasterlings soon withdrew northwards and apparently settled.\n\nHowever, the Easterlings were betrayed by their lord Morgoth, and locked\nsolely in Hithlum and denied the rich lands of the Beleriand that they\nso desired. Here the Easterlings governed with cruelty, robbing,\nstealing, and enslaving the remaining Men of Hithlum, who called the\nEasterlings the \" Incomers\". They took away the young and the able\nbodied and sometimes young women to be wives; the most widely known\nbeing Aerin of whom Brodda took to produce his heir. Despite these evil\ndeeds, they did not take Morwen nor her house from her for they feared\nher and believed her to be a witch and so her son had time to escape to\nDoriath. Tuor, the cousin of Túrin was also enslaved in Hithlum by the\nEasterlings but he was able to escape and evaded them by living as an\noutlaw, until he was contacted by the Vala Ulmo and went to Gondolin.\n\nThe Easterlings ruled effectively in Hithlum as vassals of Morgoth from\nFA 473 to FA 583. After the War of Wrath, those that survived fled back\nover the Blue Mountains to Eriador and beyond where they sat themselves\nup as kings and chieftains of many of the Middle Men.\n\nSecond Age\n\nA King of the Easterlings, Khamûl, was given one of the Rings of Power\nand became a powerful sorcerer, until the power of the Ring corrupted\nhim. Around SA 2251, Khamûl became a Wraith and one of Sauron's\nservants.\n\nThird Age\n\nDuring the Third Age, the term was applied to the various nations and\ntribes of Men living in the uncharted lands east of the Sea of Rhûn and\nMordor who were usually allied with Sauron (for one of their leaders was\nthe second greatest of the Nazgûl, Khamûl) and frequently attacked\nGondor and the lands bordering Rhûn. However, Sauron's defeat at the end\nof the War of the Last Alliance diminished his presence for over one\nthousand years, and any territorial ambition was left to them alone. In\nTA 490 they invaded Gondor, passing through Dagorlad and starting a\nseries of wars that lasted sixty years until they were finally defeated\nin TA 550 by Turambar, the ninth King of Gondor. Afterwards, Gondor\nsubdued some of them and took from them a large area of land between the\nKingdom of Rhovanion and Mordor including the Sea of Rhûn.\n\nGondor held on to these territories for a few hundred years but slowly\nbegan to lose them over time, and the Easterlings once again initiated\nwarfare. In TA 1248 they once again clashed with Gondor in a series of\nskirmishes but were still not powerful or organized enough to stand\nagainst Gondor’s power. Though defeated the Easterlings would not have\nto wait long, for Gondor soon fell into decline and civil war.\nAfterwards, the Easterling tribes remained peaceful for the most part\nuntil the mid-nineteenth century when they were again powerful enough to\nattack the west.\n\nThe War of the Ring\n\nDuring the War of the Ring at the end of the Third Age, the Easterlings\njoined with the forces of Mordor participating in the Northern battles\nthat nearly defeated the Elves of Mirkwood, Men of Dale, and the Dwarves\nof the Lonely Mountain.\n\nDespite being on the losing side in the war, some Easterlings still\ncontinued to remain a threat throughout the early Fourth Age but were\nfinally subdued in a series of campaigns led by King Elessar. In these\nbattles the Easterlings, aside from the hordes of Orcs, were the most\nnumerous and tenacious of Sauron's warriors.\n\nSpecific groups\n\nWainriders\n\nThe Wainriders were a confederation of Easterling and Haradrim tribes\nwho were united by their hate of Gondor, fueled by the Dark Lord Sauron.\nFollowing the Great Plague which weakened Gondor, they started their\nattacks in TA 1856, defeating a Gondor army at the Battle of the Plains\nand killing King Narmacil II. They rode in great chariots (which gave\nthem their name), and raided the lands of Rhovanion, destroying or\nenslaving its people. Gondor gradually lost all of its possessions east\nof Anduin to them.\n\nIn TA 1899, the thirtieth King of Gondor, Calimehtar son of Narmacil,\ndefeated the Wainriders at Dagorlad, buying some rest for his land.\nHowever the Wainriders struck back in TA 1944, allying themselves with\nthe Haradrim of Near Harad and the Variags of Khand. Before this they\nhad been expanding their power southward, beyond Mordor, and had come\ninto conflict with the tribes of Khand and the eastern Haradrim. But\neventually these men allied under their universal hate of the West. They\nmanaged to kill King Ondoher and all his heirs, but instead of riding on\nto Minas Anor and taking the city, they paused to celebrate.\n\nMeanwhile, general Eärnil of Gondor's southern army rode north to defend\nhis king defeating an inferior force of Haradrim in South Ithilien, he\ncame too late to rescue Ondoher, but he did manage to annihilate the\nWainriders for good at the Battle of the Camp. Eärnil was crowned king.\nAfter this defeat the might of the Wainriders was broken, and they\nretreated east. They still held Rhovanion, but never troubled Gondor\nagain until the War of the Ring.\n\nBalchoth\n\nThe Balchoth were a fierce race of Easterlings, who attacked Gondor\nwhile under orders of Dol Guldur. In TA 2510, they overran the plains of\nCalenardhon and almost destroyed the army of the Ruling Steward Cirion,\nbut were defeated by the Éothéod under Eorl the Young. Like the\nWainriders they rode in chariots and wagons, and they may have been\ndescendants of these people. However, they were notably far more\nprimitive and savage than the advanced Wainriders, so their origin is at\nmost obscure.\n\nWeapons\n\nNot much is known about the weapons used by the Easterlings. They had as\nfar as it is known among their arsenal spears, bows, axes and chariots.\nThey also seemed to favor the horse on many occasions, although all this\nprobably differed greatly among the Easterling tribes, kingdoms, or\nempires.\n\nCulture\n\nKnowledge of the culture of the Easterlings is limited. In the First Age\nthey could be quite savage; examples of this rise from Brodda's\ntreatment of the Men of the House of Hador in Dor-lómin. In the Third\nAge at least, the Easterlings fought with great valor, as displayed\nduring the Battle of the Pelennor Fields and the Battle of the Black\nGate. The numerous clans of the Easterlings were united by Emperors and\nKings of Rhûn (like Khamûl). An Emperor of the Easterlings was supposed\nto have led an army to the Battle of Dale and supported Sauron.",
  "locations": "lands east of and including Rhûn; Rhovanion; March of Maedhros; Hithlum",
  "affiliation": "Sauron",
  "members": "Khamûl, Easterlings (First Age) (Brodda, Lorgan, Ulfang, Uldor, Ulfast,\nUlwarth, Bór, Borlach, Borlad, Borthand)",
  "distinctions": "Use of the war-wagons (Wainriders and Balchoth)",
  "hair_color": "Dark",
  "skin_color": "Swarthy in the First Age",
  "name": "Easterlings",
  "dominions": "Lands east of and including Rhûn; Rhovanion; March of Maedhros; Hithlum",
  "languages": "Unknown, Easterling dialects of Mannish of an unknown descent[1]",
  "notable_members": "Khamûl, Brodda, Lorgan, Ulfang, Uldor, Ulfast, Ulwarth, Bór, Borlach,\nBorlad, Borthand",
  "lifespan": "Shorter than Númenórean"
}