{
  "title": "Great Spiders",
  "lotr_page_id": "29188",
  "text": "The_' Great Spiders_', also known as the CHILDREN OF UNGOLIANT, were a\nrace of oversized and sentient arachnids that lived in Middle-earth,\nparticularly in dark and perilous places affected by the power of the\nShadow.\n\n\nDescription\n\nThe Great Spiders could speak to one another, though only those imbued\nwith the power of (or derived from) the Ainur could understand them.\nLike Orcs and Goblins, Great Spiders were known to detest light, yet\nthey thirsted for it and sought to devour it. Great Spiders comprise\nthree separate known species.\n\nGiant Spiders\n\nGiant Spiders were a sentient race of Great Spiders that lived in\nMiddle-earth. They lived in the South of Middle-earth in the First Age,\nbut by the Third Age they had spread to other areas. They were descended\nfrom the spider-creatures of the Ered Gorgoroth. Giant Spiders infested\nthe great forest of Greenwood the Great after the shadow of Sauron fell\nupon it and it became known as Mirkwood.\n\nUmaiar spiders\n\nThe Umaiar spiders, a subspecies of Umaiar (and by extension a\nsub-subspecies of Maiar), which included Ungoliant. There are those\nMaiar who took the form of giant spiders upon joining Morgoth. Apart\nfrom Ungoliant (who died by devouring herself), the fate of this race is\nunknown.\n\nSpawn of Ungoliant\n\nThe Spawn of Ungoliant are the third race of Great Spiders. This race\nwas spawned by Ungoliant after she fled to the South. She mated with and\ndevoured the mortal giant spiders who lived there. Because they were\nhalf Umaiar, these spiders were immortal; they were bigger, stronger and\nsmarter than their mortal kin.\n\n\nHistory\n\nThe first Dark Lord, Melkor, used Ungoliant to help him destroy the Two\nTrees of Valinor and steal the Silmarils.[1] Ungoliant, who had an\ninsatiable desire to devour light, asked for the Silmarils to be given\nto her. Melkor refused and she attempted to kill him. Ungoliant was\nsubsequently driven off by Melkor's Balrogs, and she ultimately wandered\nacross Middle-earth, consuming anything that gave off light, such as\ngemstones; and often mated with other large spiders. Her offspring were\na great bane on the world in later years. She was described as\nsurrounded by “an aura of darkness”. Her fate is unknown, but it is said\nthat, always hungry, Ungoliant ended by devouring herself.[2]\n\n[The Mirkwood spiders]\n\nThe Hobbit Bilbo Baggins, and his thirteen Dwarf companions encountered\ngiant spiders in Mirkwood forest on their Quest to the Lonely Mountain.\nOnly Bilbo's magic ring and an Elven blade (_Sting_) allowed them to\nescape being eaten.[3]\n\n[Frodo caught in Shelob's web, as depicted in the film.]\n\nFrodo Baggins and Sam Gamgee encountered Ungoliant's daughter, Shelob,\nin her lair as they were trying to enter Mordor during their quest to\ndestroy the One Ring. Frodo was ambushed by the spider twice, and was\nparalyzed by her poison on the second encounter.[4] Sam used _Sting_ to\nattack Shelob and wounded her, forcing her to flee the scene.[5] It is\nunknown whether she died from her wounds.\n\n\nInfluence of spiders in Tolkien's life\n\nContrary to popular belief, the reason that Tolkien featured spiders so\nprominently in his stories was not because he was bitten by a tarantula\nwhen he was young, but rather because his son was afraid of them.\nBecause of his son's arachnophobia, they are portrayed negatively,\nalways appearing as antagonists.\n\n[1] _The Silmarillion_, _Quenta Silmarillion_, Chapter VIII: “Of the\nDarkening of Valinor”\n\n[2] _The Silmarillion_, _Quenta Silmarillion_, Chapter IX: “Of the\nFlight of the Noldor”\n\n[3] _The Hobbit_, Chapter VIII: “Flies and Spiders”\n\n[4] _The Lord of the Rings_,'' The Two Towers,'' Book Four, Chapter IX:\n“Shelob's Lair”\n\n[5] _The Lord of the Rings_, _The Two Towers_, Book Four, Chapter X:\n“The Choices of Master Samwise”",
  "name": "Great Spiders",
  "dominions": "Mordor, Mirkwood, Torech Ungol, Dol Guldur, Nan Dungortheb, Ered\nGorgoroth, Nan Ungol",
  "languages": "Westron, Black Speech",
  "notable_members": "Ungoliant, Shelob, Saenathra",
  "lifespan": "Unknown",
  "distinctions": "Gigantic, dark, arachnid-like traits, lethal, venomous\n\nCapable of speech",
  "height": "Massive"
}