{
  "name": "Undead",
  "lotr_page_id": "9670",
  "text": "“UNDEAD” refers to dead beings who could still interact with the living.\nBy the Third Age, the Rohirric word “DWIMMERLAIK;” meaning “Spectre” or\n“Work of Necromancy”, was used as a catch-all term.\n\n\nTypes\n\n-   BARROW-WIGHTS were evil spirits inhabiting the tombs of the\n    Barrow-downs. They often possessed the grave-gifts and bones of\n    those entombed there, making them similar to the animate skeletons\n    of other works.[]\n-   GHOSTS (the ARMY OF THE DEAD, specifically) are the souls of the\n    dead who are prevented from reaching their final rest. The largest\n    concentration were the dead warriors who betrayed Isildur and were\n    cursed, haunting the mountain until Aragorn persuaded them to fight\n    for him. Their faces often shift from skeletal frames to pasty\n    shadows of themselves. Gorlim the Unhappy might be considered one\n    too.\n-   NAZGÛL or Ring-Wraiths: Formerly Kings of Men, the nine rings gifted\n    to them by Sauron caused them to become ghost-like []Wraiths. They\n    cannot see properly, and rely on smell and hearing. The Nazgûl carry\n    daggers known as Morgul-blades meant to break off in the wound,\n    which can turn the afflicted into a wraith. Frodo was stabbed by one\n    at Weathertop. However, it is mentioned that Nazgul are not properly\n    undead.\n-   WRAITHS were humans (Dwarves had natural resistance) who come into\n    possession of a Ring of Power and wore it too long, or were stabbed\n    by a Morgul-blade. They were permanently invisible, and more or less\n    immortal.\n-   PHANTASMS were delusions and/or spirits or fallen Maiar and\n    therefore not truly undead. Morgoth and Sauron used them for their\n    treachery. It is said Saruman also used them.\n-   '''Lingerers '''are elves whose bodies have been consumed by their\n    fëa. To men, they are indistinguishable from bodiless spirits. These\n    elven spirits are not really undead, because they were never dead to\n    begin with.\n-   “THE HOUSELESS” were ghosts of slain elves who were evil, hateful or\n    otherwise sinful in life and defied the call of Mandos. These elven\n    ghosts had the unique ability to possess living things; most often\n    they desired to steal the bodies of Men to become material again,\n    but according to some, they also could possess anything alive. Old\n    Man Willow may have been possessed by one of the Houseless.\n\nThere may also have been some form of undead residing in the Dead\nMarshes\n\nThere are many of these fearsome creatures in the Barrow-downs where the\nWitch-king of Angmar himself went when he was looking for the One Ring\nin The Shire. For his evil presence, the ancient spirits were raised\nagain killing people with their ceremonial swords and bringing the\nterror with them."
}