{
  "name": "Army of the Dead",
  "lotr_page_id": "3747",
  "text": "The ARMY OF THE DEAD, also known as the DEAD MEN OF DUNHARROW or\nOATHBREAKERS, were Men of the White Mountains, cursed to remain in\nMiddle-earth by Isildur after they abandoned their oath to aid him in\nthe War of the Last Alliance. They haunted the caverns beneath the\nDwimorberg, and the valley of Harrowdale that lay in its shadow, though\nthey were said to appear in the valley only in times of trouble or\ndeath. They were led by the King of the Dead, the most fearsome and\nterrifying of the whole Dead Army. Since the line of Isildur had “ended”\n(after a couple of hundred years), no one could call upon the Dead Army\nto aid them in their hours of need, as they would only answer to an Heir\nof Isildur. It wasn't until the Third Age in the War of The Ring that\nAragorn, Isildur's heir, would call upon them to fight with him against\nSauron, fulfilling their oath and releasing them from their curse.\n\n\nHistory\n\nThey were once_' Men of the White Mountains_', but at the founding of\nGondor, they swore an oath to Isildur that they would fight for him.\nHowever, during the dark years, they had worshiped Sauron, and so when\nthe time came and Isildur asked for their aid, they refused and so\nIsildur cursed them saying: _Thou shalt be the last king, and if the\nwest prove mightier than thy Black Master, this curse I lay upon thee\nand thy folk; to rest never until your oath is fulfilled. For this war\nwill last through years uncounted, and you shall be summoned once again\nere the end._ Therefore, they fled from the wrath of Isildur and dared\nnot go forth to war for Sauron, and they hid in secret places in the\nmountains and had no dealings with other men. They slowly started to\ndwindle and the terror of the Sleepless Dead came about to all the\nplaces where they lingered.\n\n[Depiction of the Army of the Dead meeting Aragorn]\n\nMalbeth the Seer prophesied that a day would come when need and haste\nwould drive one of Isildur's heirs to take The Road under the Mountain,\nand that the dead would answer to his call. The Prophecy came true. In\nthe War of the Ring, Isildur's Heir, Aragorn, called on the Dead Men.\nSummoning them to the Stone of Erech, Aragorn commanded them to fulfill\ntheir oath and be free.\n\nAragorn led the Army of the Dead through Lamedon and Ciril. As they went\nthrough the lands of Gondor, they found them deserted, since everyone\nwho hadn't gone to war fled the approach of the dreaded “King of the\nDead”. Even the men of Umbar and Harad, who had been attacking the fords\nat Linhir above the mouth of the river Gilrain, stopped fighting and ran\noff in terror. The only person who had the courage to stay was Angbor,\nthe Lord of Lamedon, and Aragorn told him to gather his men and follow\nthe Grey Company to Pelargir. For four days and nights after Aragorn\nfirst summoned the dead to the Stone of Erech, they rode.\n\n\n\nOn the fifth day they reached their destination (Pelargir), where the\nmain fleet of Umbar was assembled. Some of the ships had set sail for\nMinas Tirith already because rumor of the dead army had reached the\nhavens. In spite of these rumors, however, the Haradrim whom the Company\nhad been pursuing turned at bay and laughed, seeing only Aragorn and his\nhost of live Dunedain warriors, as the dead were hanging back behind\nthem to surprise their foes. Aragorn then called to the Army of the Dead\nto fight, which resulted in a bloody battle. Legolas later, after the\nBattle of the Pelennor Fields, described the scene he witnessed to\nMeriadoc Brandybuck and Peregrin Took: _Faint cries I heard, and dim\nhorns blowing, and a murmur as of countless far voices: it was like the\necho of some forgotten battle in the Dark Years long ago. Pale swords\nwere drawn; but I know not whether their blades would still bite, for\nthe Dead needed no longer any weapon but fear._ Even though not needing\nweapons, the weapons of the Enemy could not harm them.\n\nThe Army of the Dead attacked first the ships that were still anchored,\nand then walked over the water to the ones that had set sail. The\nterrified Corsairs abandoned their ships and jumped overboard; all\neither drowned or headed south back to their homelands. Once the\nHaradrim and Corsairs were defeated, Aragorn had trumpets sounded and\nthe dead withdrew to the shore. As they had at last fulfilled their\noath, Aragorn granted the Dead Army their freedom. The King of the Dead\nstepped forward, broke his spear, and threw it away; he bowed to Aragorn\nand the dead vanished at last from the world.\n\n\nInspiration\n\nNorthern European folklore tells of 'the restless dead' as fell riders\nbursting upon unwary travellers in lonely places. Horses, knights,\nhounds are among the restless spirits in the “Wild Hunt”. Hans Sachs'\npoem, “Das wutend heer der kleinen dieb” (1539) describes the furious\nhost in gruesome detail, accompanied by ravens who plucked out the eyes\nof the roving dead: “there came one behind, who had been hanged the same\nday, had still his eyes and saw me.”\n\nIt is an indication of Aragorn's heroic nature and lineage that he dares\nsummon the dead to fulfill their oath in this manner, and a sign that\nthe rightful king has indeed returned.",
  "dominions": "Caverns beneath the Dwimorberg and the valley of Harrowdale",
  "languages": "Westron",
  "members": "The King of the Dead"
}