{
  "name": "Dor-lómin",
  "lotr_page_id": "868",
  "text": "DOR-LÓMIN was a part of Hithlum in the First Age.\n\n\nDescription\n\nDor-lómin was a country in the south-western part of Hithlum, bordered\nin the east by the Mountains of Mithrim, and in the north by the river\nwhich formed the _Rainbow Cleft_ known as _Annon-in-Gelydh_, or “Gate of\nthe Noldor”. It was the birthplace of Túrin son of Húrin and Morwen.\nThere is also a mountain pass in its south unknown to the Enemy.\n\nHúrin's house was built in its south-western corner near the mountain\nknown as _Amon Darthir_, where the river _Nen Lalaith_ began.\n\n\nHistory\n\nDor-lómin was first colonized by the Ñoldor on their return to\nMiddle-earth, Dor-lómin became the lordship of Fingon, but in the\nfifth Century FA Fingolfin gave it to Hador. Dor-lómin became a fief of\nthe Third House of the Edain, which flourished there, strengthened by\nrefugees of the First House from Dorthonion, until the Nirnaeth\nArnoediad. Morgoth gave Dor-lómin, together with the rest of Hithlum, to\nhis Easterlings, who absorbed or enslaved the surviving Edain. Tuor son\nof Huor was fostered by the Elves of Androth in the Mountains of\nMithrim.\n\nBefore the Nirnaeth Arnoediad, the army of Dor-lómin was between 12,000\nand 15,000. The entire host was destroyed during the Nirnaeth Arnoediad.\n\nAfter Túrin fled south over the Ered Wethrin bands of outlaws came and\nattacked and enslaved the peoples of _Dor-lómin_, save Morwen, her\ndaughter Nienor, and her servants, including Sador Labadal. The outlaws\nwere led by Brodda, who wedded Aerin so that when he was dead, he would\nhave an heir to keep the land under his family's rule. Over a year after\nTúrin came to Doriath, Morwen and Nienor went seeking Túrin in\nMenegroth. Later, Túrin came to seek Morwen in Dor-lómin, but they had\nalready gone south over the mountains. Like the rest of Hithlum\nit was destroyed during the War of Wrath.\n\n\nEtymology\n\n_Dor-lómin_ was a Sindarin word that meant 'Land of Echoes'.",
  "type": "Mannish settlement",
  "position": "Hithlum",
  "description": "Known for being the settlement of the House of Hador",
  "race": "Men",
  "languages": "Mannish",
  "governance": "High King of the Ñoldor",
  "lifespan": "TA 1601 - ?"
}