{
  "name": "Lobelia Sackville-Baggins",
  "lotr_page_id": "831",
  "text": "LOBELIA SACKVILLE-BAGGINS was a Hobbit of the Shire.\n\n\nBiography\n\nLobelia married Otho, and had a son, Lotho. Lobelia was known to be a\ncovetous and grasping hobbit, and had designs on Bag End, as Otho was\nBilbo's paternal first cousin and next of kin. During Bilbo's\ndisappearance, Lobelia and Otho claimed the smial; when Bilbo returned\nfrom his adventure with Thorin and Company, Lobelia and Otho were in the\nmidst of auctioning off the contents of Bag End with the firm of Grubb,\nGrubb and Burrows.[1]\n\nAfter Bilbo's eleventy-first birthday party, Lobelia and Otho were\nincensed that Bilbo had left Bag End to Frodo, a more distant cousin\nonce removed, and questioned the validity of Bilbo's will. Since much of\nBilbo's silverware vanished during his adventure with the dwarves, when\nBilbo left the Shire permanently, he gave Lobelia a box of silver spoons\nlabeled “For Lobelia, from Cousin Bilbo”, as a mathom.[2] Eventually,\nLobelia was able to acquire Bag End when Frodo sold it to her for under\nmarket value under his ruse of moving to Crickhollow, but by this time\nOtho had died and was unable to enjoy it.[3]\n\nDuring the War of the Ring, Lobelia opposed Sharkey after hearing from\nthe Ruffians that they were ordered to build sheds at Bag End. After\nrudely telling her to step aside, she became enraged and attacked the\nleader using only her umbrella as a weapon but she lost and was\nimprisoned in the Lockholes at Michel Delving.[4] Freed after the\nScouring of the Shire, Lobelia was greeted with raucous applause due to\nher spirit in defying Saruman's thuggery, and she was touched as she had\nnever before been popular due to her avarice. However, she was\nheartbroken over Lotho's murder, and so granted Bag End back to Frodo\nand what was left of her money hoping he would use it to help hobbits\nwho had lost their homes, due to Sharkey's tyranny. She moved in with\nher original family, the Bracegirdles of Hardbottle. She died in the\nspring of 3020, and was over 100 years old.",
  "other_names": "Lobelia Bracegirdle, Mistress Lobelia",
  "birth": "TA 2918 (SR 1318)",
  "death": "TA 3020 (SR 1420)",
  "spouse": "Otho Sackville-Baggins",
  "weapon": "Umbrella",
  "race": "Hobbit",
  "gender": "Female",
  "height": "1.17m (3'10\")",
  "culture": "Shire-hobbits"
}