{
  "name": "Petty-Dwarves",
  "lotr_page_id": "3435",
  "text": "The PETTY-DWARVES (named in Sindarin NOEGYTH NIBIN or NIBIN-NOEG, part\nof an older and longer word BAR-EN-NIBIN-NOEG) were a diminutive race of\ndwarves that lived in the Beleriand in Middle-earth during the First\nAge. They differed from normal dwarves in various ways: they were\nsmaller, far more unsociable, and they freely gave away their names;\nother dwarves kept their Khuzdul names and language a secret.\n\n\nHistory\n\n[Mim, Khim and Ibun - Petty-dwarves] The Petty-dwarves were dwarves of\nseveral houses, which had been exiled for reasons unknown in very\nancient times during the Peace of Arda. They were the first to cross the\nBlue Mountains (Ered Luin) in the First Age, and established strongholds\nin Beleriand before the building of Nogrod and Belegost in the Blue\nMountains, and before the elves arrived. They delved the very ancient\nsettlements of Nulukkizdin (Nargothrond) and Amon Rûdh but they dwindled\nbefore the Ñoldor returned to Middle-earth.\n\nThe Sindar, not yet acquainted with dwarves, thought the Petty-dwarves\nwere animals, and hunted them. Not until the dwarves of the Ered Luin\nestablished contact with the Sindar did the latter realize what the\nPetty-dwarves were. Afterwards they were mostly left alone, but not\nbefore the Petty-dwarves came to hate all elves with a passion.\n\nBy the time of the War of the Jewels, after the Return of the Ñoldor,\nthe Petty-dwarves had nearly died out. By the fifth Century of the First\nAge, the last remnant of their people were Mîm and his two sons, who\nlived at Amon Rûdh. Túrin and his men shot at the dwarves, mistaking\nthem for animals or orcs. Mim survived, but an arrow had killed one of\nhis sons, Khîm. Mim's other son had been killed by orcs, leaving Mim the\nlast of his kind. Mîm was killed by Húrin after the latter's release\nfrom Angband, and the Petty-dwarves were no more.\n\n\nOrigin in Tolkien's writings\n\nThe Petty-dwarves were created from remnant ideas based on the Nauglath\nin Tolkien's earliest writings in the _The Book of Lost Tales_. They\nwere more or less created to explain the difference between the dwarves\nlater writings such as The Hobbit in comparison to the wicked dwarves\nfrom his earlier stories which he hadn't yet completely abandoned.\nHowever, some of the ideas of the Nauglath were reincorporated into the\nNaugrim (Dwarves) by J.R.R. Tolkien or his son in the published\nSilmarillion and separate from the Petty-dwarves (such as the history of\nBelegost and Nogrod, and the Sack of Doriath events).\n\n''_'Niwennog_ '''was their first ascribed name (preceding the change to\n_Nibin-noeg_), as told of in the index of _The War of the Jewels._",
  "other_names": "Petty-dwarves",
  "dominions": "Nulukkizdîn\nAmon Rûdh",
  "languages": "Khuzdul\nSindarin",
  "members": "Mîm\nIbun\nKhîm",
  "lifespan": "Shorter than other Dwarves",
  "distinctions": "Exiled Dwarves of several Houses; they were smaller, far more\nunsociable, and they freely gave away their names",
  "height": "Shorter than the other Dwarves"
}