{
  "title": "Durin's Folk",
  "lotr_page_id": "2707",
  "text": "DURIN'S FOLK (also called the LONGBEARDS) were a clan of Dwarves\n\n   that originally inhabited Moria in the Misty Mountains, led by Durin\n   I, “The Deathless”. He was succeeded by many generations of kings,\n   among them appeared six others also called Durin. (The Dwarves\n   believed that these six were the reincarnation of Durin I, with\n   memories of their past lives.)\n\nHistory\n\nDuring the Second Age, Durin's Folk began a friendship with the Noldor\nof Celebrimbor in Eregion.\n\nIn the middle of the Third Age, they were expelled by the Balrog of\nMoria known as the “Durin's Bane”. In TA 1980 their king Durin VI was\nkilled by the creature that the following year also killed his son Náin\nI. Thráin I, Nain's son, fled along with his people to the Lonely\nMountain where he founded the Kingdom of the Lonely Mountain. During the\nreign of Thorin I son of Thrain was heard rumors greater wealth in the\nGrey Mountains. Thorin decided to leave Erebor and take his people to\nthe north, where they lived in peace until the reign of his grandson\nNain II when they began to be attacked by dragons. During the reign of\nDáin I, one Cold-drake invaded his kingdom and killed him along with his\nsecond child, Frór. Thrór, eldest son of Dain I, and now King of Durin's\nFolk, returned along with his uncle Borin and part of his people to the\nLonely Mountain. His younger brother Grór left for the east where he\nfounded his kingdom in the Iron Hills. Thrór ruled during long years of\npeace until a Fire Drake, Smaug, the last of the great dragons,\ndescended from the north and sacked and took the Lonely Mountain.\nDurin's Folk became a nomadic people in exile. Many of them went to the\nIron Hills and settled there. Thrór went insane, and tried to reclaim\nKhazad-dûm by himself, leading to his death at the hand of Azog.\n\nThis started the War of the Dwarves and Orcs, which ended at the Battle\nof Azanulbizar, where Azog was killed by Dáin Ironfoot, lord of the Iron\nHills. After the battle, many of the Dwarves under the rule of Thrain II\nwent to the west to the Blue Mountains and settled there. After 60 years\nThrain's son, Thorin II, or “Thorin Oakenshield”, was convinced by the\nwizard Gandalf to lead a company of 13 Dwarves and one Hobbit on a quest\nto recover the Lonely Mountain. The quest lead to the death of Smaug at\nthe hand of Bard the Bowman, and the great Battle of Five Armies against\narmies of Orcs, in which Thorin and his nephews Fili and Kili were\nkilled. But Thorin's sacrifice led to the Kingdom of the Lonely Mountain\nbeing restored under the rule of his cousin Dáin II, Lord of the Iron\nHills, who became King under the Mountain in TA 2941. He died in the\nbattle of Dale at the end of the Third Age, fighting hordes of\nEasterlings in Dale. His people were then besieged. After Sauron was\ndefeated, his son Thorin III Stonehelm and Bard II, the new king of\nDale, defeated the Easterlings.\n\nDurin VII, the last to be named “Durin”, later retook Moria and became\nknown as “Durin the Last”.\n\nKings of Durin's Folk\n\nHere is a full account of all the Kings of Durin's Line, but the\nfollowing list shows only the names of those Kings who were saved or\nwhose reigns can be studied. As the descendants of Durin I were forced\nby circumstances to travel through Middle-earth, the main sites of their\nmonarchy is shown along with the name of each king.\n\nDurin I, Khazad-dum\n\nDurin the Deathless was the oldest of the Seven Fathers of the Dwarves,\ncreated by Aulë during the First Age of the World. He was called “the\nDeathless” as he lived long before an age far more advanced than any\nother Dwarf, and so was revered as the eldest of their race.\n\nEach of these seven Dwarves' parents founded a house. Durin's House was\nthe Longbeards, and his people were named Durin's Folk.\n\nAccording to the traditions of the Dwarves, he was put to sleep alone\nunder Mount Gundabad in the north of the Misty Mountains, which remained\na sacred site for them. He awoke some time after the awakening of the\nElves in 1050 the Age of the Trees, and according to ancient legends he\ntraveled long distances to find other families of Dwarves, and then\nother Dwarves followed. He came to the Mirrormere, a lake in a valley\nbelow Caradhras in the Misty Mountains, and there founded what would\nbecome the largest and richest of the Mansions of the Dwarves:\nKhazad-dûm, also known as Moria .\n\nIn the published version of the story, Durin died before the end of the\nFirst Age. In an old version of Appendix B (“The Tale of Years”) he\nappears leading the Dwarves of the ruined kingdoms of Beleriand to found\nKhazad-dûm at the beginning of the Second Age, but Tolkien abandoned\nthis idea.\n\nAfter the death of Durin, Khazad-dûm was ruled by generations of his\ndescendants until the Balrog, Durin's Bane appeared. In this long line,\nTolkien writes, “Appearing occasionally was an heir like his ancestor\nwho was called Durin”. More complete versions of the Durin's Folk make\nclear that Durins appeared spaced among many generations.\n\nDurin II, Khazad-dûm\n\nTolkien did not write anything about his reign. There are indications\nthat the Dwarves of Khazad-dûm reached an agreement with the first Men\nof the Vales of Anduin, who provided them food in exchange for weapons\nmade by the Dwarves. Such cooperation has evolved into coordinated\nattacks against the Orcs with the heavy infantry of the Dwarves\ncomplemented by mounted archers of the valleys.\n\nDurin III, Khazad-dûm\n\nRuled around 1600 Second Age. And was the first Dwarf-Lord given one of\nthe Seven Rings, although it was not widely known until the end of the\nThird Age. The Dwarves believe that he received this ring from\nCelembrimbor and not from Sauron, even with this having participated in\nthe forging.\n\nHammond and Scull conclude that Durin III was most likely King of\nKhazad-dûm when the West Gate of Moria was built, thus is the Durin\nwhose name appears on the door that was made when the Dwarves were\nallies of Celebrimbor. This is a reasonable reference but appears to be\nunfounded by some direct evidence from Tolkien's writings.\n\nDurin IV, Khazad-dûm\n\nTolkien did not write anything about his reign. He would have lived in\nKhazad-dûm at the end of the Second Age or the beginning of the Third\nAge.\n\nDurin V, Khazad-dûm (Third Age ? - Third Age ?)\n\nDurin V lived in Khazad-dûm, and with the aid of the Dwarf-ring\nprospered. He was the last of the Durins to have reigned in peace as\nKing of Khazad-dûm without knowledge of the Balrog that slept beneath\nthem.\n\nDurin VI, Khazad-dûm (reigned until TA 1980)\n\nDurin VI was King of the Dwarves of Khazad-dûm in the Third Age, when\nDwarves mining in search of mithril in Caradhras' roots awakened the\nBalrog of hiding deep within the earth. The creature killed Durin TA\n1980, and became known as “Durin's Bane”. Durin VI was the first known\nreincarnation of Durin the Deathless to not have a natural death. He was\nsucceeded by his son, Náin I, who was killed by the same Balrog in the\nfollowing year and after this tragic event the ancient city was\nabandoned by its people.\n\nNáin I, son of Durin VI. Khazad-dûm\n\nHe ruled for only one year in Khazad-dûm before being killed by the\nBalrog. He was the last of the Kings of Durin's Line to rule in\nKhazad-dûm, being replaced by his son as King-in-exile.\n\nThráin I, son of Náin I: Erebor. (ruled for 209 years, until TA 2190)\n\nThráin I led a large part of his people away from Khazad-dûm to the\nNortheast of Middle-earth. It was Thráin who founded the great Kingdom\nof the Lonely Mountain in TA 1999, under The Lonely Mountain near the\ncity of Dale and Lake-town on the Long Lake. He was succeeded by his\nson.\n\nThorin I, son of Thrain I. Grey Mountains\n\nHearing of greater riches in the Grey Mountains, he decided to leave\nthe Lonely Mountain with the greater part of his folk, along with the\nDwarven treasure: The Arkenstone, leaving the mountain abandoned for\nover three-hundred years until his descendent Thrór reclaimed it. He was\nsucceeded as king by his son Glóin.\n\nGlóin the son of Thorin I. Grey Mountains (reigned for 96 years until TA\n2385)\n\nGlóin continued the reign of his father in the Grey Mountains, and was\nsucceeded by his son.\n\nÓin, son of Gloin. Grey Mountains (He ruled for 103 years until 2488 TA)\n\nDuring his reign, the Dwarves of Durin's Folk still lived in the Grey\nMountains to the north. In the last years of his reign, the Shadow\nreturned to Dol Guldur in Mirkwood and Orcs and other evil creatures\nbegan to multiply in the northern mountains, and in the later years of\nÓin, the orcs invaded Moria, which was abandoned, and took it. This was\nonly the first of the calamities that would fall on the Durin home for\ncenturies to come.\n\nÓin was 250 years old when he died, having reigned for 103 years. He was\nsucceeded by his son, Náin, who became King Náin II.\n\nNáin II, son of Óin. Grey Mountains (reigned for 97 years until 2585 TE)\n\nAt that time, the prosperous Dwarves began to suffer an attack from the\nnorth by dragons, Náin had two sons, the oldest Dáin, and Borin. he was\nsucceeded by his eldest son as was custom.\n\nDáin I, II Náin son. Grey Mountains (reigned for four years until 2589\nTE)\n\nDáin I's short reign had a blunt end when he was killed next to his\nsecond child, Fror, by a great Cold-drake at the door of his own\nkingdom. He was succeeded by the eldest of his three sons.\n\nThrór the son of Dáin I. Erebor (He ruled for 201 years until 2790 TE)\n\nHe led his people out of the north, infested with dragons, back to the\nLonely Mountain, while his younger brother, Grór, took a piece of his\npeople further east, to dwell in the Iron Hills. He was King under the\nMountain for more than 180 years, until the great dragon Smaug descended\nupon the kingdom and sacked The Lonely Mountain. He escaped destruction\nwith his son and grandson, and wandered the wilderness. He went mad, and\ntried to single-handedly reclaim the former home of his people,\nKhazad-dûm, which he found infested with Orcs. His death at the hands of\nAzog, leader of the Orcs, was the trigger for the War of the Dwarves and\nOrcs. He was succeeded by his son, Thrain II .\n\nThrain II, son of Thrór, King in Exile. Dunland, later the Blue\nMountains (reigned for 60 years until 2850 TA)\n\nThrain II avenged the death of his father by defeating Azog and his army\nof Orcs in Azanulbizar. In the first half of his life, he lived on\nErebor, but later moved to the Blue Mountains west of Eriador. Before\nhis reign ended, he decided to return to Erebor, but while traveling\nthrough the forest, he was captured by evil creatures and died in the\ndungeons of the Necromancer in Dol Guldur. He was succeeded by his son.\n\nThorin II, or Thorin Oakenshield, son of Thrain II. Blue Mountains\n(reigned for 91 years until 2941 TA)\n\nThorin II was a ruler of the Blue Mountains for many years but, like\n\nhis father, was determined to return to his former home in Erebor.\nAccompanied by Gandalf, twelve other Dwarves, and Bilbo Baggins, he\njourneyed far to the East and, against all expectations, recovered the\nLonely Mountain from Smaug. After the death of Smaug, the Battle of Five\nArmies was fought at the feet of Erebor, and Thorin was killed. The only\nliving descendants of Thrór's lineage, his young nephews Fili and Kili,\nhad also perished in battle and so the monarchy was passed to the line\nof Grór, younger brother of Thrór, specifically for Grór's grandson,\nDáin Ironfoot. Although he was not crowned King under the Mountain,\nThorin had claimed the title by law, once he had recovered Erebor.\n\nDáin II, or Dáin Ironfoot, Grór grandson. Erebor (reigned for 78 years\nuntil 3019 T. E.)\n\nDáin succeeded his father, Nain, as Lord of the Iron Hills. Became King\nunder the Mountain as well as King of all the Durin's Folk after the\ndeath of his cousin Thorin Oakenshield, the first in Durin's lineage to\ninherit the kingdom without being the father-to-son succession. Reigned\nsuccessfully for many years until the time of the War of the Ring when\nhe was killed in the Battle of Dale, despite his great age valiantly\nfighting the Easterlings who, under Sauron's orders, attacked Erebor and\nDale. After his death the Men and Dwarves were besieged inside Erebor.\nHe was succeeded by his son.\n\nThorin III, or Thorin Stonehelm. Erebor\n\nThorin III took the lead of his people after the death of his father. He\nendured a brief siege of seven days in Erebor, when news of the defeat\nof Sauron reached the Easterlings, he and the Men of Dale led by Bard II\ncharged out of the mountain and routed the Easterlings. He helped\nrebuild the Lonely Mountain and Dale, and prospered. His realm became a\nclose ally of the Reunited Kingdom of Arnor and Gondor of King Elessar.\nThorin III had an heir, who was held to be the reincarnation of Durin\nthe Deathless, and who succeeded him at his death as Durin VII the Last.\n\nDurin VII\n\nDurin VII, or “the Last”, was a direct descendant of King Thorin\nStonehelm (and according to some sources, was his son), ruler of Erebor\nand the Iron Hills in the Fourth Age. His birth was apparently\nprophesied at the rise of Dáin II after the Battle of Five Armies. He\nled the Dwarves of Durin's Folk in the recolonization of Khazad-dum some\ntime after the beginning of the Fourth Age, and there they remained\n“Until the world grew old and the days of Durin's race came to an end.”\n\nDurin I died before the end of the First Age, then between his reign and\nThorin III, Kings of Durin's Line ruled for a period of about 6,500\nyears. Assuming that the average time of a reign of a King of Durin's\nFolk was approximately a century, it can be deduced that there have been\nabout fifty names of Kings that are not on this list.",
  "other_names": "Durin's Folk (also called the Longbeards)",
  "dominions": "Mount Gundabad\nKhazad-dûm\nLonely Mountain\nGrey Mountains\nIron Hills\nBlue Mountains\nThorin's Halls",
  "languages": "Khuzdul\nWestron",
  "members": "Durin\nThorin\nBalin\nDáin Ironfoot\nGimli",
  "lifespan": "Longer than other dwarves: 250-350 years",
  "distinctions": "Oldest and wisest of the Dwarven clans",
  "origins": "Descendants of Durin the Deathless",
  "locations": "Mount Gundabad, Khazad-dûm, Erebor, Grey Mountains, Iron Hills, Blue\nMountains, Thorin's Halls, Glittering Caves",
  "affiliation": "Last Alliance of Elves and Men",
  "rivalries": "Elves"
}