{
  "name": "Maeglin",
  "lotr_page_id": "2526",
  "text": "MAEGLIN was an Elf, the son of Eöl the “Dark Elf” and Aredhel daughter\nof Fingolfin. He lived during the First Age of the Sun in Middle-earth,\nand was a lord of the hidden Elven kingdom of Gondolin. He became\ninfamous for his betrayal of the location of the city of Gondolin to the\nDark Lord Morgoth.\n\n\nBiography\n\nAredhel had left Gondolin to wander through Beleriand, and in the woods\nof Nan Elmoth, she met Eöl, and stayed with him, eventually giving birth\nto Maeglin. Eöl gave his child the name _Maeglin_ when he was twelve.\nHis mother told him about Gondolin and its people throughout his\nchildhood and he desired to see his related kin in the Hidden City. He\nand his mother soon grew weary and discontented with their life in Nan\nElmoth and Eöl's strict shunning of the outside world. When Aredhel\nfinally decided to leave Eöl, she took her son (who stole his father's\nsword, Anguirel, forged of meteoric iron) with her and returned to\nGondolin. However, Eöl had followed her, and in judgment before Turgon,\nhe attempted to kill Maeglin with a poisoned dart, but hit Aredhel\ninstead. She died, and Eöl was cast down to his death from the city\nwalls.\n\nMaeglin was now an orphan, but Turgon held him in honor, and Maeglin\nboth learned and taught much. He became an elven-prince held in high\nesteem, even leading his own noble house. He found rich loads of metals\nin the Echoriath surrounding the city and forged weapons of steel\nstronger than had been seen before. His mine in the Echoriath was named\n_Anghabar_, “Iron Mine”. In the Nirnaeth Arnoediad, Maeglin refused to\nremain behind as regent, and went forth to battle with Turgon. The\nseventh and final gate of Gondolin, the Great Gate of Steel, was\nMaeglin's creation.\n\nEven though Maeglin was one of the mighty of Gondolin, his greatest\ndesire was to take Turgon's daughter Idril to be his wife. But his\ndesire was in vain, for Idril was his own first cousin, and as such was\nconsidered by Elven society to be too close in kinship with Maeglin to\nallow for any romantic relationship. Additionally, Idril was well aware\nof Maeglin's thought concerning her and despised him for it.\n\nWhen Tuor came, carrying Ulmo's warning of the danger to Gondolin,\nMaeglin sat on the right hand of Turgon and argued against Tuor. The\narguments made by Maeglin were instrumental in convincing Turgon not to\nleave Gondolin despite Ulmo's warnings, which ultimately resulted in the\nnear-complete slaughter of the city's people. Seven years later, Tuor\nand Idril were wed and Idril bore a son, Eärendil, further increasing\nMaeglin's hate. Some time later, Maeglin was captured by orcs while\nseeking for metals outside of the Encircling Mountains. He was brought\nto Angband and taken before Morgoth himself, who knew that Maeglin dwelt\nin Gondolin and was eager to learn its location. He threatened Maeglin\nwith unimaginable torment, and though Maeglin was no craven, he was\ncowed by Morgoth's threats and betrayed the location and weaknesses of\nGondolin in exchange for his freedom. Morgoth was overjoyed to obtain\nthis information, and to further encourage Maeglin and ensure both his\nsilence and his further aid, Morgoth promised him both rule of the city\nand the hand of Idril once Turgon was overthrown. Maeglin assented\neagerly to this bargain. Afterwards, Morgoth released him and he\nreturned to Gondolin without suspicion. When the hosts of Morgoth\nattacked and overran the city, Maeglin sought to capture Idril and\nfought with Tuor on the walls. But Tuor prevailed, and threw him from\nthe wall to his death.\n\nMaeglin was a relatively young elf, being merely 190 years old at the\ntime of his death.[1]\n\n\nEtymology\n\n_ÎON_ was the first name given to Maeglin, by Eöl, which simply meant\n'son'. [2] His later and common name _Maeglin_ means “sharp glance” in\nSindarin, with _Maeg_ (in Quenya _maika_) meaning 'sharp, piercing' and\n_glin_ meaning 'gleam'. At birth, Aredhel secretly gave Maeglin the name\nof _LÓMION_, signifying “Child of the Twilight” in the Quenya tongue.[3]\n\n_MORLEG_ was the original and rejected name for him, as found in _The\nWar of the Jewels_.",
  "other_names": "Lómion[1]",
  "titles": "Lord of the House of the Mole",
  "birth": "FA 320[2]",
  "death": "FA 510[2]",
  "spouse": "None",
  "weapon": "Anguirel",
  "race": "Elves",
  "gender": "Male",
  "height": "Tall",
  "hair": "Black",
  "eyes": "Dark",
  "culture": "Avari (Moriquendi), Ñoldor (House of Fingolfin), Gondolindrim"
}