{
  "name": "Arda",
  "lotr_page_id": "238",
  "text": "[A map of Arda before the end of the First Age, courtesy of the\nEncyclopedia of Arda]\n\nARDA (Quenya; IPA: ), also known as EARTH, was the world in which all\npeoples of Middle-earth lived.\n\n\nHistory\n\nArda consisted of land masses, chiefly the continents of Middle-earth\nand Aman, oceans and seas, and an atmosphere. It was a part of Eä, the\ncreated World (i.e., of the whole Tolkienian star system). Arda was\ncreated, together with the rest of Eä, through the Music of the Ainur,\nand was set apart as a dwelling place for the Children of Ilúvatar (that\nis, Elves and Men). When Eä was created, many of the Ainur chose to\ndwell within it as long as it should last, and they built Arda and chose\nto reside there. The most powerful of these Ainur were called the Valar,\nthe Powers of the World.\n\nOriginally, Arda was flat, rather than spherical (though it still had\nmountains and valleys), and the Valar built it to a symmetric plan. They\nlit up Arda with great lamps, and the explosion of biological life that\nensued became known as the First Spring. This period ended when Melkor\nlaunched a surprise attack, destroying not only the lamps but the layout\nof the world.\n\nAfter this time, Arda was surrounded by a mighty , Ekkaia or the\nEncircling Sea, and the continents were separated from each other by\nBelegaer, called the Great Sea. During the Years of the Trees, Valinor,\nthe realm of the Valar occupying most of the continent of Aman, was lit\nup by the Two Trees. Middle-earth was dark. At first it was largely\ncontrolled by Melkor and his servants, but when the Elves awoke the\nValar went to war against Melkor, defeating him and imprisoning him in\nthe Halls of Mandos for “three ages”. During this war, many of the\nwesternmost areas of Middle-earth were drowned beneath the waves.\n\nDuring the captivity of Melkor, the Valar invited the Elves to dwell\nwith them in Aman. Many Elves accepted this invitation, and set out for\nthe West; these became known as the Eldar. Along the way, some groups of\nEldar, notably the Nandor and the Sindar, chose to remain in\nMiddle-earth. The Sindar settled in the region of Beleriand, a\nnorth-western coastal area of Middle-earth.\n\nWhen the Years of the Sun began, Arda experienced the so-called Second\nSpring, a new period of growth and vitality as a result of the light of\nthe sun in Middle-earth. At that time, Men also awoke in the east of\nMiddle-earth.\n\nAt the end of the First Age, Beleriand was destroyed during the War of\nWrath, and much of it sank beneath Belegaer; only a few high points,\nsuch as Himring (later Himling) and parts of Dorthonion (later Tol\nFuin), remained above sea level as islands.\n\nIn the Second Age, Númenor was raised in the Great Sea for the Edain.\nThis island existed through most of the Second Age, but was destroyed as\na result of the pride of the Númenórean people in defying the Ban of the\nValar and sailing to Aman in the west.\n\nDuring the downfall of Númenor, Arda was made round. The Undying Lands\n(Aman and Tol Eressëa) were taken out of the world, and could only be\nreached by the Elves, following the _straight road_ that was granted to\nthem. As Aman was taken away from Arda, new lands and continents were\ncreated.\n\nSouth of Middle-earth was the Dark Land and east of it was the Land of\nthe Sun.\n\nTolkien stated many times that Arda was our world in a fictional time,\nso we can interpret the known regions of Middle-earth as Europe. Tolkien\nstated that The Shire was situated at roughly the same latitude as the\nMidlands of England, while Minas Tirith in Gondor was at the same\nlatitude of , putting Mount Doom and Mordor in the general region of .\nHowever, the entire continent of Middle-earth extends beyond the regions\nknown to Gondor, far into the uncharted East and South, and Middle-earth\nprobably encompassed all of what later became . Information regarding\nboth was very vague. To the south were the Hither Lands including Harad,\nthough “Harad” means “South” and while properly used for the region\nimmediately south of Gondor. Near Harad and Far Harad probably\ncorresponded to North Africa and sub-Saharan , respectively. There were\nmany stretches of sun-scorched desert in Near Harad, but like Africa\nthere was supposedly a jungle beyond it which few had ever ventured to,\nfrom which the great Oliphaunts were found. Tolkien also said that the\nHaradrim loosely corresponded to the (though “Haradrim” refers to a\ngroup of many races, not just the one). Men of Far Harad are also\ndescribed as being black skinned. The vast eastern lands were\ncollectively referred to as Rhûn, and like Harad they are uncharted. The\nEasterlings, like the Haradrim, were a diverse collection of many races,\nranging from nomadic steppe horsemen akin to Turkish and Mongol tribes,\nto civilized and rich kingdoms stretching across the vast Eastlands.\nRhûn supposedly stopped at another ocean at its eastern end. In ancient\ntimes the great chain of the Red Mountains, the eastern counterpart of\nthe Blue Mountains of the west, ran north to south near here (all of the\nworld was once symmetrical at the dawn of time). The Elves first awoke\nin the east, though their original home of Cuiviénen doubtless no longer\nexisted by the Third Age. It is not known if the Red Mountains\nthemselves survived into the Third Age, either intact or in some reduced\nform (like the Blue Mountains). The lands of the east probably\ncollectively corresponded to the Asian continent, if Harad was taken as\nAfrica. It is said that the Blue Wizards went far into the east of Rhûn\nand beyond to stir up rebellions against Sauron in the lands he held\nsway over, though the tales of these struggles never reached the west in\ndetail. It is also said that the Blue Wizards somehow failed in their\nmission; this is interpreted several ways, either that like Saruman they\nset themselves up as lords of men, or that like Radagast they started to\ncare more for the local people they were charged with protecting than\nMiddle-earth as a whole and then refused to return. Tolkien did state\nthat many of the “magic cults” and orders that exist in Asian countries\ntoday can trace their origins back to the Blue Wizards teaching local\npeoples of the east the magical arts.\n\nThere was also a separate continent south and east of Middle-earth\ncalled the Dark Land, which could correspond to . Another separate\ncontinent to the east of Middle-earth was the Land of the Sun, so called\nbecause when the world was flat the Gates of the Sun were near there,\nand it would be scorched. After the Fall of Númenor, Arda is made round\nand new lands are created east of Middle-earth (and west too, now that\nthe world is round and can be circumnavigated), out of these Sun Lands\nthat are apparently meant to be North and South , though none of\nTolkien's mythology deals with what happens there. The Sun Lands were\nknown to contain a north to south running mountain range which could\ncorrespond to the Rockies and Andes mountain ranges.\n\n\nArda Unmarred\n\nThe original world as built by the Valar was referred to as ARDA\nUNMARRED. This world was effectively destroyed by the wars of the Valar\nand Melkor, and only Valinor still resembled it in part. Arda Unmarred\nwas a symmetrical world with everlasting light.\n\n\nArda Marred\n\nARDA MARRED was the name given to the world as it is: the world after\nthe wars of the Valar and Melkor, and the dispersing of Melkor's Fëa and\nhröa throughout the world. It is this world from which are formed the\nFëa and hröa of the Children of Ilúvatar, and therefore it is at times a\ncruel and evil world with plagues, extreme colds, heat, and other\nconcepts which do not exist in Arda Unmarred.\n\nArda Marred also broke the design of Elvish immortality: in Arda Marred\nElves slowly fade, until at last they are little more than wraiths. Only\nin Valinor was this fading delayed, which is one reason all Elves have\nno choice but to sail to Valinor in the end. One of the special\nabilities of the Rings of Power was that they could delay the effects of\ntime, and as such were used by Elrond and Galadriel to preserve their\nrealms. After the destruction of the One Ring in the Fourth Age, the\nElvish rings' power over time was also lost, so the last of the Eldar\nhad no choice but to leave Middle Earth and sail west for Valinor.\n\n\nArda Healed\n\nARDA HEALED is the prophecy that Arda Marred will be restored: it will\nbe like Arda Unmarred but better, since it will also incorporate all the\ngood things of Arda Marred. Arda Healed will be created after the Dagor\nDagorath, when Morgoth will finally be destroyed, and the world broken.\nAfterwards, a new world will be created and will be known as Arda\nHealed.\n\nGaladriel's words while parting with Treebeard at Isengard in The Return\nof the King are “Not in Middle-earth, nor until the lands that lie under\nthe wave are lifted up again. Then in the willow-meads of Tasarinan we\nmay meet in the spring. Farewell!”. This might imply that Beleriand will\nbe recovered after the Dagor Dagorath. It is however unknown, since Arda\nHealed will contain all the good things of Arda Marred, whether Númenor\nwill also be recovered or not.\n\n    _See also: Timeline of Arda, Realms of Arda_\n\n\nRound World version\n\nIn the late Round World version of _The Silmarillion_ (see: The History\nof Middle-earth), ARDA was the name of the entire , while the name for\nthe earth was AMBAR or IMBAR.\n\n\nTranslations around the World\n\n  Foreign Language      Translated name\n  --------------------- -----------------------------------\n  Amharic               ዓርዳ\n  Arabic                أرضا\n  Armenian              Արդա\n  Assyrian              ܐܪܕܐ\n  Belarusian Cyrillic   Арда\n  Bengali               আর্দা\n  Bulgarian Cyrillic    Арда\n  Chinese (Hong Kong)   阿爾達\n  Dari                  اردا\n  Dutch                 Aarde\n  Esperanto             Ardao\n  Georgian              არდა\n  Greek                 Άρντα\n  Gujarati              આર્દ\n  Hebrew                ארדה\n  Japanese              アルダ\n  Kazakh Cyrillic       Арда\n  Korean                아르다\n  Kurdish               ئردا (Arabic script) Irda (Latin)\n  Kyrgyz Cyrillic       Арда\n  Lao                   ະrດະ ?\n  Macedonian Cyrillic   Арда\n  Marathi               आर्द\n  Mongolian Cyrillic    Арда\n  Nepalese              आर्द\n  Pashto                آردا\n  Persian               آردا\n  Russian               Арда\n  Sanskrit              आर्द\n  Serbian               Арда (Cyrillic) Arda (Latin)\n  Sinhalese             ආර්ද\n  Tajik Cyrillic        Арда\n  Tamil                 ஆர்த​ ?\n  Telugu                ఆర్ద\n  Thai                  อาร์ดา\n  Tibetan               ཱརྡ\n  Tigrinya              ዓርዳ\n  Ukrainian Cyrillic    Арда\n  Uzbek                 Арда (Cyrillic) Arda (Latin)\n  Uyghur                ئردا\n\n\nReferences\n\n\nExternal link\n\n-   Encyclopedia of Arda\n\nca:Arda de:Arda es:Arda fr:Arda it:Arda nl:Arda pl:Arda pt-br:Arda\nru:Арда\n\nCategory:Quenya words\n\n _The Atlas of Middle-earth_\n\n _The Silmarillion_",
  "location": "Within Eä",
  "type": "The World",
  "regions": "Aman (including Valinor), Middle-earth (including Beleriand), Dark Land, Númenor, Belegaer",
  "inhabitants": "Valar, Maiar, Elves, Men, Dwarves, etc."
}