{
  "name": "Squint-eyed Southerner",
  "lotr_page_id": "12103",
  "text": "[Squint-eyed Southerner Decipher Card.]\n\nThe SOUTHERNER (aka the SQUINT-EYED SOUTHERNER ) was an old man from the\nhills of Dunland, an outlaw with possible Orc ancestry.\n\n\nBiography\n\nThe Squint-eyed Southerner's true name is unknown. It was rumored that\nhe was a Half-orc and had been driven from Dunland.[1] He was Saruman\nthe White's agent and was put in charge of the negotiation and purchase\nof Pipe-weed and other supplies for Isengard during the war. His orders\nwere also to penetrate the Shire further and learn of any departure of\nany important people recently. He was cornered with Bill Ferny in\nTharbad by the Nazgûl, where out of fear for his own life, he betrayed\nSaruman's own secrets about knowledge of the Shire.[2]\n\nThe Southerner was in league with Bill Ferny and met him in Bree where\nhe told him who Frodo, Sam, Pippin, and Merry were. He was seen in\nFerny's house by the departing company as they were about to leave Bree.\nHe was also called the GOBLIN MAN.[3]\n\n\nPortrayal in adaptations\n\n-   The squint's father appeared in _The Hobbit: The Desolation of\n    Smaug_, as an assassin hired to kill Thorin II Oakenshield along\n    with his partner Bill Ferny Sr..\n\n&nbsp;\n-   In The Lord of the Rings: War in the North, he appears in Bree\n    trying to persuade Harley Bramble to join the outlaws. Eradan,\n    Andriel and Farin convince Bramble otherwise and the Southerner\n    leaves, swearing vengeance. He is voiced by Steve Blum.\n\n\nTranslations around the World\n\n  Foreign Language   Translated name\n  ------------------ -----------------------\n  Finnish            Mustainmaalainen\n  German             Schielender Südländer\n\n\nReferences\n\n\nExternal link\n\n-   Squint-eyed Southerner Decipher card information\n\nCategory:Characters Category:Villains Category:Orc Man Hybrids\nCategory:Agents of Saruman Category:Servants of Sauron\n\n[1] _Unfinished Tales,_ Introduction, Part Three, IV: “The Hunt for the\nRing”, Concerning Gandalf, Saruman, and the Shire\n\n[2] _The Lord of the Rings, The Fellowship of the Ring,_ Book One,\nChapter XI: “A Knife in the Dark”\n\n[3] _The Lord of the Rings, The Return of the King,_ Book Six, Chapter\nVIII: “The Scouring of the Shire”"
}