{
  "title": "Giants",
  "lotr_page_id": "10408",
  "text": "[A stone giant, before and after visual effects in _The Hobbit: An\nUnexpected Journey_ ] [] GIANTS were a mysterious race that lived in\nthe Misty Mountains and North Moors of Middle-earth.\n\n\nHistory\n\nThe origins of Giants are unknown, as is the exact time they began\nappearing in the Middle-earth; however, it seems that they entered the\nhistory of the peoples of Middle-earth in the Third Age.\n\nIn _The Hobbit_\n\nIn _The Hobbit,_ Stone-giants are described as hurling rocks at one\nanother as in a game, during a violent thunderstorm. Their physical form\nwas not described, nor was much else about them.\n\nGandalf used to tell stories to Bilbo when he was young at parties about\ndragons, goblins, giants, and rescue of princesses, and the luck of\nwidow's sons. During the riddle game Bilbo thought of all the giants and\nOgres he had heard of in tales.\n\nAt one point Bilbo saw a rock in a stream, and wondered if it had been\ncast miles into the plain by some giant among giants.[1] He also\ncompared being struck like the crash of battering-rams made of forest\noaks and swung by giants.\n\nGandalf later remarked that he would like to find 'a more or less decent\ngiant' to block several of the orc caves.[2]\n\nIn _The Lord of the Rings_\n\nGiants of the type mentioned in the _Red Book of Westmarch_ are not so\nmuch as mentioned in the'' Lord of the Rings'' trilogy. It is believed\nthat as Tolkien expanded the Middle-Earth cosmology, he simply dropped\ngiants from it.\n\nEarlier versions\n\nIn some of Tolkien's earliest writings giants were among the Úvanimor,\nor monster-folk, that were bred in the earth by Melkor (called _Melko_\nin the early tales) along with monsters, Nauglath (wicked dwarves), and\nogres.\n\nTwo giants are given names in _The Book of Lost Tales Part Two_: Gilim\nand Nan. In addition some of Tolkien's other material there was Wade\n(who may be or have been based on a sea-giant of legend) and Noroth,\nsaid to be a giant.[3]\n\nDuring the development of _The Hobbit_, an early draft described more\ntraditional human-like giants;\n\n  ...rescued so many princesses, earls, dukes, widow’s sons and fair\n  maidens from unlamented giants...\n\nHowever, this was edited to Gandalf telling stories of '...giants and\nthe rescue of princesses' in the final published version.\n\nThere may be a loose connection between the giants described in _Farmer\nGiles of Ham_ and references to generic fairy tale giants mentioned in\nHobbit tales. Farmer Giles giants are described as rude and uncultured\nfolk, and troublesome at times, and being as large as elms and\nstupid.[4] In Tolkien's earliest drafts for _The Lord of the Rings_, he\nwrote;\n\n  'Trolls and giants were abroad, of a new and more malevolent kind, no\n  longer dull-witted but full of cunning and wizardry.'\n\nIn the published editions, the words 'and giants' were removed.\n\nChristopher Tolkien and John Rateliff speculate that some of the various\nreferences to giants by J.R.R. Tolkien are inspired by giants from\nvarious mythology, such as fire-giants, frost-giants, hill-giants,\nsea-giants, and storm-giants.\n\n[1] _The Hobbit_, Ch. VII: “Queer Lodgings”\n\n[2] _The Hobbit_, Ch. VI: “Out of the Frying Pan into the Fire”\n\n[3] _The History of Middle-earth_, Vol. II: _The Book of Lost Tales Part\nTwo_\n\n[4] Tolkien, J. R. R. (2011-05-03). _Tales from the Perilous Realm:\nRoverandom_ and Other Classic Faery Stories (Kindle Locations\n1389-1393). Harper Collins, Inc.. Kindle Edition.",
  "name": "Giants",
  "dominions": "Middle-earth, North Moors, Misty Mountains",
  "lifespan": "Unknown",
  "distinctions": "Thick, rocky, massive, powerful, ancient",
  "height": "Gigantic; more than 100 feet"
}