{
  "name": "Thrór",
  "lotr_page_id": "790",
  "text": "THRÓR was a King of Durin's Folk, the son of Dáin I, the grandson of\nNáin II, the father of Thráin II, the brother of Frór, and Grór, the\ngrandfather of Thorin II Oakenshield, Frerin, and Dís, and the\ngreat-grandfather of Fíli and Kíli.\n\n\nBiography\n\n[Thrór sitting on his throne with the Arkenstone demonstrating his power\nto rule.]\n\nIn his early life, Thrór and his family lived in the dragon-plagued Grey\nMountains. In TA 2589, when their halls came under attack by\nCold-drakes, his father Dáin I and younger brother Frór were both slain\nat their gates by a great Cold-Drake, and Thrór inherited the kingship.\nHe and his youngest brother Grór resolved to divide their folk: Thrór\nled a small portion of the House of Durin to recolonize Erebor where\nthey rediscovered the Arkenstone. Grór led a greater portion of Durin's\nFolk further east to the Iron Hills where he founded his Dwarven realm.\nUnder Thrór's leadership, Erebor prospered for over a century.\nEventually the wealth of the kingdom attracted the attention of the\ndragon known as Smaug, who flew south and destroyed the kingdom, killing\nhundreds of Dwarves and driving away Thrór and his family, as well as\nthousands of other surviving dwarves. The majority of the survivors\nmigrated to the Iron Hills, but some followed King Thrór, his son Thráin\nII, and grandson Thorin Oakenshield west into a long and homeless\nwandering. They eventually settled in the hills of Dunland where they\nmade a living as best they could.\n\nTwenty years later in TA 2790, Thrór now old, poor, and desperate, gave\nto his son Thráin II the last of the Seven Rings and a map of the Lonely\nMountain. He then left his people and journeyed away north with a single\ncompanion called Nár. They crossed over the Misty Mountains through the\nRedhorn Pass and then came south again, crossing the Silverlode into the\nvalley of Azanulbizar beneath the East Gate of Moria. When they arrived,\nthe gate was open. Nár begged Thrór to beware but Thrór disregarded his\npleas and proudly entered Moria as its returning heir, but he did not\ncome back.\n\nNár waited and hid nearby for many days. One day he heard a great shout,\nfollowed by the blast of a horn, and a body was flung out onto the\nsteps. It was indeed the body of Thrór, as Nár had feared. Then a voice\ncalled out to him from just inside the gate. Rather than being killed as\nwell, Nár was instead made use of as a messenger. He was told to deliver\na warning that 'beggars' who would not wait at the doors but instead\nentered to attempt thieving, would meet a similar fate. Nár was told to\nbring this message back to his people. But that was not all: the voice\nproclaimed that he now ruled Moria, and if any wanted to know who was\nking, he had written his name on the beggar's face. Thrór's head lay\nsevered next to his body. Nár turned it over and found branded across\nthe forehead, written in Dwarven runes, a name that would be branded in\nthe hearts of all Dwarves: Azog. He was barred from retrieving the head\nof Thrór and was struck with a pouch containing a few coins of little\nworth, which Azog referred to as a 'fee', but it was meant as a final\ninsulting gesture. Nár took the pouch and fled down the Silverlode. When\nhe looked back, Orcs had emerged from the gate and were hacking apart\nThrór's body and flinging the pieces to the black crows.\n\nThis was the tale that Nár brought back to Thráin II when he returned to\nDunland weeks later. After seven days of sitting in silent grief, Thráin\nat last stood up and declared that this atrocity would be answered. This\nwas the beginning of the War of the Dwarves and Orcs, although it took\nup three years for the Dwarves to gather their full forces. Several\nyears later, Dain Ironfoot, son of Náin, beheaded Azog and mounted the\nOrc's head on a stick. The pouch of coins was stuffed into Azog's mouth.\nThorin, Thrór's grandson, hated Azog ever since.",
  "titles": "King of Durin's Folk, King under the Mountain",
  "birth": "TA 2542",
  "rule": "King of Durin's Folk (TA 2589), King under the Mountain (TA 2589)",
  "death": "TA 2790 (aged 248)",
  "spouse": "Unnamed wife",
  "children": "Thráin II",
  "parentage": "Dáin I",
  "race": "Dwarves",
  "gender": "Male",
  "culture": "Durin's Folk",
  "location": "Grey Mountains, Lonely Mountain",
  "language": "Khuzdul",
  "house": "House of Durin",
  "siblings": "Frór, Grór"
}