{
  "title": "Teleri",
  "lotr_page_id": "2452",
  "text": "The TELERI (Quenya: IPA: ; meaning _Those who come last_; singular\nTELER; IPA: ; adjectival TELERIN; ) were the third of the Elf clans who\ncame to Aman. Those who came to Aman became known as the Falmari. They\nwere the ancestors of the Valinorean Teleri, and the Sindar, Laiquendi,\nand Nandor of Middle-earth.\n\nThe third clan was the largest of the three houses of the Elves, and\nmost of the Avari originally belonged to them. In ancient times they\nnamed themselves LINDAR (Q. IPA: ; singular _LINDA_; adjectival\n_LINDARIN_; ), or “Singers”, because they were known for their fair\nvoices. They were also called NELYAR (Q. IPA: ; “The Third”; singular\nNELYA; adjectival NELYARIN; ). The Sindar of Beleriand called themselves\nsimply _Edhil_, which means _Elves_, and is related to the Quenya word\n_Eldar_ of the same meaning. According to legend, the Teleri were\ndescended from Enel, the third Elf to awake in Cuivienen, his spouse\nEnelyë and their 72 companions, but it was Olwë , the younger brother of\nthe Telerin emissary, Elwë, who eventually became their king.\n\nHistory\n\nThe Teleri were sundered from the first two clans, the Vanyar and the\nÑoldor, because they tarried behind searching for their lost king Elwë\n(later known as Thingol), and the first two clans were ferried across to\nValinor on a huge island before. The Maia Ossë kept them company while\nthey waited, and became their friend. Later when Ulmo returned with the\nisland ferry, the Teleri had grown to love the sea. Ossë convinced Ulmo\nto anchor the island in the bay of Eldamar, off the shores of Aman, and\npersuaded many of the Teleri to remain in Middle-Earth. The Teleri long\nremained on Tol Eressëa, and their language changed in different ways\nfrom that of the Vanyar and Ñoldor. Much later the Teleri learned to\nbuild ships, and finally made it to Aman.\n\nThe Teleri refused to join the Ñoldor in leaving Valinor, and many of\nthem were cruelly slain in the Kinslaying at their chief city of\nAlqualondë, or Swan Harbour. For this reason few or none of the Teleri\njoined the host of the Valar which set out to capture Morgoth for good.\nIt is recounted that the Teleri eventually forgave the Ñoldor for the\nKinslaying, and the two kindreds were at peace again.\n\nTheir tongue, known as _Telerin_ or _Lindalambë_ (tongue of the Lindar),\nwas considered by some to be a dialect of Quenya, but the Teleri\nthemselves considered it to be an independent language. It was much more\nconservative than Quenya, and was the closest to Common Telerin (from\nwhich Sindarin and Nandorin were also derived), and even to Common\nEldarin of the later Elvish languages.\n\nOther versions of the legendarium\n\nIn the early versions of Tolkien's mythology (see: _The History of\nMiddle-earth_), they were known as '' SOLOSIMPI'' (“Pipers of the\nShores”), while the name _Teleri_ was given to the clan of Elves known\nin the published version of _The Silmarillion_ as Vanyar. _'_Nelyar\n_'_and _LINDAR,_ the earlier versions of the term _“Teleri”_, were used\nin the writings that are compiled in _The War of the Jewels_.",
  "pronunciation": "tel-air-ee",
  "other_names": "Nelya, Lindar, Sea-elves",
  "locations": "Alqualondë, Isle of Balar, Ossiriand, Doriath, Tol Eressëa, Edhellond,\nMithlond, Lothlórien, Mirkwood",
  "languages": "Common Telerin, Telerin, Sindarin, Nandorin",
  "members": "Elwë, Olwë, Celeborn, Círdan, Lenwë",
  "lifespan": "Immortal",
  "distinctions": "Adoration for the sea/forest",
  "average_height": "Tall",
  "hair_color": "Dark, silver",
  "skin_color": "White",
  "dominions": "Alqualondë,\nIsle of Balar,\nOssiriand,\nDoriath,\nTol Eressëa,\nEdhellond,\nMithlond,\nLothlórien,\nMirkwood",
  "height": "Tall"
}