{
  "name": "Uinen",
  "lotr_page_id": "2589",
  "text": "UINEN (Quenya; IPA: - “No Water”) was a Maia spirit known as _THE LADY\nOF THE SEA_ and the wife of the Maia Ossë, and she was also a patron to\nall mariners.\n\n\nBiography\n\nBefore the Sun and the Moon\n\nUinen loves all creatures that lived in the saltwater streams of the\nworld and the weeds that grew in them. Her love calmed the violent tidal\nwaves and storms created by Ossë her husband by keeping him in line and\nnot going too far. Her hair spread throughout waters and lies on their\nsurfaces. During the early days Arda, Ossë rebelled against his Lord\nUlmo (_Lord of All Waters_) and served Melkor instead, being carried\naway by the false promises that Melkor gave to him. From then on, for a\nwhile, there rose great tumults in the sea that wrought great ruins to\nthe lands. At that point, and also because of the prayers of Aulë who\ncreated those lands, Uinen helped bring Ossë back to the allegiance of\ntheir lord Ulmo by restraining her husand and bringing him before Ulmo.\nFollowing that, Uinen's husband was pardoned and gave his allegiance\nback to the Valar remaining thereafter faithful then ever to them.[1] To\nthe Maiar Uinen and Ossë, Ulmo their lord gave them the task of the\ngoverning of the waves and the movements of the Inner Seas. Plus ever\nafterwards, Uinen was the one who restrained her Spouse's violence in\nthe seas and on the coasts.[2]\n\nLater on, the Teleri remained long on the coast of the western seas,\nawaiting still for Ulmo to take them to Aman. Likewise, Uinen and Ossë\ncame among the Teleri at the coasts and befriended them. In addition,\nthe Teleri had much love for Uinen and her spouse, for Uinen and Ossë\ncontinued being friends with the Teleri who then dwelt by the mouths of\nthe great river Sirion of Beleriand which flowed into the sea.[3]\nUltimately, the Teleri with their King Olwë at last reached Aman where\nthey built their dwelling as a city-haven named 'Alqualondë' on the\nshores of Eldamar in Aman. However later on, the 'Kinslaying at\nAlqualondë' took place at the Swanhaven of the Teleri where Fëanor,\neldest son of King Finwë of the Ñoldor, and his host of exiled Ñoldor\nattacked the Teleri and forcefully stole their white ships for their\nvoyage to Middle-earth. Notwithstanding though, Uinen wept for the many\nof the Telerin mariners who had been wickedly slain and tossed into the\nsea. What's more, the sea then rose in great wrath by Uinen against the\nNoldorin slayers in that so many of the Telerin ships were wrecked and\nthose of the Ñoldor in them were drowned.[4]\n\nWhen the Hiding of Valinor took place, Ossë raised the enchanted Isles.\nThen next, Uinen enchanted those who ever managed to reach the Isles by\nweaving them in her hair before Irmo (_Master of Dreams & Desires_) put\nthem to age-long sleep.[5]\n\nSecond Age\n\nDuring the Second Age, the mariners of Númenór would cry to Uinen for\nhelp, because she was the only one capable of calming Ossë who loved to\ncreate tumults in the seas, And the Númenóreans lived under her\nprotection while their respect for the Valar endured. Therefore, the\nNúmenóreans held the Maia Uinen in reverence as equal to the Valar.[6]\n\n\nOther Versions of the Legendarium\n\nIn a Númenórean legend, it was told that Uinen had the Isle of Tol Uinen\nplaced in the Bay of Rómenna as a gift to the people of Númenór.[7]\n\nIn the original story of the Sun and the Moon, it was Uinen herself who\nwove the sails for the ship of the Moon. Uinen had made them as white\nmists and foam and some were spread like glittering scales of silver\nfish while others were threaded with tiny stars looking like points of\nlight.",
  "other_names": "The Lady of the Sea",
  "birth": "Before the creation of Arda",
  "death": "Immortal",
  "spouse": "Ossë",
  "gender": "Female",
  "culture": "Maiar"
}