{
  "name": "Fornost",
  "lotr_page_id": "649",
  "text": "FORNOST, also known fully as FORNOST ERAIN (Sindarin 'Northern fortress\nof the Kings' from _for(n)_ (north) + _ost_ (fortress); NORBURY OF THE\nKINGS or simply NORBURY in Westron), was a city in Eriador of the\nkingdom of Arnor. It was located at the south end of the North Downs,\nabout 100 Númenórean miles north of Bree. It was eventually abandoned\nand fell into ruin, and became popularly known as DEADMEN'S DIKE. At the\ntime of the events of _The Lord of the Rings_ (TA 3018 – 3019), Fornost\nhad been abandoned for about a thousand years, and “even the ruins of\nKings' Norbury were covered with grass.”\n\n[The location of Fornost on Middle-earth map.]\n\n\nHistory\n\nIt is not known when Fornost was founded or when the Kings of Arnor\nmoved there from Annúminas. In TA 861, when King Eärendur died, Arnor\nwas divided into three kingdoms, Arthedain, Cardolan and Rhudaur.\nEärendur's eldest son, Amlaith, who became King of Arthedain, had the\nepithet, “of Fornost,” suggesting that Fornost immediately served as the\ncapital of Arthedain; it may have also been the capital of Arnor before\nthe partition.\n\nFornost was located along the southernmost edge of the North Downs. As a\nmilitary fortress, it served to guard the gap between the North Downs\nand the Weather Hills against incursions by the forces of Rhudaur or\nAngmar. The Palantir of Annúminas may have eventually been relocated to\nFornost; that of Amon Sûl was taken to Fornost when the Tower of Amon\nSûl fell to the Witch-king's forces in TA 1409.\n\nEarly in TA 1974, Fornost, along with the rest of Arthedain, fell to a\nfull-scale invasion from Angmar, and most of its inhabitants were killed\nor driven over the Lune. King Arvedui, after resisting for a time on the\nnearby North Downs, fled into the northern wastes and was eventually\nlost in the Ice-Bay of Forochel. The Witch-king then set up his\nresidence in Fornost, and populated the city with “evil folk”. The next\nyear, a fleet from Gondor, led by Eärnur, landed at Mithlond. Along with\nallies from Lindon, Rivendell and the former territories of Arnor, they\ndefeated the Witch-king of Angmar on the plains west of Fornost; though\nhe escaped, Angmar's army was utterly destroyed.\n\nAt the end of the war, the northern Dúnedain, now led by Arvedui's son\nAranarth, were too few in number to rebuild their nation or maintain\ncities. Fornost was not resettled, and gradually fell into ruin. The\nDúnedain, who became a secretive and wandering people known in Eriador\nas Rangers, visited Fornost, but most other folk avoided the ruined\ncity; the Men of Eriador called it “Deadmen's Dike” and many believed it\nto be haunted.\n\nAfter the War of the Ring, Fornost Erain was rebuilt by King Elessar.\n\n\nPortrayal in Adaptations\n\nVideo games\n\n[As seen in _The Battle for Middle-earth II: The Rise of the\nWitch-king_]\n\nSeveral video games have depicted Fornost so far.\n\n-   _The Battle for Middle-earth II: The Rise of the Witch-king_\n    features it as a site of battle during the Witch-king's campaign.\n-   _The Lord of the Rings Online_ depicts Fornost as overrun by\n    Angmar's forces in TA 3018, players are encouraged to fight through\n    the city and cleanse it of the Servants of the enemy.\n-   In _The Lord of the Rings: War in the North_, Fornost is where\n    Sauron's lieutenant, Agandaur, made a deal with the Witch-King of\n    Angmar to help conquer Middle-Earth with Orcs he gathered in the\n    North, until a small band of free peoples (Elladan, Elrohir, Eradan,\n    Andriel, Farin and Beleram) forces him to flee.\n\n\nEtymology\n\n_Fornost_ literally translates in Sindarin as “Northern City”, from\n“forn” meaning north, northern and “ost” meaning city, fortress or large\ndwelling. The same basic roots are present in Quenya _Formenos_, the\n“Northern Fortress” Fëanor built in Valinor.",
  "type": "Capital city",
  "other_names": "Fornost Erain, Norbury of the Kings, King's Norbury, Deadman's Dike",
  "location": "Eriador",
  "regions": "Arnor, Arthedain, Reunited Kingdom",
  "description": "Known as the capital of Arnor and later Arthedain",
  "inhabitants": "Dunedain of Arnor",
  "spoken_languages": "Westron",
  "governance": "Kings of Arnor, Kings of Arthedain, Kings of the Reunited Kingdom",
  "founded_or_built": "SA 3320",
  "lifespan": "Early Third Age - TA 1974, Early Fourth Age -"
}