{
  "name": "Rhovanion",
  "lotr_page_id": "305",
  "text": "[Illustration of the Wilderland, or Rhovanion, from _The Hobbit_]\n\nRHOVANION or WILDERLAND was a large region of northern Middle-earth. The\nGreat River Anduin flowed through it, and the immense forest of\nGreenwood the Great was a part of it.\n\nProperly speaking Rhovanion was the name of a small region east of\nGreenwood, which later was the Kingdom of Rhovanion, but the name was\nused for all of Wilderland by the late Third Age.\n\n\nHistory\n\nFirst Age\n\nIn the First Age the Elves passed through it during the Great Journey,\nand much later the Atanatári (Fathers of Men) followed them. It is not\notherwise mentioned until the Second Age.\n\nSecond Age\n\nRhovanion played host to two Silvan Elf kingdoms ruled by Sindarin\nlords: Northern Greenwood and Lórinand (or Lórien).\n\nThe great battlefield (or Dagorlad) of the War of the Last Alliance\nagainst the host of Sauron lay in the south of Rhovanion, and in the\nGladden Fields of the Great River the High King of Gondor and Arnor,\nIsildur, son of Elendil, was killed.\n\nThird Age\n\nIn the early Third Age, it was a quite populated area: in the north lay\nthe Dwarven kingdoms of Erebor and the Dwarf halls in the Ered Mithrin,\nand the Mannish kingdom of Dale, in the north of the Great River Anduin\nlay the Mannish realm of Éothéod, and in and around the south and east\nof Greenwood the Great lived the Men of Rhovanion.\n\nIn TA 1248 Rómendacil II of Gondor destroyed all camps of the\nEasterlings even beyond the Sea of Rhûn, and a strong alliance with\nRhovanion was forged. The King of Rhovanion at this time was Vidugavia,\nand Prince Valacar of Gondor served in his army. Vidugavia's daughter\nVidumavi married Valacar, and their son Vinitharya became King Eldacar\nin TA 1432, which led to the Kin-strife in TA 1437. Eldacar fled to\nRhovanion, and with a Rhovanion army he reclaimed his Kingdom in TA\n1447.\n\nIn the north of Greenwood lived the Silvan elves ruled by Thranduil, and\nin the south of Greenwood and across the river in Lórinand ruled Amdír\nand later Amroth. In the far south, near the great falls of Sarn Gebir,\nwatched the northern guard of Gondor, and in the valleys of the Anduin\nlived Stoors (Hobbits).\n\nIn TA 1636 the Great Plague devastated Rhovanion, killing more than half\nits people. This left Rhovanion weakened, and in TA 1851 the Wainriders\noverran and enslaved Rhovanion. For 43 years Rhovanion was enslaved, but\nin TA 1899 Rhovanion revolted, while Gondor attacked the Wainriders from\nthe west. Rhovanion was freed but left extremely weakened. Many Men of\nRhovanion left for Gondor, where they were welcomed as distant\nrelatives.\n\nIn circa TA 2460 Sauron returned as the Necromancer he took residence at\nDol Guldur in the south of Greenwood. And Greenwood became evil, and was\nrenamed Mirkwood. The Dwarves of Erebor and the Men of Dale were\ndestroyed and scattered when the Dragon Smaug took Erebor, and Gondor\nretreated from the Falls. Some Men still lived along the forest, notably\nthe Beornings and the Men of Esgaroth upon the Long Lake. The Men of\nÉothéod removed south at the invite of Gondor, and settled the plains of\nCalenardhon, later Rohan. After being driven out of Erebor the Dwarves\nrelocated, some went to the Iron Hills, but most went to the Ered Luin\nin Eriador.\n\nAt the end of the Third Age, the Kingdoms of Erebor and Dale were\nrestored as a result of the death of Smaug and the Battle of Five\nArmies, and Sauron was removed from Mirkwood by the wizard Gandalf.\nDuring the War of the Ring it held off an invasion by Sauron's forces,\nand after Sauron was defeated Mirkwood was clean again, and renamed\n_Eryn Lasgalen_, or “Wood of Greenleaves”. Some time during the Fourth\nAge Gondor claimed large parts of it.\n\n\nBoundaries\n\n-   To the east: the River Running and the inland Sea of Rhûn.\n\n&nbsp;\n-   To the north: the Grey Mountains and Iron Hills, home of the\n    Dwarves.\n\n&nbsp;\n-   To the west: the range of the Hithaeglir, or Misty Mountains.\n\n&nbsp;\n-   To the south: the line marked by the Limlight river, Anduin, Emyn\n    Muil, Dagorlad, and the Ered Lithui.\n\nImportant rivers were the Anduin or Great River, the Celduin or Running,\nand the Carnen or Redwater.\n\nMajor features were the forest of Mirkwood, and the Long Lake of\nEsgaroth.\n\n\nEtymology\n\n_Rhovanion_ is Sindarin[1] for “wilderland” and contains _rhovan_, with\nthe place-name ending _-ion_.\n\n_Wilderland_ was a Hobbit name.[2] Tolkien made _Wilderland_ based on\n_wilderness_ but with a side-reference to the verbs _wilder_, “wander\nastray” and _bewilder_.",
  "type": "Region",
  "other_names": "Wilderland",
  "location": "North-west of Middle-earth",
  "regions": "Khazad-dûm, Lothlórien, Woodland Realm, Kingdom of Dale Lonely Mountain, Iron Hills, Dol Guldur",
  "description": "Large, inhabited region focused around Mirkwood",
  "race": "Dwarves, Elves, Hobbits, Men, Orcs, Eagles, Dragons"
}