{
  "name": "Middle-earth",
  "lotr_page_id": "37",
  "text": "“MIDDLE-EARTH”, or ENDOR in Quenya (_ENNOR_ in Sindarin) - and in _The\nBook of Lost Tales_ THE GREAT LANDS - are the names used for the\nhabitable parts of Arda after the final ruin of Beleriand, east across\nthe Belegaer from Aman.\n\nThis continent is north of the Hither Lands shown in the Ambarkanta, and\nwest of the East Sea; and throughout the First and Second Ages it went\nthrough many colossal geographical changes, caused by Iluvatar.\n\n\nName\n\nThe term “Middle-earth” was not invented by Tolkien. Rather, it comes\nfrom Middle English _middel-erde_, itself a folk-etymology for the Old\nEnglish word _middangeard_ (_geard_ not meaning _Earth_, but rather\n_enclosure_ or _place_, thus _yard_, with the Old Norse word _miðgarðr_\nbeing a cognate). It is Germanic for what the Greeks called the\nοικουμένη (_oikoumenē_) or “the abiding place of men”, the physical\nworld as opposed to the unseen worlds (_The Letters of J. R. R.\nTolkien_, 151). The word _Mediterranean_ comes from two Latin stems,\n''medi- '', amidst, and _terra_, (earth/land), meaning “the sea placed\nat the middle of the Earth / amidst the lands”.\n\n_Middangeard_ occurs six times in Beowulf, which Tolkien translated and\non which he was arguably the world's foremost authority. (See also J. R.\nR. Tolkien for discussion of his inspirations and sources). See Midgard\nand Norse mythology for the older use. Tolkien made middle earth based\non the world today (Geography).\n\nTolkien was also inspired by this fragment:[Map of Middle-earth from the\nfilms]\n\n    _Eala earendel engla beorhtast / ofer middangeard monnum sended._\n    _Hail Earendel, brightest of angels / above the middle-earth sent\n    unto men._\n\nin the “Crist” poem by Cynewulf. The name _earendel_ (which may mean the\n'morning-star' but in some contexts was a name for Christ) was the\ninspiration for Tolkien's mariner Eärendil.[Map of\nMiddle-earth]“Middle-earth” was consciously used by Tolkien to place\n_The Hobbit_, _The Lord of the Rings_, _The Silmarillion_, and related\nwritings.\n\n[Map of the Western part of Middle-earth at the end of the Third\nAge]Tolkien first used the term “Middle-earth” in the early 1930's in\nplace of the earlier terms “Great Lands”, “Outer Lands”, and “Hither\nLands” to describe the same region in his stories. “Middle-earth” is\nspecifically intended to describe the lands east of the Great Sea\n(Belegaer), thus excluding Aman, but including Harad and other mortal\nlands not visited in Tolkien's stories. Many people apply the name to\nthe entirety of Tolkien's world or exclusively to the lands described in\n_The Hobbit_, _The Lord of the Rings_, and _The Silmarillion_.\n\nIn ancient Germanic and mythology, the universe was believed to consist\nof multiple interconnected physical worlds (in Nordic mythology 9, in\nWest Germanic and English mythology, 8). The world of Men, the\nMiddle-earth, lay in the centre of this universe. The lands of Elves,\ngods, and Giants lay across an encircling sea. The land of the Dead lay\nbeneath the Middle-earth. A rainbow bridge, Bifrost Bridge, extended\nfrom Middle-earth to Asgard across the sea. An outer sea encircled the\nseven other worlds (Vanaheim, Asgard, Alfheim, SvartAlfheim,\nMuspellheim, Nidavellir, and Jotunheim). In this conception, a “world”\nwas more equivalent to a racial homeland than a physically separate\nworld.\n\n\nThe world\n\n[A speculative map of Arda before the end of the First Age, courtesy of\nthe Encyclopedia of Arda.]\n\nTolkien stated that the geography of Middle-earth was intended to align\nwith that of our real Earth in several particulars. (Letters #294)\nExpanding upon this idea some suggest that if the map of Middle-earth is\nprojected on our real Earth, and some of the most obvious\nclimatological, botanical, and zoological similarities are aligned, the\nHobbits' Shire might lie in the temperate climate of England, Gondor\nmight lie in the Mediterranean Italy and Greece, Mordor in Sicily, South\nGondor and Near Harad in the deserts of Northern Africa, Rhovanion in\nthe forests of Germany and the steppes of Western and Southern Russia,\nand the Ice Bay of Forochel in the fjords of Norway. Far Harad may have\ncorresponded with Southern Africa, and Rhûn corresponded with the whole\nof Asia. _The Hobbit_ and _The Lord of the Rings_ are presented as\nTolkien's retelling of events depicted in the Red Book of Westmarch,\nwhich was written by Bilbo Baggins, Frodo Baggins, and other Hobbits,\nand corrected and annotated by one or more Gondorian scholars. Years\nafter publication, Tolkien 'postulated' in a letter that the action of\nthe books takes place roughly 6,000 years ago, though he was not\ncertain.\n\nTolkien wrote extensively about the linguistics, mythology and history\nof the world, which provide back-story for these stories. Many of these\nwritings were edited and published posthumously by his son Christopher.\n\nNotable among them is _The Silmarillion_, which provides a creation\nstory and description of the cosmology which includes Middle-earth. _The\nSilmarillion_ is the primary source of information about Valinor,\nNúmenor, and other lands. Also notable are _Unfinished Tales_ and the\nmultiple volumes of _The History of Middle-earth_, which includes many\nincomplete stories and essays as well as numerous drafts of Tolkien's\nMiddle-earth mythology, from the earliest forms down through the last\nwritings of his life.\n\n\nCosmology\n\nThe supreme deity is called Eru Ilúvatar. In the beginning, Ilúvatar\ncreated spirits named the Ainur and he taught them to make music. After\nthe Ainur had become proficient in their skills, Ilúvatar commanded them\nto make a great music based on a theme of his own design. The most\npowerful Ainu, Melkor (later called Morgoth or “Dark Enemy” by the\nelves), Tolkien's equivalent of Satan, disrupted the theme, and in\nresponse Ilúvatar introduced new themes that enhanced the music beyond\nthe comprehension of the Ainur. The movements of their song laid the\nseeds of much of the history of the as yet unmade universe and the\npeople who were to dwell therein.\n\nThen Ilúvatar stopped the music and he revealed its meaning to the Ainur\nthrough a Vision. Moved by the Vision, many of the Ainur felt a\ncompelling urge to experience its events directly. Ilúvatar therefore\ncreated Eä, the universe itself, and some of the Ainur went down into\nthe universe to share in its experience. But upon arriving in Eä, the\nAinur found it was shapeless because they had entered at the beginning\nof Time. The Ainur undertook great labours in these unnamed “ages of the\nstars”, in which they shaped the universe and filled it with many things\nfar beyond the reach of Men. In time, however, the Ainur formed Arda,\nthe abiding place of the Children of Ilúvatar, Elves and Men. The\nfifteen most powerful Ainur are called the Valar, of whom Melkor was the\nmost powerful, but Manwë was the leader. The Valar settled in Arda to\nwatch over it and help prepare it for the awakening of the Children.\n\nArda began as a single flat world, which the Valar gave light to through\ntwo immense lamps. Melkor destroyed the lamps and brought darkness to\nthe world. The Valar retreated to the extreme western regions of Arda,\nwhere they created the Two Trees to give light to their new homeland.\nAfter many ages, the Valar imprisoned Melkor to punish and rehabilitate\nhim, and to protect the awakening Children. But when Melkor was released\nhe poisoned the Two Trees. The Valar took the last two living fruit of\nthe Two Trees and used them to create the Moon and Sun, which remained a\npart of Arda but were separate from Ambar (the world).\n\nBefore the end of the Second Age, when the Men of Númenor rebelled\nagainst the Valar, Ilúvatar destroyed Númenor, separated Valinor from\nthe rest of Arda, and formed new lands, making the world round. Only\nEndor remained of the original world, and Endor had now become Eurasia.\n\n\nGeography\n\n[A political representation of the lands of Middle-earth] J.R.R. Tolkien\nnever finalized the geography for the entire world associated with _The\nHobbit_ and _The Lord of the Rings_. In _The Shaping of Middle-earth_,\nvolume IV of _The History of Middle-earth_, Christopher Tolkien\npublished several remarkable maps, of both the original flat earth and\nround world, which his father had created in the latter part of the\n1930s. Karen Wynn Fonstad drew from these maps to develop detailed, but\nnon-canonical, “whole world maps” reflecting a world consistent with the\nhistorical ages depicted in _The Silmarillion_, _The Hobbit_, and _The\nLord of the Rings_.\n\nMaps prepared by Christopher Tolkien and/or J.R.R. Tolkien for the world\nencompassing _The Hobbit_ and _The Lord of the Rings_ were published as\nfoldouts or illustrations in _The Hobbit_, _The Lord of the Rings_, and\n_The Silmarillion_. Early conceptions of the maps provided in _The\nSilmarillion_ and _The Lord of the Rings_ were included in several\nvolumes, including “The First Silmarillion Map” in _The Shaping of\nMiddle-earth_, “The First Map of the Lord of the Rings” in _The Treason\nof Isengard_, “The Second Map (West)” and “The Second Map (East)” in the\n_War of the Ring_, and “The Second Map of Middle-earth west of the Blue\nMountains” (also known as “The Second Silmarillion Map”) in _The War of\nthe Jewels_.\n\n_Endor_, the Quenya term for Middle-earth, was originally conceived of\nas conforming to a largely symmetrical scheme which was marred by\nMelkor. The symmetry was defined by two large sub-continents, one in the\nnorth and one in the south, with each of them boasting two long chains\nof mountains in the eastward and westward regions. The mountain chains\nwere given names based on colours (White Mountains, Blue Mountains, Grey\nMountains, and Red Mountains).\n\nMiddle Earth map - FOTR.png\n\nThe various conflicts with Melkor resulted in the shapes of the lands\nbeing distorted. Originally, there was a single inland body of water, in\nthe midst of which was set the island of Almaren where the Valar lived.\nWhen Melkor destroyed the lamps of the Valar which gave light to the\nworld, two vast seas were created, but Almaren and its lake were\ndestroyed. The northern sea became the Sea of Helcar (Helkar). The lands\nwest of the Blue Mountains became Beleriand (meaning, “the land of\nBalar”). Melkor raised the Misty Mountains to impede the progress of the\nVala Orome as he hunted Melkor's beasts during the period of darkness\nprior to the awakening of the Elves.\n\nAdditional changes have occurred when Valar have assaulted Utumno. The\nNorth-west of the Middle-earth, where Melkor met the Valar host, was\n“much broken”. The sea between the Middle-earth and Aman widened, with\nmany bays created, including one which was the confluence of Sirion. The\nhighland of Dorthonion and the mountains about Hithlum were also a\nresult of the battles. Since the changes mentioned include both the\nbeginning and the ending points of Sirion, it is possible the river\nitself was created at the same time.\n\nThe violent struggles during the War of Wrath between the Host of the\nValar and the armies of Melkor at the end of the First Age brought about\nthe destruction of Beleriand. It is also possible that during this time\nthe inland sea of Helcar was drained.\n\nThe world, not including associated celestial bodies, was identified by\nTolkien as “Ambar” in several texts, but also identified as “Imbar”, the\nHabitation, in later post-_Lord of the Rings_ texts. From the time of\nthe destruction of the two lamps until the time of the Downfall of\nNúmenor, Ambar was supposed to be a “flat world”, in that its habitable\nland-masses were all arranged on one side of the world. His sketches\nshow a disk-like face for the world which looked up to the stars. A\nwestern continent, Aman, was the home of the Valar (and the Eldar). The\nmiddle lands, Endor, were called “Middle-earth” and the site of most of\nTolkien's stories. The eastern continent was not inhabited.\n\nWhen Melkor poisoned the Two Trees of the Valar and fled from Aman back\nto Endor, the Valar created the Sun and the Moon, which were separate\nbodies (from Ambar) but still parts of Arda (the Realm of the Children\nof Ilúvatar). A few years after publishing _The Lord of the Rings_, in a\nnote associated with the unique narrative story “Athrabeth Finrod ah\nAndreth” (which is said to occur in Beleriand during the War of the\nJewels), Tolkien equated Arda with the Solar System; because Arda by\nthis point consisted of more than one heavenly body.\n\nAccording to the accounts in both _The Silmarillion_ and _The Lord of\nthe Rings_, when Ar-Pharazôn invaded Aman to seize immortality from the\nValar, they laid down their guardianship of the world and Ilúvatar\nintervened, destroying Númenor, removing Aman “from the circles of the\nworld”, and reshaping Ambar into the round world of today. _Akallabêth_\nsays that the Númenóreans who survived the Downfall sailed as far west\nas they could in search of their ancient home, but their travels only\nbrought them around the world back to their starting points. Hence,\nbefore the end of the Second Age, the transition from “flat earth” to\n“round earth” had been completed.\n\nThe Endor continent became approximately equivalent to the Eurasian\nland-mass, but Tolkien's geography does not provide any exact\ncorrelations between the narrative of _The Lord of the Rings_ and Europe\nor near-by lands. It is therefore assumed that the reader understands\nthe world underwent a subsequent undocumented transformation (which some\npeople speculate Tolkien would have equated with the Biblical deluge)\nsometime after the end of the Third Age, or possibly at the fall of\nSauron itself at the end of the Third Age. Another explanation is that\nmany places shifted location, the Misty Mountains moving North to\nScandinavia, the White Mountains rotating to become the Alps and the\nmountains of the west Balkans, Near Harad moving south and west to\nbecome the Sahara, Eriador flooding to become northern France and the\nBritish Isles, and so on. This would not be the first time that this had\nhappened, as it seems that a consequence from the Siege of Utumno was\nthat Endor rotated eastward, its axis the north pole.\n\n\nPeople\n\n    _see also: List of Middle-earth people_\n\nMiddle-earth was home to several distinct intelligent species. First are\nthe Ainur, angelic beings created by Ilúvatar. The Ainur sing for\nIlúvatar, who creates Eä to give existence to their music in the\ncosmological myth called the _Ainulindalë_, or “Music of the Ainur”.\nSome of the Ainur then enter Eä, and the greatest of these are called\nthe Valar. Melkor (later called _Morgoth_), the chief personification of\nevil in Eä, is initially one of the Valar.\n\nThe other Ainur who enter Eä are called the Maiar. In the First Age the\nmost active Maia is Melian, wife of the Elven King Thingol; in the Third\nAge, during the War of the Ring, five of the Maiar have been embodied\nand sent to Endor to help the free people to overthrow Sauron. Those are\nthe Istari (or _Wise Ones_) (called Wizards by Men), including Gandalf,\nSaruman, Radagast, Alatar and Pallando. There were also evil Maiar,\ncalled Umaiar, including the Balrogs and the second Dark Lord, Sauron.\n\nLater come the Children of Ilúvatar: Elves and Men (men awoke in the\nfirst year of the sun), intelligent beings created by Ilúvatar alone.\n_The Silmarillion_ tells how Elves and Men awaken and spread through the\nworld. The Dwarves are said to have been made by the Vala Aulë, who\noffered to destroy them when Ilúvatar confronted him. Ilúvatar forgives\nAulë's transgression and adopts the Dwarves. Three tribes of Men who\nally themselves with the Elves of Beleriand in the First Age are called\nthe Edain.\n\nAs a reward for their loyalty and suffering in the Wars of Beleriand,\nthe descendants of the Edain are given the island of Númenor to be their\nhome. But as described in the section on Middle-earth's history, Númenor\nis eventually destroyed and a remnant of the Númenóreans establish\nrealms in the northern lands of Endor. Those who remained faithful to\nthe Valar found the kingdoms of Arnor and Gondor. They are then known as\nthe Dúnedain, whereas other Númenórean survivors, still devoted to evil\nbut living far to the south, become known as the Black Númenóreans.\n\nTolkien identified Hobbits as an offshoot of the race of Men. Although\ntheir origins and ancient history are not known, Tolkien implied that\nthey settled in the Vales of Anduin early in the Third Age, but after a\nthousand years the Hobbits began migrating west over the Misty Mountains\ninto Eriador. Eventually, many Hobbits settled in the Shire.\n\nAfter they are granted true life by Ilúvatar, the Dwarves' creator Aulë\nlays them to sleep in hidden mountain locations. Ilúvatar awakens the\nDwarves only after the Elves have awakened. The Dwarves spread\nthroughout northern Endor and eventually found seven kingdoms. Two of\nthese kingdoms, Nogrod and Belegost, befriend the Elves of Beleriand\nagainst Morgoth in the First Age. The greatest Dwarf kingdom is\nKhazad-dûm, later known as Moria.\n\nThe Ents, “shepherds of the trees”, were created by Ilúvatar at the Vala\nYavanna's request to protect trees from the deprivations of Elves,\nDwarves, and Men.\n\nOrcs and Trolls were evil creatures bred by Morgoth. They were not\noriginal creations but rather “mockeries” of Ents and the Children of\nIlúvatar, since only Ilúvatar has the ability to give being to things.\nTheir origins are not detailed (Tolkien considered many possibilities\nand frequently changed his mind). It seems most likely that the Orcs\nwere bred largely from corrupted Elves or Men, or both. Late in the\nThird Age, the Uruks or Uruk-hai appear: a race of Orcs of great size\nand strength. Saruman bred Orcs and Men together to produce “Men-orcs”\nand “Orc-men”; at times, some of these are called “half-orcs” or\n“goblin-men”.\n\nSeemingly sapient animals also appear, such as the Eagles, Huan the\nGreat Hound from Valinor, and the Wargs. The Eagles are created by\nIlúvatar along with the Ents, but in general these animals' origins and\nnature are unclear. Some of them might be Maiar in animal form, or\nperhaps even the offspring of Maiar and normal animals.\n\nIt is unknown to what people of Middle-earth Tom Bombadil belonged. As\nto his nature, Tolkien himself said that some things should remain\nmysterious in any mythology, hidden even to its inventor.\n\n\nLanguages\n\nTolkien devised two main Elven languages which would later become known\nto us as Quenya, spoken by the Vanyar, Noldor, and some Teleri, and\nSindarin, spoken by the Elves who stayed in Beleriand (see below). These\nlanguages were related, and a Common Eldarin form ancestral to them both\nis postulated.\n\nOther languages of the world include\n\n-   Adûnaic – spoken by the Númenóreans\n-   Black Speech – devised by Sauron for his slaves to speak\n-   Khuzdûl – spoken by the Dwarves\n-   Rohirric – spoken by the Rohirrim – represented in the Lord of the\n    Rings by Old English\n-   Westron – the 'Common Speech' – represented by English\n-   Valarin – the language of the Ainur\n\n\nHistory of Middle-earth\n\nThe history of Middle-earth is divided into three time periods, known as\nthe Years of the Lamps, Years of the Trees and Years of the Sun; the\nlatter is typically sub-divided further into four Ages, of which three\nare relevant to the printed works of the legendarium.\n\nThe Years of the Lamps began shortly after the Valar finished their\nlabours in shaping Arda. The Valar created two lamps to illuminate the\nworld, and the Vala Aulë forged great towers, one in the furthest north,\nHelcar with the lamp Illuin, and another in the deepest south, Ringol\nwith the lamp Ormal. The Valar lived in the middle, at the island of\nAlmaren. Melkor's destruction of the two Lamps marked the end of the\nYears of the Lamps.\n\n[A speculative map of Aman during the Second Age.]\n\nThen Yavanna made the Two Trees named Telperion and Laurelin in the land\nof Aman. The Trees illuminated Aman, leaving the rest of Arda in\ndarkness, illuminated only by the stars. At the start of the First Age\nthe Elves awoke beside Lake Cuiviénen in the east of Endor, and were\nsoon approached by the Valar. Many of the elves were persuaded to\nundertake the Great Journey westwards towards Aman, but not all of them\ncompleted the journey (see Sundering of the Elves). The Valar had\nimprisoned Melkor but he appeared to repent and was released on parole.\nHe sowed great discord among the Elves and stirred up rivalry between\nthe Elven princes Fëanor and Fingolfin. He then slew their father, king\nFinwë and stole the Silmarils, three gems crafted by Fëanor that\ncontained light of the Two Trees, from his vault, and destroyed the\nTrees themselves.\n\nFëanor persuaded most of his people, the Noldor, to leave Aman in\npursuit of Melkor to Beleriand, cursing him with the name _Morgoth_.\nFëanor led the first of two groups of Noldor. The larger group was led\nby Fingolfin. The Noldor stopped at the Teleri's port-city, Alqualondë,\nbut the Teleri refused to give them ships to get to Middle-earth. The\nfirst Kinslaying thus ensued; Fëanor and many of his followers attacked\nthe Teleri and stole their ships. Fëanor's host sailed on the stolen\nships, leaving Fingolfin's behind to cross over to Middle-earth through\nthe deadly Helcaraxë (or Grinding Ice) in the far north. Subsequently\nFëanor was slain, but most of his sons survived and founded realms, as\ndid Fingolfin and his heirs.\n\nThe Years of the Sun began when the Valar made the Sun and it rose over\nthe world, Imbar. After several great battles, a Long Peace ensued for\nfour hundred years, during which time the first Men entered Beleriand by\ncrossing over the Blue Mountains. When Morgoth broke the siege of\nAngband, one by one the Elven kingdoms fell, even the hidden city of\nGondolin. The only measurable success achieved by Elves and Men came\nwhen Beren of the Edain and Luthien, daughter of Thingol and Melian,\nretrieved a Silmaril from the crown of Morgoth. Afterward, Beren and\nLuthien died, and were restored to life by the Valar with the\nunderstanding that Luthien was to become mortal and Beren should never\nbe seen by Men again.\n\nThingol quarrelled with the Dwarves of Nogrod and they slew him,\nstealing the Silmaril. With the help of Ents, Beren waylaid the Dwarves\nand recovered the Silmaril, which he gave to Luthien. Soon afterwards,\nboth Beren and Luthien died again. The Silmaril was given to their son\nDior Half-Elven, who had restored the Kingdom of Doriath. The sons of\nFëanor demanded that Dior surrender the Silmaril to them, and he\nrefused. The Fëanorians destroyed Doriath and killed Dior in the second\nKinslaying, but Dior's young daughter Elwing escaped with the jewel.\nThree sons of Fëanor – Celegorm, Curufin, and Caranthir – died trying to\nretake the jewel.\n\nBy the end of the age, all that remained of the free Elves and Men in\nBeleriand was a settlement at the mouth of the River Sirion. Among them\nwas Eärendil, who married Elwing. But the Fëanorians again demanded the\nSilmaril be returned to them, and after their demand was rejected they\nresolved to take the jewel by force, leading to the third Kinslaying.\nEärendil and Elwing took the Silmaril across the Great Sea, to beg the\nValar for pardon and aid. The Valar responded. Melkor was captured, most\nof his works were destroyed, and he was banished beyond the confines of\nthe world into the Door of Night.\n\nThe Silmarils were recovered at a terrible cost, as Beleriand itself was\nbroken and began to sink under the sea. Feanor's last remaining sons,\nMaedhros and Maglor, were ordered to return to Valinor. They proceeded\nto steal the Silmarils from the victorious Valar. But, as with Melkor,\nthe Silmarils burned their hands and they then realized they were not\nmeant to possess them and that the oath was null. Each of the brothers\nmet his fate: Maedhros threw himself with the Silmaril into a chasm of\nfire, and Maglor threw his Silmaril into the sea. Thus the three\nSilmarils ended in the sky with Eärendil, in the earth, and in the sea\nrespectively.\n\nThus began the Second Age. The Edain were given the island of Númenor\ntoward the west of the Great Sea as their home, while many elves were\nwelcomed into the West. The Númenóreans became great seafarers, but also\nbecame increasingly jealous of the elves for their immortality. But\nafter a few centuries, Sauron, Morgoth's chief servant, began to\norganize evil creatures in the eastern lands. He persuaded Elven smiths\nin Eregion to create Rings of Power, and secretly forged the One Ring to\ncontrol the other rings. But the elves became aware of Sauron's plan as\nsoon as he put the One Ring on his hand, and they removed their own\nRings before he could master their wills.\n\n[A map of Númenor during the Second Age, courtesy of the Encyclopedia of\nArda.]\n\nThe last Númenórean king Ar-Pharazôn, by the strength of his army,\nhumbled even Sauron and brought him to Númenor as a hostage. But with\nthe help of the One Ring, Sauron deceived Ar-Pharazôn and convinced the\nking to invade Aman, promising immortality for all those who set foot on\nthe Undying Lands. Amandil, chief of those still faithful to the Valar,\ntried to sail west to seek their aid. His son Elendil and grandsons\nIsildur and Anárion prepared to flee east to Middle-earth. When the\nKing's forces landed on Aman, the Valar called for Ilúvatar to\nintervene. The world was changed, and Aman was removed from Imbar. From\nthat time onward, Men could no longer find Aman, but Elves seeking\npassage in specially hallowed ships received the grace of using the\nStraight Road, which led from Middle-earth's seas to the seas of Aman.\nNúmenor was utterly destroyed, and with it the fair body of Sauron, but\nhis spirit endured and fled back to Middle-earth. Elendil and his sons\nescaped to Endor and founded the realms of Gondor and Arnor. Sauron soon\nrose again, but the elves allied with the men to form the Last Alliance\nand defeated him. His One Ring was taken from him by Isildur, but not\ndestroyed.\n\n[Middle-earth during the Third Age] The Third Age saw the rise in power\nof the realms of Arnor and Gondor, and their decline. By the time of\n_The Lord of the Rings_, Sauron had recovered much of his former\nstrength, and was seeking the One Ring. He discovered that it was in the\npossession of a Hobbit and sent out the nine Ringwraiths to retrieve it.\nThe Ring-bearer, Frodo Baggins, travelled to Rivendell, where it was\ndecided that the Ring had to be destroyed in the only way possible:\ncasting it into the fires of Mount Doom. Frodo set out on the quest with\neight companions—the Fellowship of the Ring. At the last moment he\nfailed, but with the intervention of the creature Gollum—who was saved\nby the pity of Frodo and Bilbo Baggins—the Ring was nevertheless\ndestroyed. Frodo with his companion Sam Gamgee were hailed as heroes.\nSauron was destroyed forever and his spirit dissipated.\n\nThe end of the Third Age marked the end of the dominion of the elves and\nthe beginning of the dominion of men. As the Fourth Age began, many of\nthe elves who had lingered in Middle-earth left for Valinor, never to\nreturn; those who remained behind would “fade” and diminish. The dwarves\neventually dwindled away as well. The dwarves eventually returned in\nlarge numbers and resettled Moria. Peace was restored between Gondor and\nthe lands to the south and east. Eventually, the tales of the earlier\nAges became legends, the truth behind them forgotten.",
  "type": "Continent",
  "other_names": "Ennorath, Endor",
  "position": "Arda, east of Belegaer",
  "regions": "Rohan, Gondor, Mordor, Arnor, Beleriand, Lothlórien, the Shire, others",
  "cultures": "Men, Elves, Dwarves, Orcs, Hobbits, Ents"
}