{
  "title": "Khazad-dûm",
  "lotr_page_id": "6585",
  "text": "Khazad-dûm, also commonly known as Moria or the Dwarrowdelf, was an underground kingdom beneath the Misty Mountains. It was known\nfor being the ancient realm of the Dwarves of Durin's Folk. Khazad-dûm was\nthe greatest kingdom ever by the Dwarves and one of the greatest\nkingdoms ever established.\n\n\nHistory\n\nFoundation\n\nMoria, or as it was known in the ancient days Khazad-dûm, was founded by\nDurin the Deathless. Durin awoke at Mount Gundabad, in the Misty\nMountains, in the period of time known as the Years of the Trees, and\ncame upon a shimmering lake beneath the mountain Celebdil with a crown\nof stars reflected in its waters. He named it Kheled-zaram as it was\nknown in Dwarvish tongue, the Mirrormere. Thereafter it remained a\nrevered place amongst the Dwarves. In the caves above the lake, Durin's\nfolk built Moria.[1][2]\n\nFirst Age\n\nDurin thus became King Durin l of Khazad-dum, the first of the Seven\nFathers of the Dwarves.\n\n[Gates of Moria, and translation of the Writing]\n\nMany centuries later, the Dwarves continued to name their kings after\nhim, as they believed that all other rulers of Moria were\nre-incarnations of Durin who wished to live amongst his people once\nagain. Millennia passed and the caverns of Khazad-dûm became ever more\nfamous in Middle-earth and many kings were set upon the throne of Durin\nthe Deathless. The gates were kept open, as there was no shadow on the\nworld at that point, and the Dwarves were on very friendly terms with\nthe Elves.[3][4]\n\nSecond Age\n\nIn SA 40 after the fall of Beleriand in the War of Wrath and the Dwarves\nof Nogrod had deserted their city, the city was enriched in numbers,\nsmithing, crafting, and masonry. These factors ever strengthened\nKhazad-dûm and brought prosperity to their city. \n\nWith the fall of Beleriand in the north, the Ñoldor looked for a new\nland to call home. They founded the land west of Moria, Eregion. A rare\nfriendship sprang up between the Elves and the Dwarves of this new land,\nand they each aided each other in constructing the magical Western-gate\nof Moria, and went so far that they even presented King Durin lll with a\nlesser Ring of Power. The bond between Khazad-dûm and Eregion suddenly\ncame to end as, in SA 1697, the Dark Lord Sauron corrupted the country\nof the elves, and despite the best efforts of the Dwarves to help them,\nhe succeeded in destroying the fair land driving away all the elves,\nthough the Elves managed to win the war against Sauron, the Dwarves were\nnot that fortunate. At this time the Doors of Durin were flung shut and\nsealed against Sauron's forces, and Khazad-dûm began a long seclusion\nfrom the outside world. It was at this time that the Orcs invaded Mount\nGundabad, taking it from the Kingdom of Durin for themselves.\n\nThird Age\n\n[The Balrog, Durin's Bane]\n\nThroughout the beginning of the Third Age, the Dwarves of Khazad-dûm\nexpanded its treasure, but its numbers began to dwindle. The majority of\ntheir wealth was based on their hoards of Mithril of which they mined in\ntheir deepest tunnels, and as the centuries went by the Dwarves delved\never deeper for the precious metal. \n\nIn TA 1980, they dug too deeply and greedily for Mithril and to their\nloss they unearthed a nameless terror in the depths beneath the city.\nThis dreadful creature wrought destruction throughout the city wiping\nout most of the Dwarves and slaying King Durin VI. Thereafter the\ncreature was named Durin's Bane. After the Dwarves had left, Khazad-dûm\ngathered dust and stood dark and empty, but for the sinister creature\nthat lurked in the depths. This was when it was named Moria, the Black\nPit.\n\nThe monster, later revealed as a Balrog of Morgoth, remained alone in\nMoria for nearly five centuries until it was populated once again, but\nnot by Dwarves. The Orcs, refugees from the north, began to raid the\nabandoned city of its treasures and made a decision to occupy it. They\ncame upon the Balrog and began to worship it as their deity. Mordor\nstarted to send out troops of Orcs and Cave Trolls to populate Moria,\nmaking an evil place for them to multiply. During the Battle of\nAzanulbizar, many of these Orcs were felled in the valley beneath the\neastern gate of Moria in TA 2799, and the numbers were reduced\ndramatically. But the Balrog still remained and many Orcs and Trolls\nwith him, and so Khazad-dûm stayed evil for the time being.\n\nThe wizard Gandalf entered the city for the first time at some point\nbetween TA 2845 and TA 2850 searching for King Thrain ll, who had\nrecently disappeared on a journey to Lonely Mountain.\n\nBalin's Expedition\n\n[Chamber of Mazarbul, Balin's Tomb]\n\nIn TA 2989, the Longbeards, descendants of the ancient Durin Folk living\nat the Lonely Mountain, ignited an attempt to reclaim and recolonize\ntheir ancestral dwelling - Khazad-dûm. The expedition was led by Balin\nson of Fundin, one of Thorin Oakenshield's Company of Dwarves who\naccompanied Bilbo Baggins on the Quest of Erebor. He led a group of\nDwarves from Lonely Mountain to Moria, and successfully eviscerated a\nconsiderable amount of Orcs, taking many of the eastern halls and\nrecovering priceless ancestral treasures such as Durin's Axe. However,\nthe number of Orcs was too great compared to their small company and\nall, including Balin, were slain in TA 2994.\n\nQuest of the Ring\n\n[The Fellowship passing through the great halls of stone.]\n\nWhen the Hobbits Frodo, Sam, Merry and Pippin; the Men Aragorn and\nBoromir; the Dwarf Gimli; the Elf Legolas; and the Wizard Gandalf set\nout from Rivendell on the Quest of the Ring, they were forced to make\ntheir way through Moria after the failed attempt of climbing\nCaradhras (Redhorn) where they were pursued by Wargs. They entered\nthrough the western-gate near a lake with dark waters from which a\ntentacular monster emerged and attempted to kill Frodo. When inside, the\nFellowship passed through many tunnels and great halls until finally\nreaching a chamber and a book, explaining the last accounts of the\nLongbeards.[5]\n\nThey were then taken by surprise as Orcs and cave trolls pursued them\nthrough Moria to the Bridge of Khazad-dûm where the Balrog rose from the\ndepths. Gandalf bravely confronted the creature and the two briefly\ndueled on the bridge before plunging together into the abyss below. This\nsaved Gandalf's friends' lives as they carried on out of Moria into\nDimrill Dale. Gandalf and the Balrog both survived the fall; the wizard\nthen pursued the monster up the Great Stair to the peak of\nCelebdil, where a final battle took place. In the end, Gandalf defeated\nthe Balrog and cast its corpse down onto the mountain side, before\nsuccumbing to the wounds of his battle.[6]\n\nFourth Age and beyond\n\nEventually, Moria was reclaimed by the Dwarves of Durin's Folk under\nDurin VII who became King of Durin's Folk and of Khazad-dûm and lived\nthere ever after.\n\n\nEtymology\n\n_Moria_ means “black chasm”' in Sindarin. KHAZAD-DÛM means “Delving of\nthe Dwarves” in Dwarvish.[7]\n\nOther names\n\n-   DWARROWDELF\n-   HADHODROND\n-   HALLS OF DURIN\n-   MINES OF MORIA\n-   PHURUNARGIAN\n\n[1] _The Atlas of Middle-earth,_ The Third Age, “Migrations of Hobbits”\n\n[2] _The Atlas of Middle-earth,_ The Lord of the Rings, “Moria”\n\n[3] _The Atlas of Middle-earth,_ The Third Age, “Migrations of Hobbits”\n\n[4] _The Atlas of Middle-earth,_ The Lord of the Rings, “Moria”\n\n[5] _The Lord of the Rings, The Fellowship of the Ring,_ Book Two,\nChapter IV: “A Journey in the Dark”\n\n[6] _The Lord of the Rings, The Fellowship of the Ring,_ Book Two,\nChapter V: “The Bridge of Khazad-dûm”\n\n[7] _The Complete Guide to Middle-earth_",
  "type": "Kingdom",
  "other_names": "Moria,\nKhazad-dûm\nHalls of Durin,\nMines of Moria,\nDwarrowdelf,\nHadhodrond",
  "location": "Middle of the Misty Mountains, beneath Celebdil, Caradhras and Fanuidhol",
  "description": "Grandest and most famous of the mansions of the Dwarves",
  "race": "Mostly Durin's Folk",
  "spoken_languages": "Khuzdul,\nSindarin,\nWestron,\nBlack Speech,\nOrkish",
  "governance": "King of Durin's Folk\nLord of Moria (TA 2989-TA 2994)",
  "founded_or_built": "Between YT 1050 and YT 1250[1]",
  "lifespan": "Between YT 1050 and YT 1250",
  "population": "Mostly Durin's Folk",
  "language": "Khuzdul, Sindarin, Westron",
  "founded": "Between Y.T. 1050\nand Y.T. 1250",
  "abandoned": "T.A. 1981",
  "reclaimed": "T.A. 2989",
  "restored": "Fourth Age",
  "followed_by": "Lonely Mountain"
}