{
  "title": "Rivendell",
  "lotr_page_id": "146",
  "text": "RIVENDELL, also known as IMLADRIS, was an Elven town and the house of\nElrond located in Middle-earth. It is described as “The Last Homely\nHouse East of the Sea”, referencing towards Valinor, which is west of\nthe Great Sea in Aman.\n\nLocation\n\nThe peaceful, sheltered town of Rivendell was located at the edge of a\nnarrow gorge of the river Bruinen (one of the main approaches to\nRivendell comes from the nearby Ford of Bruinen), but well hidden in the\nmoorlands and foothills of the Misty Mountains.\n\nHistory\n\nSecond Age\n\n[Rivendell]\n\nRivendell was established by Elrond in the Second Age of Middle-earth in\nSA 1697. During the War of the Elves and Sauron, Eregion was laid waste\nand Elrond brought the survivors to Rivendell, soon Sauron laid siege to\nit but was eventually beaten back. Following the establishment of the\nLast Alliance of Elves and Men the hosts of Gil-galad and Elendil march\nto Imladris and laid camp in there to prepare their arms and then\nproceeded southeast to Dagorlad.[1]\n\nThird Age\n\nWhen Angmar rose to power and conquered Arthedain, Elrond sent\nGlorfindel and a host of elves to meet with the armies of Earnil and\nCirdan thus honoring the Alliance of Elves and Men. After the fall of\nAngmar the heirs of Isildur were fostered in Rivendell.\n\nQuest for Erebor\n\n[Elves of Rivendell]\n\nDuring the Quest for the Lonely Mountain, Bilbo Baggins and the Company\nof Thorin stopped off at Rivendell. Bilbo described it as “a perfect\nhouse, whether you like food or sleep or story-telling or singing, or\njust sitting and thinking best, or a pleasant mixture of them all.”[2]\nAfter the quest, Bilbo and Gandalf returned there and were greeted again\nby Elrond and the elves.[3]\n\nWar of the Ring\n\nYears later, Frodo Baggins and his Hobbit companions journeyed to\nRivendell, where they met with Bilbo, who had retired there after his\neleventy-first birthday. Several other Elves, Dwarves and Men also\narrived at Rivendell on separate errands;[4] at the Council of Elrond\nthey learn that all of their kind are related to the fate of the One\nRing, and they must decide what to do about it. In the end, it was the\nHobbits who influenced the decision.\n\n[A drawing of Rivendell by J.R.R. Tolkien]\n\nThere was a large hall with a dais and several tables for feasting.\nAnother hall, the Hall of Fire, had a fire in it year-round with carven\npillars on either side of the hearth; it was used for singing and\nstorytelling on high days, but stood empty otherwise, and people would\ncome there alone to think and ponder. The eastern side of the house had\na porch at which Frodo Baggins found his friends once he had awakened,\nand was where the Council of Elrond was held.[5]\n\n[Frodo on a balcony of The Last Homely House in Rivendell]\n\nRivendell is protected from attack (mainly by the River Bruinen, Elrond,\nand Elven magic), but Elrond himself said that Rivendell is a place of\npeace and learning, not a stronghold of battle.\n\nAfter the War and Elrond's departure, his sons Elladan and Elrohir lived\nin Rivendell. Their grandfather Celeborn lived with them for a while\nuntil he finally took ship and sailed West.[6]\n\nInhabitants\n\nSeveral notable elves lived in Rivendell:\n\n- Elrond, Lord of Rivendell and the House of Elrond - Celebrian, Lady of\nRivendell and Elrond's wife - Elladan, a son of Elrond. Stayed in\nRivendell with Elrohir into the\n\n   Fourth Age and (perhaps) beyond\n\n- Elrohir, a son of Elrond. Stayed in Rivendell with his brother\n\n   Elladan\n\n- Arwen, daughter of Elrond, who stayed there throughout the War of\n\n   the Ring\n\n- Glorfindel - Erestor - Gildor - Lindir - Celeborn, who stayed there\nfor a while in the Fourth Age before\n\n   sailing West.\n\nEtymology\n\n_IMLADRIS_ is a Sindarin term which means “deep valley of the cleft”:\nfrom _imlad_ (“glen, deep valley”) and _rist_ (“cleft”) or _riss_\n(“ravine”).[7] Its Westron term _RIVENDELL_ comes from the English\n_riven_ (“to tear apart or split”) and _dell_ (“valley”).\n\nBehind the Scenes\n\nThe valley of Imladris (within which the town of Rivendell is situated)\nwas based upon the landscape of Lauterbrunnen, Switzerland. Tolkien was\nsaid to have journeyed to this region; his original painting of\nRivendell is significantly similar to the Lauterbrunnen itself.\n\nPortrayal in adaptations\n\nThe Hobbit film trilogy\n\nIn _The Hobbit: An Unexpected Journey_ extended edition, scenes in\nRivendell were greatly expanded. It makes sense as the company is\nsupposed to have stayed there for 14 days leading up to mid-summer's\neve. The scenes include Elrond discussing problems about the kitchens to\nLindir, until they discover the Dwarves bathing in a special fountain.\n\n[Bilbo discovers the shards of Narsil]\n\nThe second scene is Bilbo looking around Rivendell and discovering\nNarsil, and then meeting Elrond. In their conversation the Hobbit amuses\nthe Elf lord with a witty riddle as an answer to his questions. Elrond\nthen tells him that if he ever would like to return to Rivendell after\nhis mission he would be welcome to stay.\n\nAnother scene includes the  Dwarves messing about in dinner and Bofur\nsinging a song. Elrond and Gandalf are also discussing important matters\nunder the watch of Thorin Oakenshield and Bilbo.\n\n[1]\n\n[2] _The Hobbit_, Chapter III: “A Short Rest”\n\n[3] _The Hobbit_, Chapter XIX: “The Last Stage”\n\n[4] _The Lord of the Rings_, _The Fellowship of the Ring_, Book Two,\nChapter I: “Many Meetings”\n\n[5] _The Lord of the Rings_,'' The Fellowship of the Ring'', Book Two,\nChapter II: “The Council of Elrond”\n\n[6] _The Lord of the Rings_, Prologue, “Note on the Shire Records”\n\n[7] _Parma Eldalamberon_, Words, Phrases and Passages in Various Tongues\nin _The Lord of the Rings_ by J.R.R. Tolkien",
  "type": "City, valley",
  "other_names": "Imladris\nThe Last Homely House East of the Sea",
  "location": "West of the Misty Mountains",
  "regions": "Eriador",
  "description": "The dominion of Elrond and his elves",
  "race": "Ñoldor",
  "spoken_languages": "Sindarin\nWestron",
  "governance": "Elrond",
  "founded_or_built": "SA 1697[1]",
  "lifespan": "SA 1697 - ?",
  "inhabitants": "Elves, Bilbo Baggins, some Dúnedain",
  "created": "S.A. 1697",
  "events": "First and Second Siege of Imladris, Quest of Erebor, Council of Elrond",
  "gallery": "Images of Rivendell"
}