{
  "title": "Tirion",
  "lotr_page_id": "532",
  "text": "TIRION, known fully as TIRION UPON TÚNA, was the city of the Ñoldor in\nValinor in Aman. It was from here that Finwë ruled, and where his sons\nFëanor, Fingolfin and Finarfin lived.\n\nJ.R.R. Tolkien's original name for this city - until the final\ndevelopment of his many tales of the First Age, as accounted in ''The\nHistory of Middle-earth - ''was KÔR.\n\nHistory\n\nThe green hill of Túna was located in the steep-walled valley of\nCalacirya (translated from Quenya as “The Cleft of Light”), the only\npass through the mountains of the Pelóri. Upon the crown of the hill the\nelves raised their largest settlement west of the sea. The walls and\nterraces were white, and the sand in the streets was said to be of\ngrains of diamond, and white crystal stairs climbed from the fertile\nland beneath to the great gates.\n\nThe center of the city was dominated by Ingwë's tower, “Mindon\nEldaliéva”, whose silver lantern shone far out to sea. Beneath the tower\nwas the house of Finwë, first High King of the Ñoldor. Here also was the\nGreat Square, where the white tree Galathilion flourished, and later the\nsite of Fëanor's infamous oath.\n\nAfter most of the Vanyar elves resettled in Valinor, the rule of Tirion\nwas given to Finwë. Many years of bliss followed, until Tirion was\nshaken by the king's eldest son, Fëanor. After the murder of his father\nat the hands of the Dark Lord Morgoth and the theft of his most precious\ngems, the Silmarils, Fëanor assembled the Noldor at the Great Square,\nwhere he urged the elves to leave with him back to Middle-earth to\navenge their king and reclaim the Silmarils, and to see that their lives\nin Tirion were simply a prison brought upon them by the Valar. In the\nend only a tenth of the population remained when Fëanor, his brothers\nand his and their children departed, though some followed their new king\nonly reluctantly, and some would soon after follow Finarfin back to\nTirion.\n\nNearly 600 years passed before Tirion once again appeared in the\nmythology. When all the kingdoms of the elves in Middle-earth were in\nruins, the half-elven Eärendil (father of the famous Elrond) sailed into\nthe west in search of Valinor to ask for the assistance of the Valar in\nthe war against Morgoth. Eärendil arrived in Tirion on a day of festival\nin Valinor when the city was all but empty, and only when he had turned\nhis back on the city and began to return a herald of the Valar\napproached him.\n\nMore than 3,000 years followed before Tirion was for the first time seen\nby mortal eyes by the soldiers of twenty-fifth and last King of Númenor,\ndeceived by Sauron, landed in on the shores of Eldamar and camped around\nTúna, which the fleeing elves emptied. When the Men of Númenor were\nburied under falling hills, Tirion, along with all the Undying Lands,\nwas taken out of mortal reach forever.\n\nEtymology\n\n_Tirion_ was a Quenyan word that meant 'Watch-tower'.",
  "type": "City",
  "other_names": "Tirion upon Túna",
  "location": "Valley of Calacirya north of Taniquetil[1]",
  "regions": "Aman",
  "description": "Known as the principal city of the Ñoldor of Aman",
  "race": "Ñoldor",
  "spoken_languages": "Quenya",
  "governance": "High King of the Ñoldor",
  "founded_or_built": "Between YT 1133 - YT 1140[2]",
  "lifespan": "YT 1133 -",
  "inhabitants": "Noldor",
  "gallery": "Images of Tirion"
}