{
  "name": "Tar-Aldarion",
  "lotr_page_id": "2779",
  "text": "TAR-ALDARION was the sixth King of Númenor, and succeeded his father,\nTar-Meneldur. Tar-Aldarion was married to Erendis, a Númenórean woman,\nwho was not quite of the same status as Aldarion himself, and therefore\nhad a shorter life-span. Aldarion's love for the sea ultimately caused a\nrift between the couple and they separated in SA 882.[1] The tale of\ntheir marriage and estrangement survived the Downfall of Númenor as\n“Aldarion and Erendis, The Mariner's Wife”.\n\n\nBiography\n\nTar-Aldarion was called “THE MARINER”, and his name signifies “of the\ntrees” because he was a noted tree steward and forester — trees were\nessential to the construction of his fleets, but he took great care to\nreplenish what was being felled. His first love was the sea, and he was\nalready a great explorer before he became king. He made several journeys\nto Middle-earth and established contact with Gil-galad in his realm in\nthe Grey Havens making friendship and alliance with him. He also\nestablished a vital Númenorean port in Middle-earth, named Vinyalonde.\nHe built the great haven of Lond Daer on the river Gwathló, and under\nhis reign the deforesting of Enedwaith and Minhiriath began.[2]\n\nHis only child was a daughter, Tar-Ancalimë, so he changed the rules of\nsuccession, replacing the principle of agnatic primogeniture with that\nof fully equal primogeniture. She became the first ruling Queen of\nNúmenor. If the law hadn't been changed then the throne would have\npassed to his sister's son Soronto, heir presumptive at the time.\n\nThe partial story of Aldarion and Erendis can be found in Tolkien's\n_Unfinished Tales_, (ed. Christopher Tolkien). Though the actual story\nwas left incomplete, the book does give some hints on how it continued.\nThe story also contains the first hints of the return of the Shadow,\ni.e. Sauron, to Middle-earth.[3][4]\n\n\nEtymology\n\nALDARION is Quenya which means “Son of trees” from _alda_ (“trees”)[5]\nand _-ion_ (“son”).",
  "other_names": "Anardil\nAldarion[1]\nAnardilya",
  "titles": "The Mariner\nThe \"Great Captain\"[2]\nLord of the Ships and Havens of Númenor\n\nMaster of the Forests[2]\nKing of Númenor",
  "birth": "SA 700[1]",
  "rule": "SA 883[1]",
  "death": "SA 1098[1]",
  "realms": "Númenor",
  "spouse": "Erendis",
  "weapon": "Aranrúth",
  "race": "Men",
  "gender": "Male",
  "culture": "Númenóreans (House of Elros)"
}