{
  "name": "Yavanna",
  "lotr_page_id": "430",
  "text": "YAVANNA (Quenya; IPA: - “Giver of Fruits”) was of the Ainur and Valar,\nand one of the Aratar who was responsible for the growth of all the\nfruits and growing things of Arda. She was also called KEMENTÁRI\n(Quenya; IPA: “Queen of the Earth”), IVON (Sindarin; IPA: “Giver of\nFruits”). She resided in the Pastures of Yavanna, in the south of\nValinor.[1]\n\nShe is the wife of Aulë, older sister of Vána [2], and kin to Melian.[3]\n\n\nBiography\n\nBeginning in the Years of the Lamps during the Spring of Arda, she\nplanted and caused to grow the first growing things of the world (trees\nand plants), which she had long prepared. At first, just as every other\nthing in the world that the Valar nurtured and cared for, these things\nprospered and thrived for a time. Melkor, however, had his own plans and\nthey involved taking the world from his brethren and ruling it for\nhimself. From his great fortress of Utumno in the far north, he sent\nforth his poisons into the veins of the world blighting the Spring of\nArda. Then the things of Yavanna fell sick and rotted and soon after\nMelkor assaulted and destroyed the Two Lamps, breaking the world.\n\nAfterwards, the Valar relocated to the continent of Aman where they\ncreated the Two Trees - the only light in the whole world at that time.\nMiddle-earth was left in darkness, and the living things that survived\nwere put into a great sleep by Yavanna until the rise of the Sun and the\nMoon many thousands of years later.\n\nAfter Eru allowed Aulë's creations, the Dwarves, to survive, Yavanna\nfeared that they would cut down all the trees in Middle-earth. Eru\nanswered her plea by creating Ents to protect the trees.[4][5]\n\nIn the Song of the Ainur, Yavanna sang of branches of great trees that\nwould receive the rain of Manwë and Ulmo, and some trees sang\nto Ilúvatar. This is said to be the conception of the Shepherds of the\nTrees. Her thought also met with Manwe's, setting the arrival of\nthe Great Eagles.[6]\n\nIn the beginning of days, Yavanna planted the first seeds of Arda and\nwatched over the Olvar and all growing things. As Morgoth was corrupting\nher beloved creatures, she contended with him and supported all the\nplans against him. After his expulsion from Arda she planted the seeds\nthat she had long devised and life came to Middle-earth during\nthe Spring of Arda, although in the beginning no flowers bloomed. When\nthe Two Lamps were destroyed much of the life on Middle-earth slumbered\nin the Sleep of Yavanna[7] that lasted until the rising of the Moon and\nthe Sun.\n\nAfter the destruction of the Two Lamps the Valar withdrew to Aman and\ncreated Valinor. Upon the green mound of Ezellohar, Yavanna sat and sang\nwhile the other Valar sat and listened. Her song, with the aid of the\ntears of Nienna brought forth the Two Trees, her greatest creation,\nwhich gave light to the land. However, Yavanna did not forsake the Outer\nLands; at times she would come there and heal the hurts of Morgoth and\nurged the other Valar to wage war on him before the Awakening of the\nElves.\n\nAfter Eru allowed Aulë's creations, the Dwarves, to survive, Yavanna\nfeared that they would cut down all the trees in Middle-earth. Aulë, in\nreply, told her that even Elves and Men, the true Children of\nIlúvatar would have need of her trees as well. Yavanna lamented\nto Manwë, questioning whether anything she had made would be free from\nthe dominion of others. Manwë brought her concerns before Ilúvatar in\nprayer, and Eru did indeed have pity upon Yavanna: He answered her plea\nby creating the Ents to protect the trees.\n\nWhen the Elves built Tirion upon Tol Eressëa Yavanna fashioned the\ntree Galathilion, a lesser image of Telperion, for the court beneath\nthe Mindon.[8]\n\nAfter the destruction of the Two Trees Yavanna examined their remains\nand told the other Valar that if she could use the light of\nthe Silmarils she could heal them. This light she was denied by the will\nof Fëanor.[9] Doing what she and Nienna could, they managed to bring\nforth one silver flower from Telperion and one golden fruit\nfrom Laurelin. She gave these to her husband Aulë, who fashioned vessels\nfor them and thus created the Moon and the Sun.[10]\n\nFor the Men who had stood with the Valar in the War of Wrath the land\nof Andor was raised by Ossë, established by Aulë, and enriched by\nYavanna. When the Edain came to this island they created the realm\nof Númenor.[11] In the later centuries, when the Valar decided to\nsend emissaries to the mortal lands, Yavanna begged the Maia Curumo to\ntake her servant, Aiwendil, with him.[12]\n\n\nEtymology\n\nIn Quenya, _Yavanna_ means “Giver of Fruits”, from _yáve_ (“fruit”)[13]\nand _anna_ (“gift”).[14] KEMENTÁRI, her epithet, means “Queen of the\nEarth”, from _kemen_ (“the Earth”)[15] and _tari_ (“Queen”).[16]\n\nHer name in Sindarin is IVON, the “Giver of Fruits”. It is only attested\nin the compound _Ivonwin_(“Maidens of Yavanna”).[17] The month\n_Ivanneth_ may have been named after Yavanna.[18]\n\nEarlier names\n\n_PALÚRIEN_ was an earlier name for Yavanna. It means “Lady of the Wide\nEarth.”[19]",
  "other_names": "Kementári\nPalúrien",
  "titles": "Fruit-Giver\nQueen of the Earth\nGiver of Fruits\nQueen of the Valar",
  "birth": "Before the creation of Arda",
  "death": "Immortal",
  "realms": "Pastures of Yavanna",
  "spouse": "Aulë",
  "weapon": "Powers of the Valar",
  "race": "Ainur (Valar)",
  "gender": "Female",
  "height": "Varies",
  "culture": "Valier"
}