{
  "title": "Trolls",
  "lotr_page_id": "677",
  "text": "{{race\n|image=Trolls.jpg\n|name=Trolls\n|dominions= [[Angmar]], [[Trollshaws]], [[Mordor]], [[Ettenmoors]], [[Moria]]\n|languages= [[Westron]], [[Black Speech]], [[Orkish]] \n|height=10-50 ft.\n|length=\n|skincolor= Grey\n|haircolor=\n|feathers=\n|distinctions=Strong beasts with limited intellect\n|lifespan=\n|members=[[Cave-trolls]], [[Snow-trolls]], [[Hill-trolls]], [[Olog-hai]], [[Mountain-trolls]], [[Stone-trolls]]\n}}\n''For other uses, see [[Troll (disambiguation)]].''\n\n'''Trolls''' were a very large and monstrous (ranging from between 10-50 feet tall), and for the most part unintelligent (references are made about more cunning trolls<ref>Trolls were abroad, no longer dull-witted, but cunning and armed with dreadful weapons.\n\nJ.R.R. Tolkien (2009-04-17). The Lord of the Rings (p. 44). Harper Collins, Inc.. Kindle Edition. </ref>), humanoid race inhabiting [[Middle-earth]].\n\n==History==\n\n[[Melkor]] created trolls before the [[First Age]]. They were very strong, but turned into stone in sunlight. Many trolls died in the [[War of Wrath]], but some survived and joined the forces of [[Sauron]], the greatest surviving servant of [[Morgoth]]. In the [[Second Age|Second]] and [[Third Age]], trolls were among Sauron's most dangerous warriors. He created the [[Olog-hai]], which were smarter than earlier breeds of trolls. While most trolls cannot bear exposure to sunlight without turning to stone, the Olog-hai apparently could (to the same extent as orcs); this attribute was mentioned in ''[[The Return of the King]]'' as making them particularly dangerous.\n\n[[File:Screen_shot_2010-12-13_at_7.18.51_PM.png|thumb|190px|A mountain troll at the Black Gate, used for opening the gate]]\n\nDuring [[Bilbo]]'s quest to the [[Lonely Mountain]], trolls were known to speak with thick [[Wikipedia:Cockney|Cockney]] accents, specifically three hill trolls who dwelt in the [[Trollshaws]] and had gotten there from the [[Ettenmoors]] . They turned to stone when exposed to sunlight, for stone, as told in ''The Hobbit'', is what trolls were originally made of. They enjoyed eating anything they could get their hands on. While threatening, the trolls in [[The Hobbit]] serve as a comic element. They even had normal names: [[Tom, Bert, and William|Tom, Bert, and William (Bill) Huggins (the only one with a given surname).]][[File:Armored Troll.jpg|thumb|220x220px|Armored Mountain Troll]]During the [[War of the Ring]], [[Frodo Baggins|Frodo]] and the [[Fellowship of the Ring|Fellowship]] encountered cave trolls alongside various orcs within [[Moria]]. Boromir's sword recoiled off the scaled hide of one troll. As things seemed perilous, however, the trolls fled (although this was due to the approach of the far more threatening [[balrog]], [[Durin's Bane]]). [[Sauron]] used Olog-hai in the [[Siege of Gondor]] and [[Battle of the Pelennor Fields]]. In the subsequent [[Battle at the Black Gate]], the hobbit [[Peregrin Took]] killed a large Olog-hai troll with a huge sword. As a result of the [[One Ring]] being destroyed, the [[Black Gate]] collapsed into ruin during that battle. Most of the trolls present at the battle were killed, and the others are known to have fled.\n\n==Physiology and characteristics==\n\nThey were strong and vicious, but generally dim-witted and stupid at best. Some were described as being able to speak, while others appear to be as irrational as animals. The major weakness of at least some trolls was that they turned to stone in sunlight. Their hide was as thick as stone and nigh-impervious to physical attacks. It is stated that they were created by [[Melkor]], although it's not clear exactly how. The [[Ent]] [[Treebeard]] says that trolls were \"made in mockery\" of ents, as [[Orcs]] were of [[elves]], though not necessarily from Entish stock. However, they could be based on another race of [[Middle-earth]], as neither [[Morgoth]] nor Sauron has access to the [[Secret Fire]], and therefore cannot create things, only alter that which already exists. There is reference that sunlight will return them to the stone they were made from in ''[[The Hobbit]]'' and ''[[The Lord of the Rings]]''. They seem to be fond of meat, and will eat almost any animal or being they come across. They also have very disgusting manners.\n\n[[File:ImagesCAPBU10Y.jpg|thumb|left|270px|A Cave Troll]]\n\nDuring the wars of [[Beleriand]], [[Gothmog]], the Lord of [[Balrogs]], had a bodyguard of trolls. While leading his men in a final stand to protect the retreat of [[Turgon]] and the continued secrecy of the [[Gondolin|Kingdom of Gondolin]], the great warrior [[Húrin]] faced them and, due to [[Morgoth]]'s emphatic orders to have [[Húrin]] captured alive, he managed to kill many of them. Their apparently caustic blood, however, melted his axe, allowing [[Orcs]] to swarm over him and bind him, his capture ending the [[Nirnaeth Arnoediad]], where Morgoth triumphed over the united armies of [[Elves]], [[Men]], and [[Dwarves]].\n\nDuring the [[Battle of the Pelennor Fields]], there is a reference to \"men-like [[half-trolls]]\", also called troll-men, but it is unclear whether these men actually had some trollish ancestry or were simply compared to trolls (for some readers, the first interpretation is supported by the similar and interchangeable terms \"orc-men\" and \"half-orcs\", referring to crossbreeds of [[Saruman]]).\n\n==Portrayal in adaptations==\n\n[[File:200px-SnowTroll.jpg|thumb|A snow troll in rage]]\n\nThis section does not cite any references or sources.\nPlease help improve this section by adding citations to reliable sources. Unverifiable material may be challenged and removed. (October 2007)\n\n===Rankin and Bass animated films===\n\nTrolls here are shown as large humanoids of apparently mammalian nature, with large noses and tusks (though Tom's have apparently been broken off in his mouth). Other than [[Tom, Bert, and William]], several trolls in armor are seen in the Siege of Gondor in ''The Return of the King'', as melee fighters and as operators of the [[battering ram]] [[Grond]].\n\n===Bakshi's animated film===\n\n[[Ralph Bakshi]]'s 1978 animated version follows the book very faithfully in its depiction of the encounter with the troll in the Chamber; however, the troll does have toes here. From the parts of it seen through the door it seems to be a humanoid reptilian around nine feet tall. [[Tolkien]] described the troll's foot as flat and toeless. There are no other trolls.\n\n===Peter Jackson's trilogy===\n\nIn [[Peter Jackson]]'s 2001 ''[[The Fellowship of the Ring (film)|The Fellowship of the Ring]]'', there is also only one cave troll. Boromir first sights it; it later barges through the open doors, and smashes much of the Chamber, including Balin's tomb, in the ensuing fight. It stabs Frodo, who is saved by his [[Bilbo's Mithril Shirt|Mithril shirt]] (in the book it is an Uruk captain who spears him). It is killed by the members of the Fellowship (though it puts up a good fight), who spear and hack at it until Legolas dispatches it with an arrow. It enters the soft palate of its mouth and goes straight through its brain, emerging from the top of its head after becoming stuck in the thick skull. It has been noted that, in Jackson's version, light from a window falls on [[Balin's tomb]], which the troll steps into. This theoretically should have turned it to stone, although the light may be coming from the moon during early morning hours.\n\n[[File:Ctrol.jpg|thumb|left|The cave troll that appears in Moria and confronts the Fellowship.]]\n\nBattle trolls were shown as the shock troops in the ''[[The Two Towers (film)|The Two Towers]]'' and the ''[[The Return of the King (film)|The Return of the King]]'', sporting armor and spiked clubs alluded to in the appendices. They were then used in the Siege of Gondor, as primary shock troops after the gates of [[Minas Tirith]] were broken. At least one survived, which carried a hammer instead of a club, and is seen later, attempting to break down a gate.\n\n[[Sauron]]'s military used other trolls for moving extremely heavy objects such as gates and siege towers, sometimes chaining them. The [[cave troll]] in [[Moria]] wore a collar with a trailing chain, suggesting it may have been a former labourer, though this particular specimen was undisciplined enough to attack some of its own allies in the fight, thus perhaps showing others' need to restrain it.\n\n[[File:Screen_shot_2010-12-13_at_7.24.41_PM.png|thumb|250px|A troll confronting Aragorn in the third New Line film]]\n\n[[Aragorn]] fights one of the [[Olog-hai]] during the battle of the [[Black Gate]]. [[Armoured Troll|This olog's]] entire upper body is covered in black plate armour, making it more menacing. While most trolls in the movies wielded clubs, this one wielded a sword, as well as a briefly-seen mace. It fled when the Ring was destroyed, and was last seen running past the ranks of Sauron's army before the ground collapsed beneath them. Earlier versions of this battle had Aragorn battling a reembodied Sauron, but this idea was abandoned in favor of the troll.\n\n=== The Hobbit film trilogy ===\n[[File:Hobbler-trolls.jpg|thumb|292x292px|Tom, Bert and William\n]]\nIn ''[[The Hobbit: An Unexpected Journey]]'','' ''[[Stone-trolls|Stone trolls]] known as [[Tom, Bert, and William]] are encountered by Bilbo, Fíli and Kíli after having stolen several of the Dwarves' ponies. Fíli and Kíli stay back, while Bilbo tries to steal a blade from the trolls to cut the ponies free. When Bilbo is caught accidentally by the trolls, the dwarves charge them and a small skirmish ensuses as Bilbo tries to free the ponies. However, Bilbo is caught, and when the trolls threaten to tear Bilbo apart, the dwarves surrender and are put into sacks. Half of the dwarves are put onto the spit to be cooked over the fire, while the others, including Thorin, along with Bilbo, are left on the ground in their sacks. Bilbo spots Gandalf sneaking around, and begins to discuss with the trolls ways of cooking dwarf in order to buy time. As this plan starts to fail as Tom attempts to eat Bombur raw, Bilbo quickly states the dwarves are infested with intestinal parasites to try to stop the trolls from eating them, but they do not get easily fooled, especially William. Then Gandalf appears, and as the trolls curiously wonder who he is (and if he can be eaten), the wizard using his staff splits a rock that was shielding the trolls from the sun's light as it rises, turning them to stone. After the company was set free, Thorin and Gandalf believe that the trolls never ventured this far south from the Ettenmoors since the Second Age, when a darker power ruled the lands. \n[[File:Guldur Olog-Hai.png|thumb|256x256px|A group of Guldur Olog-hai]]\nIn [[Peter Jackson]]'s 2014 ''[[The Battle of the Five Armies]]'', new types of Troll are introduced exclusive to the film. Specifically [[Guldur Olog-Hai]], [[Guldur War Troll|Guldur War Trolls]] and [[Misty Mountain Troll|Misty Mountain Trolls]].\n\n[[Guldur Olog-Hai]] are present during the later portion of the battle, preparing to charge at a surrounded portion of [[Dain]]'s army at the gate of [[Erebor]]. Six of these trolls were put to the front lines to attack, when [[Thorin Oakenshield]] rallied the [[Dwarves]] and regained their morale, four of these trolls were killed by heavy spears, being lodged directly into their necks, killing them. \n[[File:Screencaps23.jpg|thumb|220x220px|\"Stumpy\" being commandeered by Bofur]]\nA [[Guldur War Troll]] given the name \"Stumpy\" by producers is killed by [[Legolas]] during the [[The Battle of the Five Armies|Battle of Five Armies]]. In the Extended Edition of the film, he is first seen in an earlier scene where he is commandeered by [[Bofur]] in an effort to fight against the [[Guldur Orcs]] and other War Trolls. \n\n===Video games===\n\nVarious movie-only sources, like ''[[The Lord of the Rings: Weapons and Warfare]]'', and the spin-off games by [[Electronic Arts]], greatly expand on what Tolkien wrote about trolls.\n\nIn the world of the films, mountain trolls, including the cave trolls of [[Moria]], are about 17 feet (5 m) tall, with massive limbs, potbellies, and dark scales on its back and shoulders. They come in stony colours, with the most common being grey. They have 22 teeth, including two fangs on the lower canines. As in the book, their blood is black, and is so hot that when split it sizzles on the floor. They are mainly carnivorous, but can digest plant matter if need be. The eyes are either grey or blue. They wear loincloths of leather that they find in the Mines or are given by the [[Orcs]]. They sometimes roar when in a battle rage, but are incapable of forming words or language. They often wield either a great club or a hammer. [[Cave-troll]]s are usually found with small groups of orcs. They are too unintelligent to hunt food for themselves, often consuming whatever hapless creature they come across, so food is an advantage they get from working with the Orcs. Their fingernails extend to most of their fingers, and were allegedly used to dig holes into the rock itself.\n\nThe [[Olog-hai]] differ from the other trolls depicted in the New Line movies in that they have more forward-facing eyes as well as hair on their bodies, suggesting that they are a more advanced form of troll. They are usually grey to black in colour. [[Mountain-trolls]] and Olog-hai have much in common: they are both much larger and more intelligent than most trolls are and more resistant to light. However, Olog-hai are certainly far superior to Mountain-trolls in all these aspects.\n\n[[Forest troll]] were invented for the EA game version of ''The Lord of the Rings: The Two Towers''. They have hard grey skin, are resistant to arrow fire, and carry a large quiver of wood logs (to use as firewood and projectiles), as well as a mace like [[Cave-troll]].\n\n[[File:Drummer.png|thumb|225px|Drummer troll in the Battle of the Pelennor Fields.]]\n\nFor the game version of ''The Lord of the Rings: The Return of the King'', trolls also returned as enemy units. Although they were slow, their attacks could not be blocked and were very strong; however, there was often a war pike around that made them easy to kill. They also appeared as enemies in \"Lord of the Rings: The Third Age\". In this game, they were again slow but powerful, and could take a lot of damage before dying. Some of the later trolls in the game (the [[Attack Troll]]) wielded a pair of large swords, while a stronger kind carried massive war hammers. Trolls also appear as controllable units in The Lord of the Rings: The Battle for Middle-earth, its sequel, The Lord of the Rings: The Battle for Middle-earth II and its expansion The Rise of the Witch-king. In The Lord of the Rings: The Battle for Middle-earth, it is necessary for a regular mountain troll to gain a rank (after destroying enemy units, etc.), to become an attack troll where it gains an armour bonus and can heal by itself as the only non-hero unit who is able to do so. In [[The Battle for Middle-Earth II|''The Battle for Middle-earth II'']], attack trolls can be made from a Rank 3 Troll Cage. In The Rise of the Witch-king, the [[Angmar]] faction has a troll hero named [[Rogash]]. Rogash was portrayed to be an apparently relatively intelligent hill-troll, seemingly serving as the Witch-King's key to power over the trolls. Rogash's authority over the trolls is displayed in his ability to convert other trolls on the battle field to the player's side. Rogash is a potent fighter, and wears a set of (by troll standards) finely crafted and imposing armor, and wields a hefty sword. [[Mountain-trolls]] and [[Cave Troll]] usually flail when dying in ''Battle for Middle-earth''. (Note: when this happens do not fire; it just wastes time.) In all the ''[[The Battle for Middle-Earth II|Battle for Middle-earth]]'' games, trolls are depicted as \"tank\" units (slow, very strong, can take massive damage before being killed).\n\n[[File:Screen_shot_2010-12-13_at_7.19.05_PM.png|thumb|left|190px|Mountain trolls]]\n\nWhile it is never explicitly mentioned in the books that armored battle trolls existed, it is highly likely that they did exist and that Sauron used them for deadly effect.\n\nThere is also a type of troll known as the drummer troll in the movies and games. This troll was not designed for battle, but rather it provided a steady beat, inspiring [[Mordor]] forces. It could also howl to drive opponents away in terror. In the \"Third Age\" PS2 game, these trolls have magic powers. In the games workshop game manual it says that if attacked it will drive away its enemies by hitting them with their drums, however this is not possible because they always run away from battle if they are losing.\n\n[[File:A-hilltrolls.jpg|thumb|Snow trolls in service of Angmar, as seen in game \"The Battle for Middle-earth II: The Rise of the Witch king\"]]\n\nWood trolls in the MMO ''[[The Lord of the Rings Online]]'' are trolls that appear to be semi-entish and made of wood. They appear in the [[Trollshaws]] and Evendim, are particularly difficult to kill, and deal a lot of damage.\n\nThe Lord of the Rings tabletop wargame, produced by Games Workshop, includes an Isengard troll, which is depicted as wearing armour and carrying a shield similar to [[Uruk-hai]].\n\nIn [[Norse mythology]], trolls are magical creatures with special skills, and are so accepted to this day in [[wikipedia:Norway|Norway]]. In Tolkien's writings, they are portrayed as evil, with crude, bloodthirsty habits.\n\nIn ''[[The Battle for Middle-Earth II|The Battle for Middle-Eearth II]]'', there are also [[Attack Troll]]s, drummer trolls, and half-trolls.\n\n==Types==\n[[File:7929159_600x400-1-.jpg|thumb|280px|Stone troll]]Originating in [[Norse mythology]], an extremely widespread belief in its time, there are many types of trolls, each unique to its inhabitants:\n\n* \"[[Stone-trolls]]\" were trolls who turned into stone during daylight, like the trolls in ''The Hobbit''. They could speak, and used a debased form of Westron (presumably rendered into Cockney English in Tolkien's \"translation\" of Bilbo's diary).\n\n* [[Two Headed Trolls|Two-headed trolls]] are said in ''[[The Hobbit]]'' to be more ferocious than those with one head. It is unknown if they actually have two heads or if it is a term for those working for Sauron, for he controlled them, meaning they have two \"heads\".\n\n* [[Hill-trolls]] are described in the chronology at one instance as having killed [[Arador]], grandfather of Aragorn, at the [[Coldfells]]. Tolkien described the trolls of that region, including the three from The Hobbit, as stone trolls, suggesting that hill trolls might be a subclass or alternate term for such. However, the Army of the West fought \"hill trolls\" of Gorgoroth that could move in sunlight at the [[Black Gate]], inferring that these hill trolls, at least, were Olog-hai rather than stone trolls. Hill trolls hardly differ from stone trolls and were probably of the same beast-race.\n\n[[File:Cave_troll_vs_gondor_soldiers.jpg|thumb|250px|A cave troll fighting Gondorian soldiers in the BFME series.]]\n\n*[[Cave-trolls]] were seen in Moria, and were also in the Ettenmoors. One was described as having dark greenish scales and black blood. Their hide was thick enough that when Boromir struck one on the arm his sword was notched and did no damage. However, Frodo Baggins was able to impale the \"toeless\" foot of the same troll with the enchanted sword Sting.\n* [[Mountain-trolls]] were mentioned once, wielding the great battering ram Grond in shattering the gates of Minas Tirith. From their name, they are generally assumed to live in the mountains, and their choice as the creatures to wield Grond is sometimes taken to suggest that they were particularly strong even for trolls.\n\n* [[Snow-trolls]] are mentioned only in comparison to Helm Hammerhand. When Helm went out clad in white during the Long Winter to stalk and slay his enemies, he was described as being like a snow troll. It thus seems implied that these trolls were white in colour and lived in cold climates, but otherwise nothing is known of them.\n\n* [[Olog-hai]] were \"strong, agile, fierce, and cunning\" trolls created by Sauron, not unlike the [[Uruk-hai]], and were able to withstand sunlight while under the sway of Sauron's will.\n* [[Half-trolls]] were troll-like humanoids from [[Harad]] who served Sauron in [[The Battle of the Pelennor Fields]]. While it is unlikely that they had any actual troll blood in them, it is still possible (but more likely they were a superior breed of orcs and/or men).\n\n[[File:The-lord-of-the-rings-the-battle-for-middle-earth-ii-20060131115135052.jpg|thumb|A half-troll]]\n\nThe Olog-hai were actually a breed of mountain trolls. They seldom spoke and were said to know no language other than the [[Black Speech]], in which [[Olog-hai]] means \"troll-folk\" (singular olog, \"troll\"). Because of their cunning, they were (incorrectly) believed by some to be giant [[orcs]] rather than trolls. They appeared towards the end of the [[Third Age]] and could be found near [[Dol Guldur]] and in the mountains around [[Mordor]]. In the [[Battle of the Black Gate]], there appear \"[[Hill troll]]s\" of [[Gorgoroth]], which are implied to be Olog-hai in one of the appendices to The Lord of the Rings (the term is not used within the story proper). These were described as being taller and wider than men and their hide or armour was described as a mesh of horny scales. They had black blood. [[Peregrin Took]] slew one of these trolls at the Battle of the Black Gate and, after the destruction of the [[One Ring]] and the fall of [[Sauron]], the surviving trolls scattered as if mindless.\n\n==Other names==\n\n[[Torog|''Torog'']] was the [[Elven]] ([[Sindarin]]) name for those of troll-kind. Tolkien normally renders it as \"troll\" in his works. The derivation of this word is uncertain - it may be derived from old [[Elvish]] words or perhaps imitates olog, which seems to be the comparative term in [[Black Speech]].\n\n==Gallery==\n\n<gallery type=\"slideshow\">\nt1.jpg|Cave troll\nt11.png|Mountain troll\nt8.jpg|Hill troll\nt5.jpg|River troll\nt9.jpg|Forest troll\nt3.jpg|Snow troll\nt7.png|Half-troll\n</gallery>\n\n==Translations around the World==\n{| class=\"wikitable\" style=\"text-align: center;\"\n!Foreign Language\n!Translated name\n|-\n|Amharic\n|ትሮሎች\n|-\n|Arabic\n|المتصيدون\n|-\n|Belarusian Cyrillic\n|тролі\n|-\n|Bengali\n|ট্রলস\n|-\n|Bulgarian Cyrillic\n|Троловете\n|-\n|Chinese\n|巨魔\n|-\n|Croatian\n|Trolovi\n|-\n|Czech\n|Trollové / Zlobři\n|-\n|Danish\n|Trolde\n|-\n|Dutch\n|Trollen\n|-\n|Finnish\n|Peikot\n|-\n|Georgian\n|ტროლები\n|-\n|German\n|Trolle\n|-\n|Greek\n|Τρολλς\n|-\n|Gujarati\n|વેતાળ\n|-\n|Hebrew\n|טרולים\n|-\n|Hungarian\n|Trollok\n|-\n|Italian\n|Troll / vagabondo / Uomini Neri\n|-\n|Kannada\n|ರಾಕ್ಷಸರು\n|-\n|Latvian\n|Troļļi\n|-\n|Persian\n|عضو شورای نظارت مدت\n|-\n|Polish\n|Trolle\n|-\n|Russian\n|Тролли\n|-\n|Slovak\n|Trollovia\n|-\n|Slovenian\n|Škrati\n|-\n|Spanish\n|Trols\n|-\n|Tamil\n|ட்ரால்ஸ்\n|-\n|Telugu\n|ట్రోలు\n|-\n|Turkish\n|Troller\n|-\n|Ukrainian Cyrillic\n|тролі\n|-\n|Yiddish\n|טראָללס\n|}\n\n==References==\n<references/>{{Races}}[[de:Trolle]]\n[[es:Trolls]]\n[[fr:Troll]]\n[[it:Troll]]\n[[nl:Trollen]]\n[[pl:Trolle]]\n[[ru:Тролли]]\n[[Category:Races]]\n[[Category:Trolls| ]]\n[[Category:Servants of Morgoth]]\n[[Category:Servants of Sauron]]\n[[Category:Minions of Angmar]]\n[[Category:Monsters]]\n[[Category:Evil]]\n[[Category:Army of Mordor]]",
  "origins": "Created by <a href=\"/wiki/Morgoth\" title=\"Morgoth\">Morgoth</a> in mockery of <a href=\"/wiki/Ents\" title=\"Ents\">Ents</a>",
  "locations": "<a href=\"/wiki/Mordor\" title=\"Mordor\">Mordor</a>, <a href=\"/wiki/Ettenmoors\" title=\"Ettenmoors\">Ettenmoors</a>",
  "affiliation": "Mostly <a href=\"/wiki/Morgoth\" title=\"Morgoth\">Morgoth</a> and <a href=\"/wiki/Sauron\" title=\"Sauron\">Sauron</a>",
  "rivalries": "<a href=\"/wiki/Ents\" title=\"Ents\">Ents</a>",
  "languages": "<a href=\"/wiki/Black_Speech\" title=\"Black Speech\">Black Speech</a>, various Mannish tongues",
  "people": "<a href=\"/wiki/Cave-trolls\" title=\"Cave-trolls\">Cave-trolls</a>, <a href=\"/wiki/Hill-trolls\" title=\"Hill-trolls\">Hill-trolls</a>, <a href=\"/wiki/Mountain-trolls\" title=\"Mountain-trolls\">Mountain-trolls</a>, <a href=\"/wiki/Olog-hai\" title=\"Olog-hai\">Olog-hai</a>, <a href=\"/wiki/Snow-trolls\" title=\"Snow-trolls\">Snow-trolls</a>, <a href=\"/wiki/Stone-trolls\" title=\"Stone-trolls\">Stone-trolls</a>, <a href=\"/wiki/Troll-men\" title=\"Troll-men\" class=\"mw-redirect\">Troll-men</a> and <a href=\"/wiki/Half-trolls\" title=\"Half-trolls\">Half-trolls</a>",
  "members": "<a href=\"/wiki/William\" title=\"William\">William</a>, <a href=\"/wiki/Tom\" title=\"Tom\">Tom</a>, <a href=\"/wiki/Bert\" title=\"Bert\">Bert</a>",
  "distinctions": "Strong beasts with limited intellect",
  "average height": "Large",
  "skin color": "Grey",
  "gallery": "<b><a href=\"/wiki/Category:Images_of_Trolls\" title=\"Category:Images of Trolls\">Images of Trolls</a></b>"
}