{
  "name": "Círdan",
  "lotr_page_id": "456",
  "text": "CÍRDAN, also known as NOWË and CÍRDAN THE SHIPWRIGHT, was a Telerin Elf\n(of which he was one of the wisest princes), a great mariner and\nshipwright in Middle-earth.\n\nCírdan was the lord of the Falas and then of the Balar during much of\nthe First Age, one of the wisest and perhaps the mightiest of the\nMoriquendi. He was the bearer of the Great Ring Narya, which he in turn\ngave to Gandalf.\n\nHe was kin to both Elwë and Olwë. He may have also been related to Elmo,\nthe lesser known brother of Elwë.\n\nHe is one of the three oldest living elves in Middle-earth at the end of\nthe Third Age, along with Galadriel and Celeborn, who were all born\nduring the Years of the Trees. At the end of the Third Age, there were\nno other elves who had been alive at the start of the First Age. Círdan\nis one of two elves, the other being Celeborn, to have spent the most\ntime in Middle-Earth of any elf by being present in more ages than any\nother elf. Círdan and Celeborn were in Arda from sometime late in the\nYears of the Trees, through the First Age, until the Fourth Age. Tolkien\nhas written that Círdan would sail on the last ship into the West, as he\nis the Lord of the Grey Havens. So, it can thus be known that Círdan had\nthe longest incarnated single life span of any elf, having entered Arda\nduring the Years of the Trees and having left for Valinor later in the\nFourth Age than any other Elf.[1]\n\n\nBiography\n\nFirst Age\n\nAfter the Teleri Elves Arrive to Aman\n\nIn the First Age, Círdan was a ruler of a host of the Teleri under Elwë,\nand during the long wait in Beleriand he fell in love with the sea. When\nUlmo returned for the Teleri, Círdan and his followers remained behind,\npartially because of their love for Belegaer, and partially because of\nhis kinship with Elwë, who was lost. After Elwë returned and became King\nThingol, Círdan ruled the Falathrim of the havens of Eglarest and\nBrithombar, although he seemed to have accepted Thingol's overlordship.\nLater he became an advisor and friend of Finrod Felagund, Lord of\nNargothrond, although the Falas remained independent.\n\n[Círdan in a earlier age, by Szilvia Szarvas]\n\nWars of Beleriand\n\nCírdan was early on warned by Ulmo not to attempt a crossing to Valinor,\nand his mariners restricted their work to the coasts of Middle-earth.\nHowever, at the request of King Turgon of Gondolin, he later built\nseveral messenger ships to sail to Valinor to request help from the\nValar against Morgoth. All these missions failed, and only one survivor\never returned. After the havens of the Falas were destroyed by FA 474,\nCírdan was instrumental in setting up the refuges at the Mouths of\nSirion and the Isle of Balar, to which he retired for the remainder of\nthe age. It was on this isle that he built the great ship Vingilot for\nEärendil.[2][3]\n\nSecond Age\n\nIn the Second Age, Círdan stayed behind when the Elves were summoned to\nValinor, and set up the havens of Forlond, Harlond and Mithlond in the\ndestroyed land of Lindon (anciently Ossiriand). Círdan's exact status\nduring that time is unknown, but it seems certain he served as\nlieutenant of Gil-galad, the last High King of the Ñoldor of\nMiddle-earth. Círdan is mentioned as receiving the ships of the\nNúmenóreans as they returned to the north of Middle-earth, and also as\nbeing one of the only two elves (along with Elrond) who stood beside\nGil-galad during his last battle with Sauron.\n\nThird Age\n\n[Círdan (centre) receives Narya]\n\nFrom the Third Age onwards, after the fall of Gil-galad and the\nbeginning of the Age of Men, Círdan remained at the Grey Havens of\nMithlond where he was lord, and built ships which ferried the departing\nElves to Valinor. Círdan had possession of the one of the Three Elven\nRings, Narya, but when the Wizards or Istari arrived in the early Third\nAge he recognised Olórin's wisdom, and gave him his ring.\n\nCírdan remained active behind the scenes, sending counsellors to the\nWhite Council at Rivendell, but following the War of the Ring he was\nseen to have prepared the ship that ferried across the other\nRing-bearers: Gandalf, Elrond, Galadriel, Bilbo, and Frodo in the last\nyear of the Third Age. It is uncertain whether he left Middle-earth\nhimself on the same ship: he is not mentioned as boarding, and later\nletters by Tolkien imply he remained behind. There are contradictory\nreferences to the Fate of the Elves of Middle-earth scattered throughout\nTolkien's works, and it may be that Círdan's role as a facilitator for\nelves returning to the Blessed Realm continued for some time. There\nis one line that says that Círdan would remain until the last ship set\nsail for the west.\n\n\nCharacter\n\nCírdan had a beard, which was rare for Elves, and silver hair like\nThingol his overlord and kinsman. He was of great age at the time of the\nWar of the Ring: perhaps the oldest of the Telerin Elves or even of all\nthe elves remaining in Middle-earth. He may have been one of the elves\nwho awoke near Cuiviénen and therefore without a mother or father.\n\n\nEtymology\n\n_Círdan_ was a Sindarin word that meant 'Ship-maker', and the Quenya\nform was said to be _CIRYATAN_. His original name was probably _NOWË_,\nwhich may be related to the term _nowo_ meaning “think, form idea,\nimagine.”",
  "other_names": "Nowë (Q)\nCiryatan (Q)",
  "titles": "Lord of the Havens, Master of the Grey Havens, The Shipwright",
  "location": "Falas\nBalar\nLindon",
  "affiliation": "Last Alliance of Elves and Men",
  "language": "Quenya, Sindarin, Westron",
  "birth": "Between Y.T. 1050 and 1149\nMiddle-earth",
  "parentage": "Unknown (kinsman of Thingol and\nOlwë)",
  "gender": "Male",
  "height": "Very tall[2]",
  "hair_color": "Silver, bearded in old age",
  "other names": "Ringwraiths, the Black Riders, the Nine, <i>&#xDA;lairi</i> (<a href=\"/wiki/Quenya\" title=\"Quenya\">Q</a>)",
  "origins": "<a href=\"/wiki/Men\" title=\"Men\">Men</a> who received the <a href=\"/wiki/Nine_Rings\" title=\"Nine Rings\">Nine Rings</a>; corrupted by <a href=\"/wiki/Sauron\" title=\"Sauron\">Sauron</a>",
  "locations": "<a href=\"/wiki/Mordor\" title=\"Mordor\">Mordor</a>, <a href=\"/wiki/Angmar\" title=\"Angmar\">Angmar</a>, <a href=\"/wiki/Dol_Guldur\" title=\"Dol Guldur\">Dol Guldur</a>, <a href=\"/wiki/Minas_Morgul\" title=\"Minas Morgul\">Minas Morgul</a>",
  "languages": "<a href=\"/wiki/Black_Speech\" title=\"Black Speech\">Black Speech</a>, <a href=\"/wiki/Westron\" title=\"Westron\">Westron</a>",
  "members": "<a href=\"/wiki/Witch-king\" title=\"Witch-king\">Witch-king</a>, <a href=\"/wiki/Kham%C3%BBl\" title=\"Kham&#xFB;l\">Kham&#xFB;l</a>",
  "lifespan": "Indefinite",
  "distinctions": "Without physical form",
  "average height": "Man-high",
  "clothing": "Black robes",
  "weaponry": "<a href=\"/wiki/Morgul-knife\" title=\"Morgul-knife\">Morgul-knife</a>",
  "gallery": "<b><a href=\"/wiki/Category:Images_of_Nazg%C3%BBl\" title=\"Category:Images of Nazg&#xFB;l\">Images of Nazg&#xFB;l</a></b>"
}