[
  {
    "title": "Andwise Roper",
    "page_id": "84",
    "text": "ANDWISE ROPER also known as ANDY was a Hobbit of the Shire.\n\n\nHistory\n\nAndwise was the uncle of Samwise Gamgee. He was the first child of\nHobson Gamgee and Rowan Greenhand and was born in TA 2923 (SR 1323).\nAndwise had three younger siblings - Halfred, May and Hamfast (the\nfather of Sam). Andwise was commonly known as Andy and had a son named\nAnson, who was born in TA 2961.\n\nAndwise and his father, Hobson, were both rope-makers and owned a\nRope-walk in the village of Tighfield. When Hobson Gamgee died in TA\n2984, Andwise took over the rope-walk. He taught Samwise Gamgee some of\nhis knowledge of ropes."
  },
  {
    "title": "Aulë",
    "page_id": "35",
    "text": "AULË (Quenya; IPA: - “Invention”) was an Ainur, one of the Aratar and a\nValar, who was responsible for fashioning and crafting the substances of\nwhich Arda, the world, was composed. He was also called '''Mahal\n'''(Khuzdul; IPA: “Maker”), '''Oli '''(Sindarin; IPA: “Dream”) or\nNÁVATAR and delights in the nature of substances and in works of skill,\nbut not concerned with possession or mastery. Besides the shaping of\nArda, Aulë's greatest works were the Two Lamps of the Valar, the vessels\nof the Sun and Moon, and the Dwarves, whom he created out of impatience\nfor the Children of Ilúvatar. He also created Angainor (the chain of\nMelkor).\n\n\nBiography\n\nAs Aulë was a smith, he was the Valar most similar in thought and powers\nto Melkor, in that they each gloried in the fashioning of artful and\noriginal things. Both also came to create beings of their own. But while\nAulë strove to be true to the original intent of the Music of the\nAinurs, and submitted all that he did to the will of Ilúvatar, Melkor\nwished to control and subvert all things, and was jealous of the\ncreations of others so that he would try to twist or destroy all that\nthey made. There was long strife between Aulë and Melkor both before and\nafter the creation of Arda. Aulë, however, traditionally opposed\nattempts to fight Melkor, for fear of the damage that would be wrought\nto Arda.\n\nWhen the Elves came to Valinor, the Ñoldor became the students of Aulë.\nFëanor was his greatest pupil, and from him learned to make gems through\ncraftsmanship that is now forgotten. This would eventually lead to the\nSilmarils, the greatest creation of handiwork within Arda. On the Flight\nof the Noldor, the Noldor who returned to Valinor under Finarfin named\nthemselves the _Aulendur_, Followers of Aulë. Despite his lordly skill,\nAulë was humble and compassionate, and indeed the Dwarves survived only\nbecause Aulë submitted them to the will of Ilúvatar. His spouse was\nYavanna, with whom he dwelt in central Valinor.\n\nThe Creation of the Dwarves\n\n\n\nDesperate for pupils onto whom he could pass his knowledge, and\nunwilling to wait for the emergence of the Children of Ilúvatar, Aulë\ncreated his own race of beings, the dwarves. However, he did not have a\nclear idea of what the Children of Ilúvatar would be like, and because\nof the presence of the chaos caused by Melkor, Aulë made the Dwarves\nstrong and unyielding, and not willing to endure the domination of\nothers, as well as embodying some of his values and desires for\nMiddle-earth. However Aulë did not have the power to give independent\nlife to his creations, they could act only when his thought was on them.\n\nWhen Aulë completed his work he began to instruct the Dwarves in a\nlanguage he had made for them, Khuzdul. Then Ilúvatar spoke to Aulë,\nasking why he would seek to exceed his power and authority by attempting\nto make new life. Aulë repented, answering that the drive to create was\nkindled in him by Ilúvatar, and that he only wished for other beings to\nlove and teach, with whom to share in the beauty of the world. He\nadmitted that his impatience had driven him to folly and submitted his\ncreations to Ilúvatar. Assuming that they should be destroyed, he made\nto smite the seven Fathers of the Dwarves with a great hammer.  As he\nraised the hammer the Dwarves shrank from the coming blow, but Ilúvatar\nstayed Aulë's hand and showed that he had accepted Aulë's offer by\ngifting the Dwarves with spirits of their own, else they could not have\nbeen afraid.\n\nIlúvatar accepted the Dwarves as his adopted children however, as it was\nordained that the elves were to be the first-born race, Ilúvatar set the\nDwarves to sleep until after the Awakening of the Elves. He told Aulë\nthat while both were his children, their creation was outside the scope\nof the Music of the Ainur, and strife would arise between the Dwarven\nrace and the Elven race as the events of the world unfolded. The Dwarves\nbelieve that after they die their spirits move to halls that Aulë has\nset aside for them alone, and that their role will be to rebuild Arda\nafter the Final Battle.\n\n\nMaiar of Aulë\n\n-   Mairon (Sauron), the mightiest of the Maiar of Aulë who used his\n    knowledge of the metaphysical structure of Arda to great effect as a\n    servant of Melkor in the First Age of Middle-earth and then was his\n    own master in the Second and Third Ages. When Sauron sought to\n    corrupt the elves in the Second Age one of the names he assumed was\n    Aulendil, meaning devotee of Aulë.\n\n&nbsp;\n-   Curumo (Saruman), the leader of the wizards sent to lead the people\n    of Middle-earth against Sauron, only to betray his fellow wizards\n    and ally with Sauron himself (who he also betrayed in the end).\n\nIt is interesting to note that two of the greatest Maiar sent to\nMiddle-earth, that fell, were in the beginning both aligned with Aulë.\nThe reason for this is probably that this is the order most associated\nwith craft, skill, and by these means, power. Weaker-willed spirits\noften fall prey to craving for power in Tolkien's works, and these prove\nno exception. Also, Tolkien generally sees industry as corruption. It\nseems Maiar of Aulë are the most powerful Maia because they are the\nclosest to Ilúvatar's creation skills.\n\n\nPowers\n\nAulë seems to have a power most akin to Ilúvatar's - he can create an\ninnumerable amount of things. He made the Two Lamps, and made Angainor,\nMorgoth's chain. Although he does not have access to the Flame\nImperishable, he was able to create life (although it does not have free\nwill). As a Valar, he possesses incredible strength, and has been noted\nto have rebuilt Arda during and after Morgoth's period of destruction\nbefore the coming of the Elves. He likely forged the Valar's weaponry\nand armor for the War of Wrath. His strength is in the construction of\nnew things, and he is as near to the antithesis of the destructive\nMorgoth as one can be.﻿\n\n\nEtymology\n\n_Aulë_ means ''invention ''in Quenya.\n\n_Mahal_ means ''maker ''in Khuzdul.\n\n_Oli_ means _dream_ in Sindarin.",
    "other_names": "Mahal<br>N&#xE1;vatar<sup id=\"cite_ref-0\" class=\"reference\"><a href=\"#cite_note-0\">[1]</a></sup>",
    "titles": "The Smith",
    "birth": "Before the creation of <a href=\"/wiki/Arda\" title=\"Arda\">Arda</a>",
    "death": "<a href=\"/wiki/Immortality\" title=\"Immortality\">Immortal</a>",
    "spouse": "<a href=\"/wiki/Yavanna\" title=\"Yavanna\">Yavanna</a>",
    "weapon": "Powers of the Valar",
    "race": "<a href=\"/wiki/Ainur\" title=\"Ainur\">Ainur</a>",
    "gender": "Male",
    "culture": "<a href=\"/wiki/Valar\" title=\"Valar\">Valar</a> (<a href=\"/wiki/Aratar\" title=\"Aratar\">Aratar</a>)"
  },
  {
    "title": "Ancalagon",
    "page_id": "83",
    "text": "ANCALAGON, also known as ANCALAGON THE BLACK, was the greatest of all\nwinged dragons. He was bred by Morgoth during the First Age, and was the\nlargest dragon to have ever existed in Middle-earth.\n\n\nBiography\n\nAfter Eärendil made his journey to Valinor to convince the Valar to\noverthrow Morgoth and rescue the overmatched and defeated Elves and\nEdain, The Host of Valinor made war upon Morgoth and destroyed his\narmies. Facing final defeat, Morgoth unleashed his last and greatest\nweapon; a fleet of winged fire drakes, led by Ancalagon. So terrible was\ntheir onslaught that the armies of the Valar were driven back from the\ngates of Angband, and their coming was said to have been accompanied by\na tempest of fire and lightning. But Eärendil came out of the West in\nhis blessed ship Vingilot, accompanied by the Eagles of Manwë led by\nThorondor. The Eagles and Eärendil dueled with Ancalagon and the other\nDragons for an entire day. Eventually, Eärendil was victorious, casting\nAncalagon down upon Thangorodrim and destroying the volcanic mountains\nin his fall. The death of Ancalagon marked the end of Morgoth's final\nresistance.\n\nLater mentions\n\nGandalf spoke of him as he told Frodo the true origin of his Ring. “It\nhas been said that dragon-fire could melt and consume the Rings of\nPower, but there is not now any dragon left on earth in which the old\nfire is hot enough; nor was there ever any dragon, not even Ancalagon\nthe Black, who could have harmed the One Ring, the Ruling Ring, for that\nwas made by Sauron himself.”\n\n\nEtymology\n\nThe name _Ancalagon_ is Sindarin, meaning “Rushing Jaws” from _anca_\n(“jaws”) and the root _alak-_ (“rushing”).\n\nOther Names\n\nThe Middle English translation for _Ancalagon_ is ANDRACCA, from _and-_\n(“opposition”), _anda_ (“hatred, envy”), and _draca_ (“dragon”).\n\n\nCharacter\n\nAncalagon's size is not specified, but must have been colossal due to\nthe destruction of “the towers of Thangorodrim”, which are elsewhere\nidentified with the three smoking peaks of the mountain. He was however,\nsaid to be as big as a mountain. However, his size is never directly\nspecified and some powerful but small creatures are able to cause great\ndestruction even in death, such as Durin's Bane breaking the slopes of\nCelebdil. Like all other Urulóki, Ancalagon breathed fire, which was\nsaid to be hotter than any other dragon's flame.\n",
    "other_names": "Ancalagon the Black",
    "titles": "The Black One",
    "birth": "Possibly during the First Age",
    "death": "<a href=\"/wiki/FA_587\" title=\"FA 587\">FA 587</a><sup id=\"cite_ref-history_0-0\" class=\"reference\"><a href=\"#cite_note-history-0\">[1]</a></sup>",
    "weapon": "Fire, natural body weapons",
    "race": "<a href=\"/wiki/Dragons\" title=\"Dragons\">Dragons</a>",
    "gender": "Male",
    "height": "Not specified, &quot;As tall as a mountain&quot;",
    "culture": "<a href=\"/wiki/Fire-drakes\" title=\"Fire-drakes\">Fire-drakes</a> (Dragons of Morgoth)"
  },
  {
    "title": "Arod",
    "page_id": "87",
    "text": "AROD was a light horse (but restive and fiery) of Rohan.\n\n\nHistory\n\nAfter the loss of his original rider, Arod was given to Legolas by Éomer\nÉadig, in compensation for the supposed deaths of Merry and Pippin.\nLegolas ordered for his saddle and rein to be taken off, and rode him\nbareback with ease.\n\nAt one point in the story, Arod and Hasufel (the horse given to Aragorn\nby Éomer) are frightened away by an old man (assumed by the characters\nin the book to be Saruman). They later return to them, along with\nShadowfax, who has been summoned by Gandalf as his own horse. Arod\nlater accompanied Legolas on his way to Edoras.\n\nArod then carried his master though the Paths of the Dead despite his\nfear as they approached the Dark Door.\n\nAfter the War of the Ring, Legolas and Gimli continued to ride upon\nArod.\n\n\nEtymology\n\nIn Rohirric, AROD means “swift”. Coincidentally, there is a Sindarin\nword _Arod_ which means “noble”.\n",
    "name": "Arod",
    "owner": "Original owner died, given to <a href=\"/wiki/Legolas\" title=\"Legolas\">legolas</a>",
    "birth": "Unknown",
    "death": "Unknown",
    "race": "Horses",
    "gender": "Male",
    "culture": "Horses of Rohan",
    "eye_color": "Dark",
    "hair/fur_color": "White",
    "actor": "Played by a horse named Percy"
  },
  {
    "title": "Undying Lands",
    "page_id": "91",
    "text": "The UNDYING LANDS were a realm inhabited by Ainur and Eldar. The area\nincluded the continent of Aman and the island of Tol Eressëa. The ocean\nBelegaer separated the Undying Lands from the western shores of\nMiddle-earth. Only immortals and ring-bearers were allowed to live in\nthis realm.\n\n\nHistory\n\nEldar Days and Second Age\n\nOriginally, mortals were allowed to trade with those from Valinor in the\nUndying Lands, but were forbidden to sail west beyond the sight of\nNúmenor. However, in SA 3319 (Second Age), Sauron deceived Ar-Pharazôn,\nthe King of Númenor, that the ruler of the Undying Lands would be\ngranted immortality. To prevent the king's invasion, Ilúvatar destroyed\nNúmenor beneath the ocean and set the Undying Lands forever beyond the\nreach of mortal Men. Elves were still permitted to sail across the sea\nto the Undying Lands, if they chose to (which most did).\n\nThird Age\n\nIn TA 3021 (Third Age), Círdan the Shipwright accompanied Elrond,\nGaladriel, and Gandalf, the Keepers of the Rings, on a voyage to the\nUndying Lands, where they intended to remain. They were also joined by\nFrodo and Bilbo Baggins, Hobbits who were among the very few mortal\nbeings to be allowed passage to the Undying Lands.\n\nFourth Age\n\nEventually, Samwise Gamgee, another Hobbit of the Shire, and the Dwarf\nGimli along with his great friend Legolas made the journey to the\nUndying Lands. It is unknown how Manwë took to Gimli’s arrival, as he\nwould have killed Earendil for coming to Valinor uninvited and only\nspared him because he came on behalf of Elves and Men."
  },
  {
    "title": "The Fellowship of the Ring (group)",
    "page_id": "23",
    "text": "The FELLOWSHIP OF THE RING was formed as a brotherhood among members of\nthe various Free Peoples of Middle-earth. Its purpose was to take the\nOne Ring to Mordor that it might be cast into the fires of Mount Doom,\nthe mountain in which it was forged, so that it would be destroyed and\nultimately kill the Dark Lord Sauron.\n\nThe '''Fellowship '''was also known as the COMPANY OF THE RING, the NINE\nWALKERS, or more simply the COMPANY. Each of the members of the Company\nwere representatives of their respective races, with Legolas and Gimli\nbeing the only Elf and Dwarf chosen.\n\n\nHistory\n\nFormation\n\nFormed after the Council of Elrond, the Fellowship consisted of nine\nmembers: four Hobbits, two Men, one Elf, one Dwarf, and one Wizard. It\nis the only known organisation/group ever formed in the history of\nMiddle-earth, to hold members of each of these races within it (and with\nthe departure of the Elves and the Wizards from Middle-earth, there\nwould never be another like it), who largely lived and acted\nindependently of one another (or in the case of Elves and Dwarves, felt\nactive animosity toward each other). This number was chosen to match the\nnumber of Ring Wraiths, also known as Black Riders, the Nazgúl or the\nNine Riders. Merry and Pippin were never intended to be a part of the\nFellowship, with Elrond considering two Elf-lords from his own house. He\nwished to send the two younger hobbits back to the Shire as messengers\nto warn other Hobbits of the growing evil. However, the Halflings\npersevere: Merry is chosen and Gandalf convinces Elrond of the loyalty\nof Pippin.\n\n\n\nThe Fellowship of the Ring was formed by Elrond after the Council of\nElrond. The Fellowship, being led mainly by Gandalf, headed down the\npath to Mordor.\n\nAfter a long and difficult journey south from Rivendell, and a\nnear-catastrophic attempt to cross over the Misty Mountains, the\nFellowship descended into Moria. In the former Dwarf-kingdom, they found\nevidence that Orcs had slain Gimli's kinsman Balin and other Dwarves who\nhad returned there. They were soon confronted by the Balrog known as\n_Durin's Bane_, who had many Orc and Troll minions under his control.\nGandalf fell facing this menace, and the Company was forced to go on\nwithout him.\n\nOnce they escaped Moria, the Fellowship headed to the Elven forest of\nLothlórien where they spoke with the Elven Lord Celeborn and Galadriel,\nLady of Light. Galadriel supplied them each with special Elven Gifts\nfrom Lothlórien, boats and supplies so that they could travel down the\nriver Anduin. This route was quicker than an overland march, but the\ngroup was attacked by Orc archers and shadowed by Gollum, who had begun\nfollowing them in Moria.\n\nForced to portage their boats around the waterfall called Rauros, the\nFellowship soon ran into difficulties. Boromir finally succumbed to\ntemptation, and attempted to seize the Ring from Frodo. This led to\nFrodo using the Ring to escape and he and Sam leaving to spare the\nothers the lure of it. The repentant Boromir died trying to defend Merry\nand Pippin against a large force of Uruks from Isengard.\n\nThe Fellowship was dissolved on the banks of the Anduin that day. Frodo\nand Sam carried on towards Mordor; Boromir was given funerary rites and\nsent floating over the falls, and Aragorn, Legolas and Gimli departed on\ntheir way to save Merry and Pippin.\n\nBreaking of the Fellowship\n\nAfter Boromir died the Fellowship split into three paths. From there\nAragorn, Legolas and Gimli chased after the Uruk-hai who took Merry and\nPippin. Their plan was to take the hobbits to Saruman in Isengard. Along\nthe way the trio crossed through the Gap of Rohan and came across Éomer\nwho led the banished Riders of Rohan across the land. After questioning\nÉomer, they found out that the riders had already slain the Uruk-hai\nthey were meant to track, the night before in a bloody massacre. So upon\narriving to site of battle, Aragorn discovers that the hobbits fled deep\ninto Fangorn Forest.\n\nGandalf, though thought to be dead when he fell at the Bridge of Khazad\nDum in Moria, came back to Middle-earth, reincarnated as Gandalf the\nWhite. He encountered Aragorn, Legolas and Gimli in Fangorn, and they,\nmistaking Gandalf for Saruman, attempted to kill him. Gandalf assured\nthem that Merry and Pippin were safe (knowing they were in the hands of\nTreebeard). From there they rode out to Edoras, capital of Rohan. It was\nthere they saw King Theoden in ill-condition, poisoned by Saruman's\nservant Grima Wormtongue.\n\nFrodo and Sam continued their journey, getting closer to Mordor. Gollum\nhad tailed them. While attempting to take “the precious” in their sleep,\nFrodo and Sam awoke and captured him. Frodo realizing who he was decided\nGollum could be used as guide into Mordor.\n\nThe Second Fellowship\n\nIn the book, Aragorn continues to call the company he leads (Legolas and\nGimli, occasionally joined by Gandalf, Merry, and Pippin) the Fellowship\nof the Ring even after the original Fellowship breaks up following\nBoromir's death. The fellowship is reunited again after the War of The\nRing up until Rohan, where the fellowship ends.\n\n  Name      Age\n  --------- ----------------------\n  Frodo     50\n  Samwise   38\n  Merry     36\n  Pippin    28\n  Aragorn   87\n  Boromir   40\n  Legolas   2000+\n  Gimli     139\n  Gandalf   2000+ (Middle-Earth)\n\n  : AGES OF THE MEMBERS (TA 3018)\n\n\nMembers",
    "members": "<a href=\"/wiki/Gandalf\" title=\"Gandalf\">Gandalf</a>, <a href=\"/wiki/Frodo\" title=\"Frodo\" class=\"mw-redirect\">Frodo</a>, <a href=\"/wiki/Sam\" title=\"Sam\" class=\"mw-redirect\">Sam</a>, <a href=\"/wiki/Aragorn\" title=\"Aragorn\" class=\"mw-redirect\">Aragorn</a>, <a href=\"/wiki/Legolas\" title=\"Legolas\">Legolas</a>, <a href=\"/wiki/Gimli\" title=\"Gimli\">Gimli</a>, <a href=\"/wiki/Pippin\" title=\"Pippin\" class=\"mw-redirect\">Pippin</a>, <a href=\"/wiki/Merry\" title=\"Merry\" class=\"mw-redirect\">Merry</a>, and <a href=\"/wiki/Boromir\" title=\"Boromir\">Boromir</a>.",
    "purpose": "To take the <a href=\"/wiki/One_Ring\" title=\"One Ring\">One Ring</a> to Mordor, where it is to be &quot;cast into the fiery chasm from whence it came,&quot; in order for it to be destroyed and <a href=\"/wiki/Sauron\" title=\"Sauron\">Sauron</a>&apos;s power to come to an end.",
    "formed": "25 October, T.A. 3018",
    "dissolved": "26 February, T.A. 3019"
  },
  {
    "title": "Third Age",
    "page_id": "66",
    "text": "The THIRD AGE was the Age of Arda that lasted for 3021 years, from the\nfirst defeat of Sauron by the forces of the Last Alliance and the deaths\nof Elendil and Gil-galad, to the departure of Gandalf, Galadriel,\nElrond, Bilbo, and Frodo to the Undying Lands after Sauron's final\ndownfall during the War of the Ring."
  },
  {
    "title": "Guldur War Troll",
    "page_id": "36820",
    "text": "These Were giant armored war beasts (most likely Mountain Trolls) that\nparticipated in the Battle of the Five Armies, in The Hobbit: The Battle\nof the Five Armies.\n\n\nStatistics\n\nThese trolls were very large, dwarfing all the others seen previously,\n(about 25 feet tall or more) more importantly they were either fully or\npartially armored, unlike the smaller yet extremely similar Guldur\nOlog-Hai, which were fully armored but as stated above much smaller\n(about the size of a regular troll in the films) These trolls were\nfearsome weapons on the field and devastated dozens of soldiers with one\nstrike alone of their weapons.\n\nThese trolls were quite intelligent and kept formation with the orcs as\nthey marched to battle, in battle these trolls carried bladed axe/sword\nlike weapons upon their arms, (similar to the Guldur Orcs's shields)\nlong metal maces which could smash the very earth several feet into the\nair, taking down several men at once. Some even used their bare hands,\nballing them up into fists to smash the allied armies, or sweeping them\nup and throwing them like rag-dolls.\n\nThe less fortunate of these trolls were also hideously amputated by the\norcs, giving them morning star (wrecking ball-like) arms in place of\ntheir flesh and blood ones, some had metal hooks placed into their backs\nfor goblins to take hold of, and the most unfortunate was blinded and\ngiven reigns dangling from their eye sockets for orcs to directly take\ncontrol of.\n\nThese trolls were probably Mountain Trolls from Gundabad in the northern\nmisty mountains, this would explain their height, and color of their\nskin (being a peach like hue) instead of the darker blue cave troll skin\nor dark grey olog-hai skin.\n\nUnlike the smaller Guldur Olog's these trolls couldn't simply be taken\ndown by a spear throw to the neck or a few arrows. It would take dozens\nof arrows and several spears/pikes to be sent into the unarmored parts\nof the trolls in order to take them down. A premeditated attack upon a\ntroll would usually work and need to be planned out well in order to\ntake out the beast before it took down a whole garrison.\n\n\nHistory\n\nThese trolls were used primarily in Azog the Defiler's Dol-Guldur orc\narmy, directed to come out as soon as Azog called for the war beasts,\nalmost immediately these trolls smashed into the allied army, causing\nmassive damage, when some of the orc regiments made their way to the\nruins of dale, some of these trolls joined them, climbing over the walls\nor simply smashing them down to gain access. One of these trolls was\neven given a stone headpiece to act as a battering ram to the walls of\ndale. Most of these trolls survived until the end of the battle, still\nfighting on when the bats of gundabad arrived. But once the Eagles\narrived, the remaining trolls either fled into the Were -Worm tunnels,\nor were eventually taken down by the combined allied forces."
  },
  {
    "title": "Baldor",
    "page_id": "77",
    "text": "BALDOR also known as BALDOR THE HAPLESS, was the oldest son of Brego,\n2nd Lord of the Mark, and brother of Aldor, 3rd Lord of the Mark.\n\nHe was said to have passed along the Paths of the Dead, through the Dark\nDoor under Dwimorberg. Theoden said _“A rash vow he spoke, as he drained\nthe horn at the feast which Brego made to hallow new-built Meduseld, and\nhe never came to the high seat of which he was the heir”_.\n\nAfter passing through the Dark Door, Aragorn found _“...the bones of a\nmighty man. He had been clad in mail, and still his harness lay there\nwhole; for the cavern's air was as dry as dust, and his hauberk was\ngilded. His belt was of gold and garnets, and rich with gold was the\nhelm upon his bony head face downward on the floor. He had fallen near\nthe far wall of the cave, as now could be seen, and before him stood a\nstony door closed fast: his finger-bones were still clawing at the\ncracks. A notched and broken sword lay by him, as if he had hewn at the\nrock in his last despair. Aragorn did not touch him, but after gazing\nsilently for a while he rose and sighed. 'Hither shall the flowers of\nsimbelmynë come never unto world's end,' he murmured. 'Nine mounds and\nseven there are now green with grass, and through all the long years he\nhas lain at the door that he could not unlock. Whither does it lead? Why\nwould he pass? None shall ever know!'”_ This was, presumably, Baldor.\n\nIn an unfinished essay, Tolkien expanded upon Baldor's fate, stating\nthat he made it as far as the door (which led to an old temple built by\nmen who worshipped Sauron) before unknown enemies broke his legs,\nleaving him to die in the darkness.\n\nde:Baldor it:Baldor pl:Baldor ru:Балдор"
  },
  {
    "title": "Elendili",
    "page_id": "581",
    "text": "The Faithful_Elendili_' or ELF-FRIENDS are a faction of\n    Númenóreans who advocated continued friendship with the Elves. They\n    were also called the FAITHFUL for their continued devotion and\n    obedience to the Valar. Their most noted leader was Elendil, Lord of\n    Andúnië, who later founded the kingdoms of Arnor and Gondor in\n    Middle-earth.\n\nBy the close of the Second Age Númenóreans had become split between the\nElendili and the King's Men — a faction centered around the King that\nsought to assert Númenórean authority and self-determination. With\nNúmenor reaching the apex of its might, the King's Men eventually\nespoused open defiance of the Valar. This split would eventually\nprecipitate the Fall of Númenor.\n\nThe Elendili, however, not only preserved their ancient friendship with\nthe Elves, they also regarded the burgeoning arrogance of the King's Men\nas blasphemy. But the King's Men became more powerful, and by the end of\nthe Second Age had begun to persecute the Elendili as rebels and\ndissidents. Fearing their growing strength, the King's men secured the\nFaithful's deportation from their strongholds in the western regions,\nnotably around the city Andúnië.\n\nThe Elendili enjoyed a brief respite when Elf-friend Tar-Palantir\nassumed kingship and began to turn Númenor back to the ways of the\nFaithful. But after Tar-Panatir died, his nephew Ar-Pharazôn usurped the\nthrone and the Elendili were more vigorously oppressed, this time with\nthe help of the Dark Lord Sauron, who had established an evil cult on\nthe island to corrupt and eventually destroy Númenórean society.\n\nAs Ar-Pharazôn led his grand armada to Aman to challenge the Ban of the\nValar, Elendil and the remaining Elf-friends were warned by the divine\npowers to leave Númenor forever. They were thus spared the downfall of\nNúmenor when, as punishment for an attempt to defy the Ban, Ilúvatar\nsank the island kingdom into the sea.\n\nThe Elendili, under the leadership of Elendil and his sons, eventually\nmade their way to refuge in Middle-Earth where they were welcomed by the\nElves. There they established the Dúnedain kingdoms of Arnor and Gondor.",
    "name": "The Faithful",
    "other_names": "<i>Elendili</i>, <p>Elf-friends</p>",
    "origins": "<a href=\"/wiki/N%C3%BAmen%C3%B3r\" title=\"N&#xFA;men&#xF3;r\" class=\"mw-redirect\">N&#xFA;men&#xF3;r</a>",
    "leader(s)": "<a href=\"/wiki/Tar-Palantir\" title=\"Tar-Palantir\">Tar-Palantir</a><br><p><a href=\"/wiki/Amandil\" title=\"Amandil\">Amandil</a><br><a href=\"/wiki/Elendil\" title=\"Elendil\">Elendil</a><br><a href=\"/wiki/Isildur\" title=\"Isildur\">Isildur</a><br><a href=\"/wiki/Anarion\" title=\"Anarion\" class=\"mw-redirect\">Anarion</a><br></p>",
    "dominions": "<a href=\"/wiki/N%C3%BAmenor\" title=\"N&#xFA;menor\">N&#xFA;menor</a> (early)<br><a href=\"/wiki/Arnor\" title=\"Arnor\">Arnor</a> and <a href=\"/wiki/Gondor\" title=\"Gondor\">Gondor</a> (later)",
    "rivalries": "The <a href=\"/wiki/King%27s_Men\" title=\"King&apos;s Men\" class=\"mw-redirect\">King&apos;s Men</a>",
    "languages": "<a href=\"/wiki/Ad%C3%BBnaic\" title=\"Ad&#xFB;naic\">Ad&#xFB;naic</a>, <a href=\"/wiki/Westron\" title=\"Westron\">Westron</a>, <a href=\"/wiki/Sindarin\" title=\"Sindarin\">Sindarin</a>",
    "lifespan": "N&#xFA;men&#xF3;reans lived around 350 years while royal kindred lived 400 years <small>(formerly)</small><br><p>150-180 years of average except the Kings and Chieftains of the <a href=\"/wiki/D%C3%BAnadan\" title=\"D&#xFA;nadan\" class=\"mw-redirect\">D&#xFA;nadan</a> who had a considerably longer lifespan.</p>",
    "distinctions": "Mortality, Wisdom",
    "height": "Usually tall",
    "skin_color": "Fair",
    "hair_color": "Black, brown, blonde, grey or white (in later years)"
  },
  {
    "title": "Second Age",
    "page_id": "176",
    "text": "The SECOND AGE was the time-period of Arda that began after the\nclimactic banishment of Morgoth into the Void by the Lords of the West\n(the Valar), led by Eönwë, the Herald of Manwë.\n\n\nHistory\n\nThe Second Age lasted for 3441 years and ended with the downfall of\nSauron's army when he was defeated by the Last Alliance of Elves and Men\nfollowing the downfall of Númenor.\n\nThis age was characterized by the rise (eventually with increased\ninsolence) of Númenor, the rise of Sauron in Middle-earth, the creation\nof the Ringwraiths, and the early wars of the Rings between Sauron and\nthe Elves. The Ring of Power also came into existence during this\nperiod."
  },
  {
    "title": "First Age",
    "page_id": "179",
    "text": "The FIRST AGE began with the completion of Valinor, and ended with the\noverthrow of Morgoth. The First Age was also known as the ELDER DAYS.\n\nIt lasted about 3,000 Valian years, and each Valian year is the\nequivalent of 10 solar years.(making it the longest of the three Ages\ndescribed by Tolkien), and ended with the final overthrow of Morgoth by\nthe combined armies of Valinor and Beleriand.\n\n\n\nTolkien describes primarily the events that occurred in Beleriand. These\nwere centered on a series of wars waged by the Sindar, the Ñoldor and\nthe Three Houses of the Edain, against the power of Morgoth. The wars\nhad actually begun during the Years of the Trees, but began again with\nrenewed fury after the arrival of the Ñoldor in Beleriand. There had\nbeen Elves in Beleriand for uncounted millennia, but they sought merely\nto exist, and Morgoth had little to do with them. The Ñoldor, on the\nother hand, particularly the Sons of Fëanor, had come with the express\npurpose of defeating Morgoth.\n\nChief Battles of this Age\n\n-   The Dagor-nuin-Giliath, so named because it was fought before the\n    rising of the Sun) was fought soon after the arrival of the Ñoldor.\n    Morgoth sent a raiding party from Angband to attack the Ñoldor\n    encampment in Hithlum, but the elves drove it back. Fëanor was\n    killed. It is considered the second battle in the Wars of Beleriand,\n    after one that took place during the Years of the Trees.\n\n\n\n-   The Dagor Aglareb was fought about seventy-five years after the\n    return of the Ñoldor. Morgoth again attacked the Ñoldor, and (again)\n    with no success. The Ñoldor became so bold as to besiege Angband.\n    However, the Siege was of limited effectiveness, because the\n    northern side of Angband on the north side of the Ered Engrin, and\n    was unapproachable to the Elven forces.\n\n&nbsp;\n-   The Dagor Bragollach began when Morgoth poured rivers of fire out of\n    Angband, ruining the besieging Ñoldorin armies. The Ñoldor\n    eventually mustered a defense, but their losses were severe. For\n    instance, the green plain of Ard-galen had been permanently laid\n    waste by the rivers of fire, and was now called _Anfauglith_, the\n    Choking Dust; and the highlands of Dorthonion, which had been\n    inhabited by Edain, were made inhospitable.\n\n&nbsp;\n-   The Nirnaeth Arnoediad was the first battle to be started by the\n    Ñoldor for the purpose of ending the power of Morgoth. They massed\n    an army composed of Elves, Edain, and the Easterling houses of Bór\n    and Ulfang allied to the Sons of Fëanor. The Elves and their allies\n    came very close to Angband, but Morgoth's trickery had upset their\n    battle plan, and Ulfang proved to be treacherous. The name\n    “Unnumbered Tears” comes from the fact that the Elves' last hope of\n    victory was destroyed. The land of Hithlum was lost, the Sons of\n    Fëanor were largely scattered, and the free peoples of Beleriand had\n    been decimated. The forces of Morgoth made a heap of the Elven and\n    Mannish dead in the center of Anfauglith.\n\n&nbsp;\n-   The War of Wrath took place after Eärendil sailed to Valinor and\n    persuaded the Valar to help those whom they had forsaken. The Valar\n    gathered an army comprised of Maiar, Vanyar, and those Ñoldor who\n    had stayed in Valinor. The Teleri refused their aid, due to the\n    Kinslaying at Alqualondë, but consented to ferry the armies of the\n    Valar in their famous ships. This battle marked the first appearance\n    of the winged dragons, most notably Ancalagon the Black, but the\n    Valar had the day. Morgoth was captured, and cast out of Arda, but\n    his lands, as well as most of Beleriand, had been destroyed and sunk\n    under the sea in the heat of battle."
  },
  {
    "title": "Arnor",
    "page_id": "200",
    "text": "ARNOR, also known as the NORTHERN KINGDOM, was a kingdom of men located\nin the land of Eriador in Middle-earth. The name probably means “Land of\nthe King”, from Sindarin ARA- (high, kingly) + (N)DOR (land).\n\n\nHistory\n\nArnor was founded in SA 3320 by Elendil and sons who went on to found\nthe southern realm of Gondor. The history of the two kingdoms is\nintertwined; both kingdoms are known as the Realms of the Dúnedain in\nExile.\n\nBefore the foundation of Arnor there was already a sizable Númenórean\npopulation living there, a result of the slow emigration of Númenóreans\nwhich had started under Tar-Meneldur and Tar-Aldarion. Before the\narrival of the Dúnedain, Arnor was home to Middle Men of Edain stock,\nand the early colonists soon interbred with the indigenous population.\nArnor was originally favoured over the more southern regions (Gondor)\nbecause the Elves under Gil-galad lived near it across the river Lhûn.\nHowever, in later days after the Númenóreans fell under Sauron's shadow\nthey settled more to the south. This led to a situation where Elendil\narrived in an area populated by people who, unlike his own Númenóreans,\nwere mainly still friends with the Elves, and unlike Gondor to the south\nin Arnor much knowledge of the Elder Days was preserved.\n\nArnor's second king Isildur (also King of Gondor) was killed in TA 2 by\norcs in the disastrous Battle of the Gladden Fields. His three eldest\nsons were killed with him, but the fourth and youngest, Valandil,\nsurvived and became king of Arnor (TA 2 or 10?).\n\n\n\nBecause Valandil and his heirs did not claim the throne of Gondor the\nrealms were split, but Arnor's ruler kept the title High King, whereas\nin the south the ruler was just _King._ At its height, Arnor borders\nextended from the Ice-Bay of Forochel in the north, the river Greyflood\ndown to Belegaer in the south, the river Hoarwell in the east, and the\nriver Lune in the west. The capital city was Annúminas, and the realm\nincluded other cities such as Fornost, Tharbad, Lond Daer, and Tyrn\nGorthad.\n\nDecline\n\nHuman folly and the plots of a deathless evil had undone this dream.\nArnor was no more; divided into the three kingdoms of Arthedain,\nCardolan and Rhudaur, the Dúnedain of the North spent their strength in\nfoolish, petty wars and while corruption and ambition sapped their\nstrength, enemies gathered on their frontiers. Arnor's capital was\nAnnúminas on Lake Evendim, but by TA 861 Fornost Erain had become the\ncapital instead as Annúminas became depopulated.\n\nAfter the death of its tenth king, Eärendur, in 861, Arnor was shaken by\ncivil war between the three sons of Eärendur. The eldest son, Amlaith,\nclaimed Kingship over all Arnor but was reduced to only ruling the\nregion of Arthedain as his kingdom, while the other sons founded the\nkingdoms of Cardolan and Rhudaur.\n\nArnor was refounded in name by Arthedain's king Argeleb I, when Cardolan\nplaced itself under the suzerainty of Arthedain. However, even Arthedain\nwas eventually destroyed. The people of Arnor were mostly wiped out by\nthe wars, but the Hobbits survived in the Shire, men survived in Bree\nand probably other villages, and the Dúnedain of Arnor created new homes\nin the Angle south of Rivendell, where some of them became known as the\nRangers of the North.\n\nReunited Kingdom\n\nAragorn II as King Elessar refounded the Kingdom of Arnor as part of the\nReunited Kingdom, and made Annúminas his summer capital. After the fall\nof Sauron, Arnor was safe again for human population, and although it\nremained less populated than Gondor to the south, in time Arnor became a\nmore densely populated area again, even when it had dwindled in size due\nto the independence of the Shire.",
    "type": "<a href=\"/wiki/Kingdom\" title=\"Kingdom\">Kingdom</a>",
    "other_names": "North-kingdom",
    "location": "<a href=\"/wiki/Eriador\" title=\"Eriador\">Eriador</a>, except <a href=\"/wiki/Eregion\" title=\"Eregion\">Eregion</a>",
    "capital": "<a href=\"/wiki/Ann%C3%BAminas\" title=\"Ann&#xFA;minas\">Ann&#xFA;minas</a>,<br><a href=\"/wiki/Fornost\" title=\"Fornost\">Fornost</a> (later)",
    "regions": "<a href=\"/wiki/Arthedain\" title=\"Arthedain\">Arthedain</a>,<br><a href=\"/wiki/Cardolan\" title=\"Cardolan\">Cardolan</a>,<br><a href=\"/wiki/Rhudaur\" title=\"Rhudaur\">Rhudaur</a>",
    "description": "Founded after the <a href=\"/wiki/Akallab%C3%AAth\" title=\"Akallab&#xEA;th\">Fall of N&#xFA;menor</a>. Divided up and fell due feuding and <a href=\"/wiki/Angmar_War\" title=\"Angmar War\">war</a>.",
    "race": "<a href=\"/wiki/N%C3%BAmen%C3%B3reans\" title=\"N&#xFA;men&#xF3;reans\">N&#xFA;men&#xF3;reans</a><br><a href=\"/wiki/D%C3%BAnedain\" title=\"D&#xFA;nedain\">D&#xFA;nedain</a><br><a href=\"/wiki/Arnorians\" title=\"Arnorians\" class=\"mw-redirect\">Arnorians</a><br><a href=\"/wiki/Elves\" title=\"Elves\">Elves</a><br><a href=\"/wiki/Hobbits\" title=\"Hobbits\">Hobbits</a>",
    "spoken_languages": "<a href=\"/wiki/Westron\" title=\"Westron\">Westron</a>,<br><a href=\"/wiki/Hobbitish\" title=\"Hobbitish\">Hobbitish</a>,<br><a href=\"/wiki/Sindarin\" title=\"Sindarin\">Sindarin</a>",
    "governance": "<a href=\"/wiki/Kings_of_Arnor\" title=\"Kings of Arnor\">Kings of Arnor</a><br><a href=\"/wiki/King_of_the_Reunited_Kingdom\" title=\"King of the Reunited Kingdom\">King of the Reunited Kingdom</a>",
    "founded/built": "<a href=\"/wiki/SA_3320\" title=\"SA 3320\">SA 3320</a>",
    "lifespan": "<a href=\"/wiki/SA_3320\" title=\"SA 3320\">SA 3320</a> - <a href=\"/wiki/TA_861\" title=\"TA 861\">TA 861</a> (divided into three kingdoms), final remnant destroyed in <a href=\"/wiki/TA_1974\" title=\"TA 1974\">TA 1974</a>, reunited again in <a href=\"/wiki/FO_1\" title=\"FO 1\">FO 1</a>"
  },
  {
    "title": "Sindarin",
    "page_id": "160",
    "text": "SINDARIN was the Elvish language most commonly spoken in Middle-earth\nduring in the Third Age - in the real world it is universally referred\nto as, when not in canonical context, “ELVEN” or “ELVISH”.\n\nThe written alphabet of Sindarin, as with Quenya, is typically Tengwar\n(the Feanorian Characters), although Cirth (Runes) can also be used.\n\n\nHistory\n\n It was the language of the Sindar,\nthose Teleri who chose to stay behind on the Great Journey of the Elves.\nIt was derived from an earlier language called “Common Telerin”. When\nthe Ñoldor came back to Middle-earth, they adopted the Sindarin\nlanguage, for the Sindar were more numerous and slower to learn the\nlanguage of Valinor, Quenya the Noldor's native language. Later events\nled to the banning of the use of Quenya within and around Beleriand\nleading to it's eventual use as a high language of law. Before the\ndownfall, most of the Men of Númenor also spoke the language. Knowledge\nof it was kept in the Númenorean realm in exile Gondor, especially among\nthe learned. Dwarves, notably Durin's Folk, used Sindarin when\ncommunicating with Elves. Sindarin is the language referred to as _the\nElven-tongue_ in _The Lord of the Rings_.\n\nTolkien originally imagined that the language which would become\n_Sindarin_ was spoken by the Ñoldor (second clan of Elves). However he\nlater decided that it was the language of the Sindar. For this reason it\nis called _Noldorin_ in the older material, such as the Etymologies.\nWhen Noldorin became Sindarin, it also adopted some features of the\noriginally unrelated language _Ilkorin_. Tolkien based the sound and\nsome of the grammar of his Noldorin/Sindarin on Welsh, and Sindarin\ndisplays of the consonant mutations that characterise the Celtic\n(especially Brythonic) languages. The language was also probably\ninfluenced to an extent by the Germanic languages, as Tolkien was a\nscholar of both Old English and Old Norse.\n\n\nGrammar\n\nSindarin is mainly analytic, though traits of its highly inflected\nprogenitor can still be seen.\n\nPhonology\n\nSindarin was designed to have a Welsh-like phonology. It has most of the\nsame sounds and similar phonotactics.\n\n  -------- ----- -------------------------------------------------------------\n  LETTER   IPA   NOTES\n  a              \n  b              \n  c              \n  ch             The “ch” in the German word “Buch”, not as in “church”\n  d              \n  dh             The “th” in “heather”\n  e              \n  f              Represents  when final or before n,  everywhere else.\n  g              \n  h              \n  hw             \n  i              Represents  when initial,  everywhere else.\n  l              \n  lh       ɬ     The same as the Welsh LL.\n  m              \n  n              \n  ng             Represents  when final,  everywhere else.\n  o              \n  p              \n  ph             Represents  when final,  everywhere else.\n  r              \n  rh             \n  s              \n  t              \n  th             The “th” in “heath”\n  u              \n  v              \n  w              \n  y              Pronounced like German _ü_\n  -------- ----- -------------------------------------------------------------\n\nAn accent signifies a long vowel (á, é, etc.). In a monosyllabic word, a\ncircumflex is used (â, ê, etc.). However, for practical reasons, users\nof the ISO Latin-1 character set often substitute ý for ŷ.\n\nDiphthongs are _ai_ (pronounced like AIsle), _ei_ (dAY), _ui_ (tOO\nYoung), _au_ (cOW), and _oi_ (bOY). If the last diphthong finishes a\nword, it is spelt _aw_. There are also diphthongs _ae_ and _oe_ with no\nEnglish counterparts; Tolkien recommended to substitute _ai_ and _oi_\nrespectively if one does not care about details. If one does care, it is\nsimilar to pronouncing _a_ or _o_ respectively in the same syllable as\none pronounces an _e_ (as in pEt).\n\nIn archaic Sindarin, there was a vowel similar to German _ö_ (IPA: ),\nwhich Tolkien mostly transcribed as _œ_ (usually _not_ as _oe_ as is\noften found in publications like the Silmarillion, cf. _Nirnaeth\nArnoediad_ , _Goelydh_ ).\nThis vowel later came to be pronounced and is therefore transcribed as\nsuch .\n\nArchaic Sindarin also had a spirant _m_ or nasal _v_ (IPA: ), which was\ntranscribed as _mh_ (though always pronounced in later Sindarin).\n\nNouns\n\nPluralization\n\nSindarin plurals are characterised by _i-affection_, or _umlaut_. The\nSindarin term for this is _prestanneth_ (disturbance, affection). Almost\nall Sindarin words form their plurals like English man/men and\ngoose/geese — by changing the vowels in the word. The plural patterns\nare:\n\n-   In non-final syllables:\n    -   a > e — galadh > gelaidh\n    -   e > e — bereth > berith\n    -   i > i — dineth > dinith\n    -   o > e — gowest > gewist\n    -   u > y — tulus > tylys\n    -   y > y — (no example available)\n-   In final syllables:\n    -   a > ai — anar > enair\n    -   â > ai — tâl > tail\n    -   e > i — adaneth > edenith\n    -   ê > î — hên > hîn\n    -   i > i — brennil > brennil\n    -   î > î — dîs > dîs\n    -   o > y — brannon > brennyn\n    -   ó > ý — bór > býr\n    -   ô > ý — thôn > thýn\n    -   u > y — urug > yryg\n    -   û > ui — hû > hui\n    -   y > y — ylf > ylf\n    -   ý > ý — mýl > mýl\n    -   au > oe — naug > noeg\n\nNote that _ai_ can sometimes become _î_ (or, less commonly, _ý_).\n\nThe reason for this is that the primitive plural ending _-î_ (still\npresent in Quenya as _-i_) affected the vowels in the word by making\nthem higher and fronter. After this sound change occurred, the suffix\n_-î_ disappeared when all final vowels were lost.\n\nClass Plural\n\nSindarin also has several suffixes which denote a so-called class\nplural. For example, _-ath_ indicates a group of something, e. g.\n_elenath_ from elen (an archaic form of _êl_), meaning _star_ and\n_-ath_. It means _a group of stars_ or _all the stars in the sky_.\nAnother ending, _-rim_, is used to indicate a race, e. g. _nogothrim_\nfrom _nogoth_ — _dwarf_ and _-rim_, meaning _the race of dwarves_. The\nending _-hoth_ is generally used in an unfriendly sense, e. g.\n_gaurhoth_ from _gaur_ — _werewolf_ and _-hoth_, meaning\n_werewolf-host_.\n\nMutation\n\nSindarin has a complex series of mutations. There are three main\ndifferent types of mutations: _soft mutation_ (or lenition), _nasal\nmutation_ and _stop_ (occlusive) _mutation_. Additionally, a _mixed\nmutation_ is also observed after certain particles or prepositions.\nFinally, it is presumed that Sindarin also once had what we could call\nan _archaic spirantal mutation_ (also sometimes called _liquid mutation_\nby scholars). It is still uncertain whether this mutation is still\nproductive or if it only occurs in ancient constructs.\n\nInitial mutations must not be confused with assimilations that may occur\nin compound words (such as, for instance, in the names _Araphor_,\n_Arassuil_ and _Caradhras_).\n\nThe following table outlines how different consonants are affected by\nthe different mutations.\n\n  ------- ------ ------- ------- ------ --------\n  BASIC   SOFT   NASAL   MIXED   STOP   LIQUID\n  b       v      m       b       b      v\n  c       g      ch      g       ch     ch\n  d       dh     n       d       d      dh\n  g       '      ng      g       g      '\n  h       ch     ch      h       ch     ch\n  lh      thl    'l      'l      thl    'l\n  m       v      m       m       m      v\n  p       b      ph      b       b      ph\n  rh      thr    'r      'r      thr    'r\n  s       s      s       h       s      s\n  t       d      th      d       th     th\n  ------- ------ ------- ------- ------ --------\n\nHere the apostrophe indicates elision.\n\nWords beginning in _b-_, _d-_, or _g-_ which descend from older _mb-_,\n_nd-_, or _ng-_ are affected differently by the mutations:\n\n  ------- ------ ------- ------- ------ --------\n  BASIC   SOFT   NASAL   MIXED   STOP   LIQUID\n  b       m      mb      mb      mb     b\n  d       n      nd      nd      nd     d\n  g       ng     g       g       g      g\n  ------- ------ ------- ------- ------ --------\n\nTake, for example, the deictic article _i_, which triggers soft\nmutation. When added to a word like _tâl_, it becomes _i dâl_. In\nSindarin's phonological history, _t_ became _d_ in the middle of a word.\nBecause _i tâl_ at the time was considered one word, the _t_ became _d_,\nand thus _i dâl_. However, without the article the word is still _tâl_.\n\nMutation is triggered in various ways:\n\n-   Soft mutation, the most widely occurring mutation, is triggered by\n    the singular article _i_, the prefixes _athra-, ath-, go-, gwa-,\n    ú-,_ and _u-_, as well as the prepositions _ab, am, adel, be, dad,\n    di, na, nu,_ and _î_, and after _avo_. It also affects the second\n    element in a compound, an adjective following a noun, and the object\n    of a verb.\n\n&nbsp;\n-   Nasal mutation is triggered by the plural article _in_, and the\n    prepositions _an, dan,_ and plural _'nin_.\n\n&nbsp;\n-   Mixed mutation is triggered by the genitive article _en_, and the\n    prepositions _ben, erin, nan, 'nin,_ and _uin_.\n\n&nbsp;\n-   Stop mutation is triggered by the prepositions _ed, ned,_ and\n    _o(d)_.\n\n&nbsp;\n-   Liquid mutation is presumably triggered by the preposition _or_.\n\nPronouns\n\nPronouns are perhaps the most poorly attested feature of Sindarin. What\nhas been reconstructed by the comparative method is largely conjectural\nand is not agreed upon, and therefore will not be addressed in this\narticle.\n\nSindarin pronouns, like those in English, still maintain some case\ndistinction. Sindarin pronouns have nominative, accusative, genitive,\nand dative forms.\n\n \n\nFirst Person\n\nSecond Person\n\nThird Person\n\n \n\nSingular\n\nPlural\n\nSingular\n\nPlural\n\nSingular\n\nPlural\n\nNominative\n\nim\n\nme\n\nle, ci\n\nle, ci\n\ne, te\n\nti\n\nAccusative\n\nnin\n\nmen\n\nlen, cin\n\nlen, cin\n\nten, den\n\ntin, hain\n\nGenitive\n\n \n\nmín\n\n \n\nlín\n\ndîn\n\n \n\nDative\n\nanim, enni\n\nammen\n\n \n\n \n\n \n\n \n\nEnclitic\n\n-n\n\n-m\n\n-ch\n\n \n\n—\n\n-r\n\nVerbs\n\nSindarin verbs are also quite complex. The number of attested verbs in\nSindarin is small, so the Sindarin verb system is imperfectly known; no\nverb has a full paradigm of forms available. There are two main types of\nverbs: _basic_ and _derived_. Basic verbs have stems which end in a\nconsonant, and derived verbs have stems which incorporate some sort\nderivational morpheme (such as a causative ending) which ends in _-a_.\n\nBasic Verbs\n\nBasic verbs, though smaller in number than derived verbs, have a very\ncomplex conjugation which arises from Sindarin's phonological history.\n\nBasic verbs form the infinitve by adding _-i_: _giri_ from _gir-_. This\nending causes an _a_ or _o_ in the stem to umlaut to _e_: _blebi_ from\n_blab-_. Sindarin does not use infinitive forms very often, and rather\nuses the gerund to achieve the same meaning.\n\nFor all persons except the third person singular, the present tense is\nformed by the insertion of _-i_, and the proper enclitic pronomial\nending: _girin_, _girim_, _girir_. As with the infinitive, _-i_ causes\nan _a_ or _o_ in the stem to umlaut to _e_: _pedin_, _pedim_, _pedir_,\nfrom _pad-_. The third person singular, because it has a zero-ending,\ndoes not require the insertion of _-i_. This leaves the bare stem,\nwhich, because of Sindarin's phonological history, causes the vowel of\nthe stem to become long: _gîr_, _blâb_, _pâd_.\n\nThe past tense of basic verbs is very complicated and poorly attested.\nOne common reconstructed system is to use _-n_: _darn_. However, the\nonly time this _-n_ actually remains is after a stem in _-r_. After a\nstem ending in _-l_, _-n_ becomes _-ll_: _toll_. After _-b, -d, -g, -v,_\nor _-dh_, it is metathesized and then assimilated to the same place of\narticulation as the consonant it now follows. The consonant then\nexperiences what could be called a “backwards mutation”: _-b, -d,_ and\n_-g_ become _-p, -b,_ and _-c_, and _-v_ and _-dh_ become _-m_ and _-d_.\nThe matter is complicated even further when pronomial endings are added.\nBecause _-mp, -mb, -nt, -nd,_ and _-nc_ did not survive medially, they\nbecome _-mm-, -mm-, -nn-, -nn-,_ and _-ng_. In addition, past tense\nstems in _-m_ would have _-mm-_ before any pronomial endings. Because\nthis all may seem rather overwhelming, look at these examples which show\nstep-by-step transformations:\n\n-   _cab-_ > **_cabn_ > **_canb_ > **_camb_ > _camp_, becoming _camm-_\n    with any pronomial endings.\n-   _ped-_ > **_pedn_ > **_pend_ > _pent_, becoming _penn-_ with any\n    pronomial endings.\n-   _dag-_ > **_dagn_ > **_dang_ (_n_ pronounced as in _men_) > **_dang_\n    (_n_ pronounced as in _sing_) > _danc_, becoming _dang-_ with any\n    pronomial endings.\n-   _lav-_ > **_lavn_ > **_lanv_ > **_lanm_ > **_lamm_ > _lam_, becoming\n    _lamm-_ before any pronomial endings.\n-   _redh-_ > **_redhn_ > **_rendh_ > **_rend_ > _rend_, becoming\n    _renn-_ before any pronomial endings.\n\nThe future tense is formed by the addition of _-tha_. An _-i_ is also\ninserted between the stem and _-tha_, which again causes _a_ and _o_ to\numlaut to _e_. Endings for all persons except for the first person\nsingular can be added without any further modification: _giritham_,\n_blebithar_. The first person singular ending _-n_ causes the _-a_ in\n_-tha_ to become _-o_: _girithon_, _blebithon_, _pedithon_.\n\nThe imperative is formed with the addition of _-o_ to the stem: _giro!_,\n_pado!_, _blabo!_.\n\nDerived Verbs\n\nDerived verbs have a much less complex conjugation because they have a\nthematic vowel (usually _a_) which reduces the number of consonant\ncombinations which occur.\n\nThe infinitive is formed with -o, which replaces the -a of the stem, e.\ng. _lacho_ from _lacha-_.\n\nThe present tense is formed without modification to the stem. Pronomial\nendings are added without any change.\n\nThe past tense is formed with the ending _-nt_, which becomes _-nne_\nwith any pronomial endings, e. g. _erthant_, _erthanner_.\n\nThe future tense is formed with _-tha_. With the addition of the first\nperson singular _-n_, this becomes _-tho_.\n\nThe imperative is formed like the infinitive.\n\n\nDialects\n\nDuring the First Age there were several dialects of Sindarin:\n\n-   _Doriathrin_ or the language of Doriath, a form of the language\n    which preserved many archaic forms;\n-   _Falathrin_ or the language of the Falas, later also spoken in\n    Nargothrond;\n-   _North Sindarin_, the dialects originally spoken in Dorthonion and\n    Hithlum by the Sindar, these dialects contained many unique words\n    and were not fully intelligible with the Sindarin of Beleriand\n    proper.\n\nWith the exception of Doriathrin, the dialects were changed under\nÑoldorin influence, and adopted many Quenya features, as well as unique\nsound changes devised by the Ñoldor (who loved changing languages). The\ndistinct dialects disappeared after the Ñoldor and Sindar were dispersed\nduring the later Battles of Beleriand. In the refuges on the Isle of\nBalar and the Mouths of Sirion a new dialect arose under the refugees,\nwhich mainly took after Falathrin. During the Second Age and Third Age\nSindarin was a lingua franca for all Elves and their friends, until it\nwas displaced as the Common tongue by Westron, a descendant of Adûnaic\nwhich was heavily influenced by Sindarin.\n\n_Sindarin_ is actually a Quenya term. The Sindarin word was perhaps\nEDHELLEN (“Elvish”).\n\n\nSample Phrases\n\nIn _The Lord of the Rings_\n\n-   _Ai na vedui Dúnadan! Mae govannen!_ - Ah, at last, Westman! Well\n    met!\n-   _Noro lim._ - Run fast.\n-   _Annon edhellen, edro hi ammen! Fennas nogothrim, lasto beth\n    lammen!_ - Elvish gate open now for us; doorway of the Dwarf-folk\n    listen to the word of my tongue!\n-   _Mellon nîn!_ - My friend!\n-   _Ennyn Durin Aran Moria: pedo mellon a minno. Im Narvi hain echant:\n    Celebrimbor o Eregion teithant i thiw hin._ - “The Doors of Durin,\n    Lord of Moria. Speak, friend, and enter. I, Narvi, made them.\n    Celebrimbor of Hollin  drew these signs.”\n-   _Yrch!_ - Orcs!\n-   _Ónen i-Estel Edain, ú-chebin estel anim_ - I gave Hope to the\n    Dúnedain; I have kept no hope for myself.\n-   _Telin le thaed. Lasto beth nîn, tolo dan nan galad._ - I come to\n    help you. Listen to my word, come back to  light/radiance.\n\n\nSample Elements\n\n-   _aglar_ - radiance, glory\n-   _ar, ara-, aran_ - high, noble, king\n-   _aur_ - sunlight, daylight\n-   _celeb_ - silver\n-   _dúath_ - dark, black shadow\n-   _el_ - star\n-   _eryn_ - forest, wood of trees\n-   _estel_ - hope\n-   _galad_ - radiance\n-   galadh - tree\n-   _gond_ - stone\n-   _-ion_ - son (a male suffix)\n-   _mith_ - grey\n-   _nim_ - white\n-   _orn_ - tree\n-   _randir_- wanderer\n-   _ross_ - foam\n-   _taur_ - forest\n-   _tirith_ - guard\n-   _rond_ - dome\n-   _-wen_ - maiden (a feminine suffix)"
  },
  {
    "title": "Fourth Age",
    "page_id": "198",
    "text": "The FOURTH AGE was the time period that followed the War of the Ring. It\nwas an age of peace, and was also known as the “Age of Men”.\n\n\nHistory\n\nThe Fourth Age began after Sauron was vanquished and the One Ring was\ndestroyed. The Shire and the kingdoms of Arnor and Gondor were restored.\nIt marked the ascent of Men and the final diminishing of the Elves.\nGandalf, Elrond, Galadriel, Bilbo and Frodo sailed for the Undying\nLands.\n\nThe allies of Sauron suffered a devastating blow that would take them\ncenturies to recover, if they did at all. Harad was defeated and\nconcluded a peace with King Aragorn II Elessar, by which Umbar, whose\nfleet had been completely destroyed in the mouths of the Anduin, was\nreturned to Gondor, and South Gondor also annexed. The Easterlings also\nsuffered a terrible defeat as their Orc allies fled in terror from the\nBattle of the Black Gate. However, King Elessar, his descendants and\nallies such as King Éomer still on occasion warred with their enemies\nover land, particularly over the bitterly contested region of the Sea of\nRhûn. King Elessar died in FO 120 and was succeeded by his son Eldarion\nwho ruled until about FO 220. Of the kings of the Reunited Kingdom after\nhim, nothing is known.\n\nTolkien said that he thought the distance between the end of the Third\nAge and the 20th century A.D. was about 6000 years, and that 1958 should\nhave been around the end of the Fifth Age if the Fourth and Fifth Ages\nwere about the same length as the Second and Third Ages. He said,\nhowever, in a letter written in 1958 that he believed the Ages had\nquickened and that it was about the end of the Sixth Age or beginning of\nthe Seventh (this letter is referred to in the “Fourth Age” article of\n_The Encyclopedia of Arda,_ as mentioned below)."
  },
  {
    "title": "Valinor",
    "page_id": "202",
    "text": "VALINOR (Quenya; IPA: ; also\nVALINÓRË; ; meaning _Land of the Valar_), the Land_' across the Sea_',\nwas the realm of the Valar in Aman; the place to which they migrated\nafter being driven from Almaren by Melkor in times before the First Age.\nIt was also known as the Undying Lands as only immortal souls were\nallowed to reside there, with some exceptions when it came to the\nbearers of the One Ring; and additionally, even Gimli, who accompanied\nhis friend Legolas to these lands.\n\n\nLay of the land\n\nIts major city was Valmar, where the Vanyar and the Valar resided. Two\nother cities were Alqualondë and Tirion, the respective homes of the\nTeleri and the Noldor. It also had an island, Tol Eressëa, just off its\neast coast.\n\nValinor as explained was the home of the Valar, the Powers of\nMiddle-earth. The sea to the west of the island was called Ekkaia, or\nthe Encircling Sea; it surrounded both Valinor and Middle-earth.\n\nEach of the Valar had their own region of the land where they resided\nand altered things to their desire. Yavanna, the Vala of nature, growth,\nand harvest, resided in the Pastures of Yavanna in the south of the\nisland. Orome, the Vala of the hunt, lived in the Woods of Orome to the\nnorth-east of the pastures. The forest was home to many creatures which\nOrome could track and hunt. Nienna, the lonely Vala of sorrow and\nendurance lived cut off in the far west of the island in the Halls of\nNienna where she spent her days crying, looking out to sea. Just south\nof the Halls of Nienna and to the north of the pastures there were the\nHalls of Mandos. Mandos, the brother of Nienna, was the Vala of the\nafterlife. All inhabitants of Middle-earth went to the Halls of Mandos\nshould they happen to die, mortals and immortals alike (immortals could\nbe killed although they did not die of old age) although it was said\nthat in death as in life, they were separated. Also living in the Halls\nof Mandos was his spouse Vairë the weaver, who wove the threads of time.\n\nTo the east of the Halls of Mandos was the Isle of Estë, which was\nsituated in the middle of the lake of Lorellin which in turn was\nsituated to the north of the Gardens of Lórien (not to be confused with\nLothlórien in Middle-earth which was created by the same Valar, Lórien\nalso known as Irmo, the Vala of dreams). Este and Lórien being husband\nand wife lived close together. To the north of this were the Mansions of\nAule the smith Valar who was spouse to Yavanna. In the north-east lay\nthe Mansions of Manwe and Varda, the two most powerful Valar, also\nmarried. To the west of them stood the Trees of Valinor, Telperion and\nLaurelin. The entire great island of Valinor was surrounded on three\nsides (excluding the north which was instead protected by ices flows) by\na huge mountain range called the Pelóri mountains. In the extreme\nnorth-east, past the mountain range was the pass of Helcaraxë, a vast\nand treacherous ice sheet which in the beginning, before the fall of\nNúmenor, joined the two continents of Valinor and Middle-earth. In the\nbeginning, the Noldor, tricked by the evil Vala Melkor passed along this\npass to go back to Middle-earth, among those was Galadriel who was\nfeatured in the War of the Ring. Those who took this pass were not\nallowed back to Valinor for many years, but in the end pity was taken on\nthem when Middle-earth began to fade and pass into the age of men and\nthey were allowed to pass back to the Undying Lands of their own accord\nwhen they felt ready to do so.\n\nAlso, for a time after the exile of the Noldor and before the ruin of\nNúmenor, a long chain of small islands called the Enchanted Isles ran\nthe full length of the east coast to the continent. The enchanted\nislands and a bewildering shadow created the Shadowy Seas, which to\nprevent mariner, mortal or immortal, from reaching the land by sea (by\nthe Belegaer, the Great Sea which separated Middle-earth and Valinor.\nUntil the Changing of the World in the center of this sea was the isle\nof Númenor. This defence lasted centuries until Eärendil was guided\nthrough the Shadowy Seas by the light of the Silmaril brought on board\nby his wife Elwing. They sailed on Vingilot, said to be the fairest ship\never fashioned, constructed by Earendil and Cirdan the shipwright.\n\nAfter the destruction of Númenor and the Changing of the World, the\nUndying Lands were no longer a physical part of Arda so that Men could\nno longer sail to Aman or Tol Eressea. Only the Elves could sail there\nby the Straight Road and in ships capable of passing out of the Spheres\nof the earth.\n\nBy special permission of the Valar, the Hobbits Frodo Baggins, Bilbo\nBaggins, and Samwise Gamgee were also permitted to go to Valinor, and\nLegolas the elf brought with him Gimli the Dwarf.\n"
  },
  {
    "title": "Eriador",
    "page_id": "208",
    "text": "ERIADOR was a large region situated in northwestern Middle-earth. It was\nlocated between the Blue Mountains (to the west) and the Misty Mountains\n(to the east).\n\n\nDescription and Climate\n\nAccording to _The Atlas of Middle-earth_, Eriador was about six-hundred\nmiles (approximately 965.5 kilometers) from east to west. It was\nmostly lowlands. Hill areas were mainly in around the realms of Arnor,\nthe Shire in the center of the region and in the far eastern parts near\nthe Misty Mountains. Plains and bottomlands were in the south and\nsouthwestern parts. A plateau area existed in the area where Rivendell\nand the Trollshaws were located. Eriador was largely made up of\nscattered woodlands with scrublands in the north and northeastern parts.\nThe rest were short grasslands mainly in the center of the region.\n\nThe climate was mainly humid with relatively mild to cold winters with a\nconstantly warm and moist prevailing wind blowing over the Blue\nMountains. In the northern part, cold and dry prevailing winds blow down\nfrom the polar north influencing the climate as well.\n\nMost of the population was concentrated in the center area around Arnor\nand the Shire and the dominant language was Westron at least by the\nThird Age.\n\nIts boundaries were:\n\n-   To the east, the Misty Mountains.\n-   To the north, the Ice-Bay of Forochel, which flooded part of the\n    lands of Morgoth after the War of Wrath.\n-   To the west, the Blue Mountains.\n-   To the south, the river Greyflood and the land of Enedwaith. After\n    the War of Wrath, part of the southwestern border lies along the\n    shores of Belegaer.\n\nImportant rivers were the Lune (Elvish _Lhûn_), the Brandywine or\n_Baranduin_ in Elvish and the Greyflood.\n\n\nHistory\n\nIn the Second Age, and possibly much earlier, it was largely forested,\nbut Men cleared the land for farming and the massive old forests never\nrecovered. Much of it was encompassed in the early Third Age by the\nkingdom of Arnor, which later split into the rival kingdoms of Rhudaur,\nArthedain and Cardolan. The Shire occupies part of the former Kingdom of\nArthedain, while Bree and its neighbouring villages lie on the border\nwith the former Cardolan. The Barrow-wights dwell within ancient burial\nmounds constructed in the First Age by the Edain as they journeyed to\nBeleriand. Other important places in Eriador are Rivendell and the\nabandoned kingdoms of Eregion and Angmar.\n\nAt the beginning of the Second Age, large populations of both regular\nMen and Dúnedain inhabited the region. There was also a group of\nNoldorin exiles living in Eregion, near Moria and also located in the\nwestern most region of Eriador (and also in Middle-earth) was the High\nElven Kingdom of Lindon, once the greatest and mightiest kingdom of\nMiddle earth. Sauron's assault on the Elves of Eregion laid waste to\nthat land, and many of the Elves of the Lindon fell in the War of the\nLast Alliance.\n\nEven after his fall, Sauron's evil spirit acted through his agents, such\nas the Witch-king of Angmar, and he also concocted virulent plagues\nwhich swept over the land. Between warfare against the surviving\nDúnedain kingdoms, the plagues, and the general lawlessness sweeping\nover the land, the population dropped considerably. The Angmar War\nturned Eriador into a beautiful, but mostly wild and untamed land, and\nthe only concentration of Elves was either in the valley of Rivendell or\nLindon.\n\n\nEtymology\n\n_ERIADOR_ is a Sindarin word that meant 'Lonely land' or\n'Lone-lands'.",
    "type": "Region",
    "location": "North-western <a href=\"/wiki/Middle-earth\" title=\"Middle-earth\">Middle-earth</a>",
    "regions": "<a href=\"/wiki/Angmar\" title=\"Angmar\">Angmar</a><br><a href=\"/wiki/Arnor\" title=\"Arnor\">Arnor</a><br><a href=\"/wiki/Arthedain\" title=\"Arthedain\">Arthedain</a><br><a href=\"/wiki/Cardolan\" title=\"Cardolan\">Cardolan</a><br><a href=\"/wiki/Rhudaur\" title=\"Rhudaur\">Rhudaur</a><br><a href=\"/wiki/Eregion\" title=\"Eregion\">Eregion</a><br><a href=\"/wiki/The_Shire\" title=\"The Shire\" class=\"mw-redirect\">The Shire</a><br><a href=\"/wiki/Thorin%27s_Halls\" title=\"Thorin&apos;s Halls\">Thorin&apos;s Halls</a>",
    "description": "Known for being the early home for the <a href=\"/wiki/Nandor\" title=\"Nandor\">Nandor</a> Elves, various tribes of <a href=\"/wiki/Men\" title=\"Men\">Men</a>, and later the exiled <a href=\"/wiki/D%C3%BAnedain\" title=\"D&#xFA;nedain\">D&#xFA;nedain</a>, and the <a href=\"/wiki/Hobbits\" title=\"Hobbits\">Hobbits</a> of the <a href=\"/wiki/Shire\" title=\"Shire\">Shire</a>.",
    "race": "<a href=\"/wiki/Elves\" title=\"Elves\">Elves</a><br>Various tribes of <a href=\"/wiki/Men\" title=\"Men\">Men</a><br> D&#xFA;nedain<br><a href=\"/wiki/Hobbits\" title=\"Hobbits\">Hobbits</a>",
    "spoken_languages": "<a href=\"/wiki/Westron\" title=\"Westron\">Westron</a><br>Hobbitish",
    "lifespan": "After the <a href=\"/wiki/Years_of_the_Lamps\" title=\"Years of the Lamps\">Years of the Lamps</a> -<sup id=\"cite_ref-0\" class=\"reference\"><a href=\"#cite_note-0\">[1]</a></sup>"
  },
  {
    "title": "War of the Ring",
    "page_id": "209",
    "text": "The WAR OF THE RING was fought between Sauron and the free people of\nMiddle-earth for control of the One Ring and dominion over the\ncontinent. It took place at the end of the Third Age. Together with the\nQuest of Mount Doom, it is one of the overarching plot-lines of _The\nLord of the Rings_.\n\nThe war was initiated by Sauron, who had gained strength since the end\nof the Second Age and sought the One Ring. During the War of the Ring,\nmany thousands of Men of Rohan and Men of Gondor were killed. The\noverall number of combatants in the war is estimated to be over one\nmillion—tens of thousands from the side of the Free Peoples and hundreds\nof thousands from the Evil side. The war also signified the decline of\nthe Elves' power in Middle-earth, the rise of Men in the West, the\nrestoration of the King of Gondor and Arnor and the start of the Fourth\nAge.\n\nBattles were fought in Gondor, Rohan, Lórien, Mirkwood, at the Lonely\nMountain and at Dale. These were primarily waged against Sauron's\nforces, but Saruman, a third contender, also had armies, who fought\nbattles at the Fords of Isen and Helm's Deep.\n\nThe first full-scale battle fought in the war was the first Battle of\nthe Fords of Isen, and the war ended after the Battle of Bywater and,\nshortly afterwards, the deaths of Saruman and Gríma Wormtongue. Towards\nthe end of the War of the Ring, Elessar was crowned King of Gondor, and\nforgave the Men who had fought under Sauron, heralding a great renewal\nof cooperation and communication between Men, Elves, and Dwarves.\n\n\nOrigins of the War\n\nAccording to Mithrandir, the War of the Ring had begun at the\ntime Thorin Oakenshield met Bilbo Baggins in The Shire. Gandalf's\nreasoning is explained in the book _Unfinished Tales_. This is an\nexcerpt from a narrative of Gandalf to Frodo set in a house in Minas\nTirith. “_You may think that Rivendell was out of his reach, but I did\nnot think so. The state of things in the North was very bad. The Kingdom\nUnder the Mountain and the Strong Men of Dale were no more. To resist\nany force that Sauron might send North to regain Angmar were only the\nDwarves of the Iron Hills, and behind them lay desolation and a Dragon.\nThe Dragon Sauron might use with terrible effect._” That is why Gandalf\nthought that he had to get rid of Smaug, and he chanced upon Thorin and\nBilbo at different times, and saw the way to do it, which is told in\n_The Hobbit_.\n\nGandalf's role\n\nGandalf was to the Free Peoples of Middle-earth as a field marshal is to\nhis army fighting on the field—a master strategist and tactician. As\nseen in the opening stages of _The Fellowship of the Ring_ book and\nmovie, Gandalf the Grey would spend many hours, searching, scavenging,\nand sifting out archaic maps and accounts in long-hidden archives strewn\nabout Middle-earth. He would often carefully examine them, figuring out\nthe best way to defeat the Enemy and marshal as many allies as possible\nto his cause.\n\nGandalf likely spent much thought in strategy, before implementing his\nplans to maximum effect. He had been roaming Middle-earth for many years\nduring the Third Age, before Sauron's power was at its apex. He might\nhave had a 'hit list' of targets to neutralize that Sauron might use in\nthe next war upon the Free Peoples. One of these targets was Smaug, as\nseen in _The Hobbit._\n\nGandalf's adaptability and aptitude for strategy proved invaluable to\nhis allies during the complicated web that was to prove to become the\nWar of the Ring. As told in _Unfinished Tales_, Gandalf had known for\nquite a while that Sauron's use of Smaug would virtually guarantee\nvictory over his enemies, namely those of Gondor. He and his Dwarf\ncompanions thus set out to destroy Smaug, and bring the victory of the\nWar of the Ring one step closer for the Free Peoples.\n\nThe Roles of the other Istari\n\nSaruman became the secondary enemy in the War of the Ring, originally\nhaving served the Free Peoples and eventually succumbing to the power of\nthe One Ring.\n\nThe two Blue Wizards, Alatar and Pallando, also served an important role\nin the outcome of the war. Although they weren't directly mentioned in\nthe _Lord of the Rings_, they were enemies of Sauron, and might have\nused the Dark Elves and the Dwarves of the Red Mountains to weaken the\nEasterlings.\n\n\nEvents\n\nSouthern Theatre\n\nThe objective of Sauron's grand strategy was to defeat the strongest of\nthe nations that opposed him, Gondor, and to do so he would need to take\nthe capital city and greatest fortress of Gondor, Minas Tirith. To this\nend, the war effort of Mordor was focused in the south in and around\nGondor, in a strategy of divide and conquer. To keep Gondor's ally\nRohan, on its northern border, from sending aid, Sauron promoted the\nrise of Saruman at Isengard to the west of Rohan. Thus all of Rohan's\nforces would be focused in the west trying to stem the tide of the\nIsengard attack, and none would be sent to Minas Tirith's defence.\nMeanwhile, Sauron sent the Mordor-allied Corsairs of Umbar to attack\nGondor's populous southern coastal fiefs, which as a result sent only a\nfraction of their forces to defend Minas Tirith in northern Gondor,\nwhile the rest stayed on the coasts preparing for the Corsair assault.\nHowever, Sauron's divide and conquer strategy was ultimately foiled and\na united front of Gondor and Rohan's forces faced Mordor.\n\nRohan\n\nThe War of the Ring started in Rohan when Saruman's troops crossed the\nFords of Isen. Théodred, the son of the King Théoden, had mustered his\nforces on the fords in order to launch a surprise attack against the\nenemy. On February 23, 3019 he attacked the vanguard of the Orcs\nmarching out of Isengard. Reinforcements were quickly sent from Isengard\nhowever, and Théodred ordered a retreat. His forces retreated to an\nisland in the fords, but they were soon surrounded and he was killed.\nGrimbold managed to hold the island, but would not have succeeded if\nElfhelm had not come with reinforcements from Helm's Deep. Thus the\nfirst battle of the Fords of Isen ended in victory for the Rohirrim.\n\nNow that the Marshal of the Westmark was dead, Erkenbrand took command\nof the Westfold. He placed Grimbold and Elfhelm at the Fords. However,\nthey were unable to withstand the force of Isengard, and were\nsurrounded. Though they successfully broke through the enemy's lines,\nthey ended up scattered around the Westfold, giving Saruman clear\npassage into Rohan.\n\nMeanwhile, Gandalf drove Gríma Wormtongue out of Edoras and went to\ngather Erkenbrand's scattered forces, advising King Théoden to move to\nthe stronghold of Helm's Deep. The king and his forces arrived\nunmolested, but soon the fortress was surrounded by Saruman's troops.\nAll through the night of March 3rd-4th a combined force of Orcs and Wild\nMen from Dunland besieged Helm's Deep, and despite the efforts of the\nRohirrim (aided by Aragorn, Legolas and Gimli) hope appeared lost.\nBelieving Rohan was lost, Théoden decided to mount a final, suicidal\ncharge against Saruman's forces. Unexpectedly, however, Gandalf arrived\nin the nick of time with Erkenbrand and the scattered Rohirrim, along\nwith a forest of Huorns who had been sent to the battle by Treebeard.\nThe Orcs were trapped and utterly annihilated. The wild Men were taken\ncaptive, however, were freed after swearing an oath of loyalty to Rohan\nand clearing the battlefield of the dead. (The mercy of this act amazed\nthe captives, who had been told by Saruman that the men of Rohan were\ncruel and burned their captives alive.)\n\nDays before, at an Entmoot in Fangorn Forest, the Ents, furious over the\ndestruction Saruman had wrought upon the forest, decided to march on\nIsengard. They were to move up to Isengard and destroy it. By 3 March\nthe destruction was completed, and the command of Isengard was taken by\nthe Ent Treebeard. At Gandalf's request he sent a large herd of Huorns\nto the Battle of Hornburg, to aid the Rohirrim.\n\nGondor\n\nFor over 3000 years, the realm of Gondor had held back the threat from\nthe East. In time, the kingdom declined, and Sauron prepared to swoop in\nfor the kill. Faramir, captain of Gondor, had divided his forces to too\nmany fronts. The two most important of these were in the island citadel\nof Cair Andros and the ruined city of Osgiliath. In a strict sense, the\nWar of the Ring began with the Great Signal from Minas Morgul and the\nanswering signal from Mount Doom, and thus the attack on Osgiliath was\nthe first battle of the war proper. Sauron's two armies obliterated the\nfortresses, and Faramir was forced to retreat to the causeway forts, the\nlast defence against the Morgul forces. Soon these too were destroyed,\nand only Minas Tirith remained.\n\nThe attack soon began, as the Nazgûl hovered above and spread terror and\nconfusion, and siege towers tried to take the walls but were all\ndestroyed. After several repulsed attacks, the Gate of Minas Tirith was\nbroken, and the Lord of the Nazgûl entered. He was the first and only\nenemy to do so. All seemed lost — until six thousand Rohirrim, under\nKing Théoden's command, came and somewhat relieved Gondor's defenders.\nStill, the battle was in doubt until Aragorn arrived with a large force\nout of South Gondor. The joint force of Gondor and Rohan then\nsuccessfully defeated their enemies after an exhausting day of fighting.\nThis battle resulted in the deaths of the Witch-king of Angmar, King\nTheoden, and Denethor, Steward of Gondor.\n\nThe Battle of the Morannon was the final major battle against Sauron in\nthe War of the Ring, fought at the Black Gate of Mordor. The Army of the\nWest, roughly 6,000 strong, led by Aragorn marched on the gate and faced\na vastly larger force as a diversionary feint to distract Sauron's\nattention from Frodo and Sam, who were carrying the One Ring through\nMordor. It was hoped that Sauron would think Aragorn had the Ring and\nwas now trying to use it to overthrow Mordor. Despite the seemingly\nimpossible odds the Army of the West was eventually victorious, for when\nthe Ring was destroyed, Sauron's forces fled or surrendered in dismay.\n\nNorthern Theatre\n\nMordor's war effort was focused in the south against Gondor, but using\nhis outstretched right arm Sauron attempted to flank the lands of the\nFree Peoples through Rhovanion, using orcs and allied barbarian nations\nof Men. In this theatre of the war (which had spread far across\nMiddle-earth) Sauron's primary objective was to use the forces at his\nprimary base of operations in the area, Dol Guldur in southern Mirkwood,\nto defeat Lothlórien, then pass the Misty Mountains (attacking\nRivendell), and wheel around to take Rohan and Gondor from the rear.\nHowever, Dol Guldur had to deal with the threat of the Woodland Realm of\nThranduil, and thus split their forces between the attack on Lothlórien\nand the one on the Woodland Realm. Sauron wanted to use his barbarian\nEasterling allies in a joint attack with the Orcs from Dol Guldur on the\nWoodland Realm, and then have this victorious army link up with the\nother ones attacking Lothlórien and defeat it. However, unfortunately\nfor Sauron a strong and extremely powerful Dwarf nation now existed at\nthe Lonely Mountain thanks to the efforts of Gandalf, as well as the\nDwarves of the Iron Hills and allied Men of Dale. Mordor's Easterling\nallies were tied up fighting the Dwarves of Erebor and Men of Dale,and\nnever linked up with the Mordor forces assaulting the Woodland Realm,\nwhich in turn could not link up with those attacking Lothlórien, and the\nline held.\n\nBridging the gap between the northern and southern theatres of the war\nwas the line of the River Anduin between Lothlórien and Gondor, running\nalong the Rohan border. Orc armies peeling off from the assault on\nLothlórien tried to enter Rohan via this route, while almost its entire\narmy had left to fight at Minas Tirith, but the Ents of Fangorn forest\ncounterattacked and drove the orcs back in a panic, and most if not all\ndrowned while attempting to flee by crossing the river.\n\nDale and the Lonely Mountain\n\nWhen the war began, the Dwarves of Erebor\nrefused to cooperate with Sauron in his hunt for the Ring. And so Sauron\nsent an army of Easterlings to Dale. On March 17 they met the armies of\nthe Dwarves of Erebor (and of the Iron Hills as well) and the Men of\nDale. After three days of fighting, Men and Dwarves were overrun, Dale\nwas sacked and razed to ash (the second, possibly third, time in a\ncentury) and sought refuge in Erebor. The defenses of the Lonely\nMountain were prepared for the battle that would decide the fate of\nnorthern Middle-earth, and possibly even the War of the Ring itself.\n\nThe Easterlings hurled their full force at the allied armies, exploiting\ntheir dreaded heavy infantry force to punch a hole in the Dwarvish and\nMannish lines. A furious melee ensued, evolving into a tempest of fire,\ndead and dying men, and the flash of steel. Both sides took horrendous\nlosses, the Easterlings from the arrows, spears, and rocks cast from the\nLonely Mountain's cliffs, and the Men and Dwarves from the scimitars and\nmaces of the Easterlings. Finally, King Brand of Dale fell before the\ngate of the Lonely Mountain, and King under the Mountain Dáin II\nIronfoot fell as he was defending Brand's body.\n\nThe Dwarves of Erebor had learnt a crucial lesson from the devastation\nof Smaug and the Battle of the Five Armies nearly a century earlier, a\nlesson bought with the blood of loved ones. They fortified all of the\nsides of the Lonely Mountain, preventing the breakthrough of orcs that\nnearly caused the loss of the Battle in the days of Bilbo Baggins and\nThorin Oakenshield. The defenders knew with grim fatalism that there\nwould be no Beorn and no Eagles to save them this time, and they were\nthus determined to fight to the last. The Lonely Mountain was staged to\nbecome the Minas Tirith of the North, a ruthless battle of the will of\nthe defender and the will of the aggressor.\n\nThe invaders from the east constructed siege works, battering rams, and\nassorted siege catapults to bombard their enemies into submission.\nHowever, despite all of their efforts, the great gates of the Lonely\nMountain withstood the tidal wave of invaders from the East. Many Men\nand Dwarves made their escape to Erebor however and were able to\nwithstand the siege of the mountain fastness. When news spread about the\nvictory in the South, the Easterlings became extremely demoralized and\nproceeded to scatter, while the sons of Brand and Dáin let their army\nout of Erebor to break the encirclement.\n\nLothlórien and Mirkwood\n\nOn March 11, Lothlórien was first attacked from Dol Guldur. It was\nattacked two further times, on the 15 and the 22. When the Dark Lord had\nfallen, Celeborn led his army out of Lóerin, and crossed the Anduin. Dol\nGuldur was captured and destroyed by Galadriel.\n\nThranduil of Mirkwood was also attacked from Dol Guldur on March 15\nresulting in the long Battle Under the Trees, in which Thranduil's\nkinfolk won a hard victory. After the destruction of Dol Guldur,\nCeleborn met Thranduil on April 6, and as the shadow had passed, they\ndivided Mirkwood and renamed it Eryn Lasgalen.\n\nThe Shire\n\nAfter the defeat of the Dark Lord, Saruman used the magic of his voice\nto convince Treebeard to release him from Isengard. He travellled to the\nShire, where he replaced Lotho Sackville-Baggins as the Chief under the\nname _Sharkey_. Under his command Ruffian men entered The Shire and\nruined it. They were defeated by Hobbits under the lead of Meriadoc\nBrandybuck and Peregrin Took in the Battle of Bywater on the 3rd of\nNovember. The Hobbits headed to Hobbiton where Frodo ordered Saruman and\nWormtongue to leave the Shire. Wormtongue, however, killed Saruman,\nbefore he himself was killed by the Hobbits and their arrows. With the\ndeath of the wizard Saruman, the War of the Ring finally ended, as did\nthen the Third Age.\n\n\nConsequences and Legacy\n\nThe War of the Ring had great influence on all of the lands of the\nnorthwest of Middle-earth. Most importantly it led to the restoration of\nthe Kingdoms of Arnor and Gondor as the Reunited Kingdom, under King\nElessar Telcontar. The Steward of Gondor was dead, but he was succeeded\nby his son Faramir, who kept the office and was given the title _Prince\nof Ithilien_.\n\nIn Rohan the heir apparent, Théodred, was killed, and, during the Battle\nof Pelennor Fields, King Théoden died as well. He was succeeded by his\nnephew Éomer. In the Glittering Caves at the Hornburg, a Dwarven colony\nwas established, and Isengard was given to the Ents, who filled\nSaruman's pits and reforested the land, renaming it The Treegarth of\nOrthanc\n\nIn Dale, both King Brand and King Dáin II Ironfoot were killed, who were\nsucceeded by their sons Bard and Thorin III Stonehelm. They sent their\nemissaries to the crowning of Elessar, and were in alliance with Gondor\nuntil their Kingdoms ended.\n\nFor the Elves, the final decline had begun. With the destruction of the\nOne Ring, the power of the Three Rings faded, and the kingdoms that had\nbeen preserved by their magic began to fade with them. The bearers of\nthe Rings left Middle-earth, and Lórien was eventually abandoned. The\nElves of Lothlórien who did not depart over the Sea moved east to the\nsouthern third of Mirkwood, below the Narrows, which they named East\nLórien. In Eryn Lasgalen however, Thranduil's rule continued, and they\nhad peace. There was also an Elven colony in Ithilien. Many of the Elves\nof Rivendell departed over the Sea, and by Aragorn's death 120 years\nlater, it was entirely deserted.\n\nIn the Shire life continued as it had prior to the war. It was declared\na free land under the Sceptre of Annúminas, and Men were forbidden to\nenter it. The Westmarch was added to the Shire by King Elessar in SR\n1452.\n\nThe different races of Men that had served Sauron suffered grievously at\nthe hands of what appeared to be booty and loot just begging them to\ncome; much of Harad's army was annihilated on the Pelennor Fields,\nslaughtered by the swords of Gondor and the lances of Rohan. The mighty\nEasterlings hastily retreated back to their homelands after Sauron's\nfall and fought several territorial wars with King Elessar over lands\nnear the Sea of Rhûn, but ceased to be a threat altogether. While they\nwere still a menace, much like a sleeping viper, they never troubled the\nReunited Kingdom again.\n\nOnce the Fourth Age began, the elves stopped having an active influence\non the affairs of Middle-earth, having started fading away ever since\nthe Third Age. Orcs never became a serious threat again, reduced to\nsmall bands of mountain brigands they were never more than a nuisance.\nAll the Nazgûl were killed, with Sauron reduced to a mere shadow of\nmalice. Wars would still be fought by the Reunited Kingdom and Rohan\nagainst the Men that had allied with Sauron, the Haradrim and\nEasterlings."
  },
  {
    "title": "Gondor",
    "page_id": "163",
    "text": "GONDOR was the prominent kingdom of Men in Middle-earth, bordered by\nRohan to the north, Harad to the south, the cape of Andrast and the Sea\nto the west, and Mordor to the east. Its first capital was Osgiliath,\nmoved to Minas Tirith in TA 1640. The city of Minas Tirith remained the\ncapital of Gondor for the rest of the Third Age and into years of the\nFourth Age; other major fortresses include Dol Amroth in Belfalas and\nOsgiliath, which was a city on the Anduin.\n\nGondor was founded by the brothers Isildur and Anárion, exiles from\nNúmenor. Gondor was an allied kingdom with Arnor, whose line of king\nchieftains came from Isildur, while the Line of the Kings of Gondor was\nfrom Anárion. Gondor was at the height of its power in its early years\ndue to the ships and the military might that its armies possessed.\nHowever, continued attacks by allies of Sauron, civil war, and a\ndevastating plague caused it to gradually decline over the course of the\nThird Age until Sauron's final defeat and the crowning of Aragorn II\nElessar. Following that time the power of Gondor once again expanded,\nuntil the former lands of Arnor were brought under the banner of the\nReunited Kingdom. \n\nIn all, there were thirty-one kings of Gondor after Anárion, who was\nslain before Barad-dûr at the Siege of Barad-dûr. \n\n\nHistory\n\nLike Arnor to the north, Gondor was a Mannish kingdom founded by\nAnárion, the youngest son of Elendil, after the Downfall of Númenor. It\nwas located to the South of Rohan and to the West of Mordor, on the Bay\nof Belfalas.\n\nEarly years\n\n Before the Downfall of Númenor,\nGondor was home to many Númenórean colonists, who either mixed blood\nwith the indigenous Middle Men if they were friendly, or dispersed them\ninto Ras Morthil, Dunland, and Drúadan Forest. Gondor, at a latitude\ncomparable to Venice, was a more fertile region than Arnor to the north,\nand therefore it already had a larger population before the ships of\nElendil's sons arrived, including a well-established city, Pelargir.\n\nThe Faithful or Elendili from Númenor were given a warm reception upon\ntheir arrival by those that had already colonized Middle-earth,\nincluding a colonial branch of Númenorean royalty at Dor-en-Ernil. The\ncolonists north of Anduin accepted Elendil's claim to kingship over\nthem. South of the Great River, however, the newly exiled Númenoreans\ndid not recognize Elendil's claim.\n\nGondor was being founded after Númenor's population had already split\nbetween The Faithful and King's Men, and all of the more southern\ncolonies (such as Umbar) remained enemies of The Faithful.\n\nThe newly founded kingdom of Gondor was then part of the Last Alliance\nof Elves and Men which overthrew Sauron for the first time at the very\nend of the Second Age, and when Isildur cut the finger of Sauron.\n\nGondor Prospers\n\nAfter the war, Gondor's power and wealth grew steadily (only interrupted\nby an Easterling invasion in TA 492). Its power would continue to grow\ninto the 9th century Third Age. While the power of Gondor's sister\nkingdom Arnor peaked during the 9th century, when it broke into various\nsuccessor states, Gondor's greatest glory was yet to come. Gondor's\ngreat cities Minas Anor, Minas Ithil, Osgiliath and Pelargir only grew\nand the Dunedain of Gondor started to rule over more and more of the\nlesser people.\n\nGondor's Golden Age\n\n\n\nGondor's power reached its Golden Age under the four “Ship-kings”:\n\n-   Tarannon Falastur r. TA 830 – TA 913. First of the Ship-Kings, died\n    childless\n-   Eärnil I r. TA 913 – TA 936. Nephew of Tarannon\n-   Ciryandil r. TA 936 – TA 1015\n-   Hyarmendacil I (Ciryaher) r. TA 1015 - TA 1149. Last of the\n    Ship-Kings. In the reign of the powerful king, Hyarmendacil I (c.\n    12th century TA) Gondor reached the height of its power. During\n    Hyarmendacil's reign, Gondor's borders reached their furthest\n    extent. The Kingdom extended east to the Sea of Rhûn, south to the\n    nearest lands of the Haradrim, as far north as Mirkwood, and west\n    towards the borders of Arnor.\n\nSuch was Gondor's wealth during the period that men from other lands\nwould say in envy: “In Gondor precious stones are but pebbles for the\nchildren to play with.” Gondor would also enjoy several centuries of\npeace due to its military might.\n\n\n\nThe Decline of Gondor\n\nHowever, after decadence spread under the Kings of Gondor and a long\nperiod of decline began (although Gondor experienced several revivals).\nThree great calamities struck Gondor during the second millennium of the\nThird Age, which are held to be the chief reasons for its decline: the\nKin-strife, the Great Plague, and the invasion of the Wainriders (a\ntribe of Easterlings).\n\nThe Kin-strife\n\nIn the 15th century TA a great civil war named the Kin-strife tore the\nnation apart. The current King Eldacar was of mixed blood: his mother\nwas of the Northmen. Popular displeasure at this led to the overthrow of\nKing Eldacar by Castamir, the admiral of all of Gondor's naval forces\nwho possessed some royal blood. Eldacar's son was slain, and he fled\nnorth. Castamir was afterwards known as Castamir the Usurper. During his\nten-year rule, he proved to be very cruel, and because of his love of\nhis old fleet, he lavished attention on the coastal regions while the\ninterior provinces were ignored and left to rot. Eldacar then returned\nwith an army of his Northman kinsmen, and the armies of the Men of\nGondor joined them from interior provinces such as Anórien. Osgiliath\nwas devastated during this conflict, its great bridge destroyed and its\n_Palantír_ lost. Eldacar slew Castamir and reclaimed his throne, but\nCastamir's sons and their forces were besieged in Pelargir, the great\nport of Gondor. They eventually retreated to Umbar, where they joined\nwith the Corsairs, and troubled Gondor for many years, until their\ndescendants died out.\n\nThe Great Plague\n\nLater, the Great Plague struck and the White Tree died. This Plague was\nno localized event: the Plague swept through all of Middle-earth,\nreaching the successor states of Arnor and the Hobbits of the Shire in\nthe North. King Tarondor found a sapling of the White Tree, and moved\nthe capital from Osgiliath to Minas Anor, the City of Anárion. During\nthis time, Gondor was so depopulated that the fortifications guarding\nagainst the re-entry of evil into Mordor were abandoned. It is believed\nthat had the Haradrim or Easterlings been capable of attacking Gondor at\nthis time, it would have fallen. However, the Plague left Gondor's\nenemies in no better condition than Gondor itself, and neither side was\ncapable of mounting new offensives.\n\nThe Invasion of the Wainriders\n\nFollowing the sapping of Gondor's strength by the plague, it did recover\nbut then the Wainrider (Easterlings) invaded and devastated Gondor, and\nthe conflict lasted for almost a century. The Wainriders destroyed the\nNorthern Army of Gondor, but survivors linked up with the victorious\nSouthern Army of Gondor which destroyed the Haradrim as they crossed the\nriver Poros, led by a general named Eärnil, and they destroyed the\nWainriders as they celebrated their victory during the Battle of the\nCamp.\n\nThe Line of the Kings Fails\n\nReunification Rejected\n\nIn TA 1944 Gondor faced a succession crisis when King Ondoher was slain\nin battle with both his sons. Arvedui, Prince of Arthedain, Ondoher's\nson-in-law, and the victorious general Eärnil, who was a distant\nblood-relative of Ondoher, claimed the throne. Arvedui's claim lay\nmainly in the reintroduction of the old Nùmenorean law of accession,\nwhich stated the eldest (remaining) child should succeed the king. If\nthe law was reintroduced, then Arvedui's wife Fíriel, Ondoher's daughter\nand last remaining child, would become Ruling-Queen, making their\ndescendants Kings of both Arnor and Gondor. Arvedui also tried to put\nweight behind his claim, as he was Isildur's heir. The council of Gondor\nrecognised that the name of Isildur was held in honour in Gondor, but\nthey dictated that the South-Kingdom must be ruled by an Heir of\nAnarion. Due to his ancestry from Fíriel and Arvedui, more than a\nmillennium later, Aragorn Elessar put forward his claim as the heir of\nboth Isildur and Anarion.\n\nEärnil laid his claim as being a direct descendant of King Telumehtar\nUmbardacil. His claim was also greatly bolstered by the popularity he\nhad gained as the victorious general who saved Gondor from the\nWainriders after winning the southern theatre of the war. Steward\nPelendur who was temporarily ruling Gondor as serving as arbiter of\nsuccession, intervened in favour of Gondor's victorious general who\nwould rule as Eärnil II.\n\nThe Last Heir of Anárion\n\nDuring the Battle of Fornost, Eärnil II's heir Eärnur led Gondor's\nforces to victory over the Witch-king of Angmar, who was actually the\nLord of the Nazgûl. Although Eärnur wished to fight him, Eärnur's horse\nwas terrified and fled the battle against his wishes. By the time, he\nmastered his horse and returned the Witch-king had fled. Glorfindel the\nElf then prophesied to him that it was better that he not fight the Lord\nof the Nazgûl because “never by the hand of man shall he fall”.\n\nEärnur later ascended to the throne, ruling from Minas Anor (“Tower of\nthe Sun”). During this time, the Ringwraiths captured the city of Minas\nIthil (“Tower of the Moon”), renaming it _Minas Morgul_ (“Tower of Dark\nSorcery”) and taking it as their lair. Minas Anor was renamed _Minas\nTirith_ (Tower of Guard) as a result. The Lord of the Nazgûl repeatedly\nsent messengers to Minas Tirith challenging Eärnur to single combat,\ntaunting him that he had fled out of cowardice from facing him during\nthe Battle of Fornost. Eventually, King Eärnur was overcome by wrath and\nrode with a small company of knights to Minas Morgul, to accept the\nchallenge. They were never heard from again; and so ended the Line of\nAnárion.\n\nThe Stewards of Gondor\n\nThe Ruling Stewards\n\nA long line of hereditary Stewards governed the realm after the\ndisappearance of Eärnur, son of Eärnil, since there was no proof that\nthe last king was dead, and no claimant had enough support to be\naccepted as his successor. The line of Anárion was held to have failed,\nand Gondor was not willing to risk to another Kin-strife, which would\nsurely have destroyed it. Whenever there was a new Steward, he would\nswear an oath to yield rule of Gondor back to the King, in essence only\nan heir of Isildur, if he should ever return. In Gondor, there was no\none who could claim descent from Isildur in direct line, and the\nnorthern line of Arnor had effectively disappeared, so this oath was not\nconsidered seriously. The line of Stewards ruled as Kings, without\nhaving the title. During the War of the Ring, the ruling Steward of\nGondor was Denethor II, and his two sons were Boromir and younger\nFaramir- the latter being the last Ruling Steward of Gondor.\n\nCirion and Eorl\n\nIn TA 2510 when Steward Cirion ruled over Gondor, the nation faced one\nof its greatest perils: an Easterling tribe named the _Balchoth_ invaded\nGondor with mass force. Gondor's army marched to fight the Balchoth but\nwere cut off from Minas Tirith and pushed back in the direction of the\nLimlight.\n\nMessengers were sent to get help from the Éothéod, a tribe, which lived\nin the northern vales of the Anduin, but nobody expected the messengers\nto reach their destination. When certain peril came upon Gondor,\nhowever, the Éothéod turned the tide of the Battle of the Field of\nCelebrant. After the victory the Éothéod were awarded the fields of\nCalenardhon north of the White Mountains from the Gap of Rohan at the\nsouthern end of the Hithaeglir, Fangorn forest, rivers Limlight to\nAnduin, western Emyn Muil, and the Mering Stream, where they established\nthe kingdom of Rohan with Eorl the Young as their first king. A\npermanent alliance between Gondor and Rohan was established by the oath\nEorl swore to Cirion.\n\nThe War of the Ring and the Restoration\n\nSeveral centuries later, Sauron had prepared for the final conquest, and\nin TA 3018 his forces overran Ithilien. The attack was stopped at\nOsgiliath with the destruction of the bridge across the Anduin. The\nfollowing year Minas Tirith faced a larger attack from Mordor, with\nadditional threat from the Corsairs of Umbar. Aragorn summoned the Dead\nMen of Dunharrow to destroy the forces from Umbar, freeing forces in the\nsouth of Gondor to come to the aid of Minas Tirith. Gondor then defeated\nthe army of Mordor with the aid of the Rohirrim in the Battle of the\nPelennor Fields, though with heavy losses. The combined army of the West\nthen carried the battle to Sauron at the Battle of the Morannon, a feint\nto distract Sauron's attention from Frodo Baggins's quest to destroy the\nOne Ring in Mount Doom, thus causing Sauron's destruction and the\nallies' ultimate victory.\n\nAfter the second and final defeat of Sauron, the Kingship was restored,\nwith Aragorn crowned as King Elessar of the Reunited Kingdom of Arnor\nand Gondor. Faramir, last heir of the Ruling Stewards, retained his\noffice as the Steward to the King, and ruled over Gondor's eastern\nregion of Ithilien; a fair land between the river Anduin and the Ephel\nDúath. The oaths between Gondor and Rohan were renewed, and several\njoint campaigns were fought in the east and south against the remnant of\nthe Easterlings and Haradrim; all former territories of the\nSouth-kingdom were won back during the following centuries, and its\npower and wealth were restored. Several Tolkien's writings state that\n_“...of Eldarion son of Elessar it was foretold that he should rule a\ngreat realm, and that it should endure for a hundred generations of men\nafter him, that is until a new age brought in again new things; and from\nhim should come the kings of many realms in long days after”_.\n\n\nArmies\n\nSecond Age\n\nThe soldiers of Gondor were renowned during the Second Age for their\nskill and valour. Training men of Gondor during the Second Age instilled\nwithin their soldiers a martial spirit and ardor, goading them to fight\nto the death against the hordes of Mordor, Rhûn, and Harad. Every man\nwas physically imposing: being very tall at over six feet, very broad,\nand very strong as well. Every single soldier was in peak fighting\ncondition and ready to fight against Sauron's hordes (especially during\nthe War of the Last Alliance). The three major weapons they used were\nspears, longswords, and longbows. They also knew how to form cohesive\nbox-formations, which were sturdy enough for both offensive and\ndefensive purposes. The soldiers wore heavy plate armour and utilised\nlarge shields made out of multi-layered wood and edged in metal for\nreinforcement.\n\nThird Age\n\nGondor's armies prevented Mordor and its allies from overwhelming the\nrest of Middle-earth. Gondor was in a very crucial position, in order to\nguard Middle Earth and because of Gondor's proximity to Mordor, its\nmilitary forces had to be proficiently trained and vigilantly on guard\nat all times. Because of this, they were arguably the strongest country\nthat opposed Sauron. During the Third Age, most of Minas Tirith's armies\nwere trained and drilled to fight in tight infantry formations,\nsupported by archers and cavalry. Their armaments consisted of a\nchainmail undercoat with either a black tabard or plate armor over it.\nTheir standard weapons were long spears, longswords, and longbows,\ncomplimented by tower shields. \n\nMinas Tirith's immediate defenses comprised thousands of infantrymen\nstationed throughout Osgiliath, Cair Andros, and the Rammas Echor. These\nunits were most likely temporary detachments from the city. Minas Tirith\nalso had at least three companies of the elite Guards of the Citadel,\ntasked to defend the upper levels of the city. They wore black robes,\nsurcoats and winged silver crowns. The Guards of the City were not\nallowed to go in the main part of the City in their uniform.\nAdditionally, the sixth level of the city housed stables for a small\nforce of horsemen. Beyond Anduin and the defenses of Minas Tirith\noperated a secretive group of soldiers called the Rangers of Ithilien\nThe Rangers of Ithilien had guerrilla warfare aginst the Southrons,\nallies of Mordor. Similar to the Rangers of the North, the Rangers of\nIthilien were comprised of the remnant of the Dúnedain in their\nrespective Kingdom, in this case being the Dúnedain that once dwelled in\nIthilien.(the Rangers of the North were Arnorian Dúnedain, while the\nRangers of Ithilien are Gondorian- and were more populous than their\nnorthern kin).  Armed with longbows, swords, and spears, these men\nwatched and harassed the enemy throughout Ithilien, much akin to\nguerrilla warfare. The captain of the Rangers of Ithilien during the War\nof the Ring was Faramir, the younger brother of Boromir and the son of\nthe Steward of Gondor, Denethor II.\n\nThe defense of Gondor's fiefdoms were the responsibility of the\nrespective lords of these territories. Their training, strength in\nnumbers, and armaments varied from each fief (Lossarnach brought axemen\nto the aid of Minas Tirith while the men of Morthond Vale consisted of\narchers). The greatest of these fiefs was Dol Amroth, which brought\nforth the largest force to Minas Tirith, made up of men-at-arms and\narguably the best cavalry in Middle Earth- the elite Swan Knights.\n\nGondor's fleet at the time of the War of the Ring was docked at\nPelargir. This port and the Anduin River was essential in the defense of\nMinas Tirith. As made evident by the fiefdom's dire need to defend their\ncoasts and many rivers of Gondor, a majority of the fleet was\nconcentrated at Pelargir. This fleet was destroyed when the Black Ships\nof Umbar attacked, enslaving many of Gondor's sailors into the service\nof Mordor.\n\n\nSong of Gondor\n\n_Gondor! Gondor, between the Mountains and the Sea!_\n\n_West Wind blew there; the light upon the Silver Tree_\n\n_Fell like bright rain in gardens of the Kings of old._\n\n_O proud walls! White towers! O wingéd crown and throne of gold!_\n\n''O Gondor, Gondor! Shall Men behold the Silver Tree, ''\n\n_Or West Wind blow again between the Mountains and the Sea?_\n\nThis was sung by Aragorn on his trip with Legolas and Gimli to find\nPippin and Merry.\n\n\nEtymology\n\n_Gondor_ name means 'Land of Stone', from Sindarin GOND (stone) + (N)DOR\n(land), most likely given to it because of the White Mountains (Ered\nNimrais) and other mountain chains in the land (hypothetical Quenya name\nONDONÓRË).\n\n\nRegions of Gondor\n\n  Gondor was divided between several nearly\nautonomous regions. These were the following:\n\n-   Ithilien, a region along the east bank of the Anduin river under the\n    shadow of the Ephel Dúath (Mountains of Shadow). Ithilien was\n    abandoned and mostly under the control of Mordor during The War of\n    the Ring. (Although Gondor did have secret bases throughout the\n    region such as Henneth Annûn, and the Rangers of Ithilien used\n    guerilla warfare tactics to harass the enemy throughout Ithilien,\n    and disrupt supply lines and companies marching to and from Mordor.\n    After the War of the Ring, Faramir was made Lord Paramount of\n    Ithilien by Aragorn.\n-   South Ithilien, a portion of the the Ithilien south of Osgiliath.\n    The road (the Harad Road) the Southrons took to get to Morder lied\n    here.\n-   Anórien, a strip of land along the northern edge of the White\n    Mountains. Bordered by the Mering Stream and Rohan to the west,\n    Anduin to the east, the Mouths of Entwash to to the north, and\n    theWhite Mountainsand Rammas Echor to the south.\n-   Lossarnach, a heavily-populated farmland region southwest of Minas\n    Tirith.\n-   Lebennin, a plain extending from the White Mountains down to the Bay\n    of Belfalas that bordered Lossarnach.\n-   Belfalas, a fiefdom ruled by the Princes of Dol Amroth.\n-   Dor-en-Ernil, a narrow strip of land along the Bay of Belfalas ruled\n    by the Princes of Dol Amroth.\n-   Lamedon, a plain between the White Mountains and the River Ringló.\n-   Anfalas or _Langstrand_, a narrow strip of land along the sea\n    bordered by the Pinnath Gelin.\n-   Andrast, The western-most province of Gondor located on a narrow\n    peninsula jutting out into the Sea.\n-   Ringló Vale, a mini-province.\n-   Morthond or Blackroot Vale, where Duilin comes from.\n\nThe long cape of Andrast was not populated (by the descendants of\nNúmenóreans, but evidence from the _Unfinished Tales_ suggests that a\nsmall group of Púkel-men inhabited it.)\n\nAdditionally, Gondor held or had held the following regions at certain\npoints in its history:\n\n-   South Gondor or Harondor, an arid region between the rivers Porosand\n    Harnen, which was contested between Gondor and Harad.\n-   Calenardhon, which was given to the Éothéod and became Rohan. It's\n    boundaries were the rivers of Anduin in the east, Isenin the west,\n    Limlightin the north, and the White Mountains/ Mering Stream in the\n    south.\n-   Enedwaith, a region between the rivers Isen and Greyflood. It was\n    never truly populated by Gondor and was soon abandoned.\n-   Rhovanion, which was never fully under the control of Gondor but\n    under Gondorian control at certain times during the Third Age.\n-   Ephel Dúath, the Mountains of Shadow, which was the extreme eastern\n    region of Gondor where she kept watch over Mordor with many\n    fortresses and cities such as Minas Ithil, Durthang, and the Tower\n    of Cirith Ungol. Evil things re-entered Mordor after Gondor's watch\n    upon the land slackened during the Second Age.\n\n\nMajor Sites\n\n Cities, Fortresses, and Strongholds in Gondor included:\n\n-   Cair Andros, an island-fortress in the river Anduin, roughly 40\n    miles north of Osgiliath. Gondor maintained a steady garrison here,\n    as it was of paramount importance to Gondor during the long war with\n    Mordor, in order to prevent the enemy from crossing the river and\n    entering into Anórien.\n\n\n\n-   Calembel, a city in Lamedon.\n-   Dol Amroth, a city in Belfalas ruled by the Prince of Dol Amroth.\n-   Ethring, a ford and a large township built on either side of the\n    river Ringló.\n-   Henneth Annûn, a hidden refuge of Gondorian rangers in the northern\n    part of Ithilien along the Ephel Duath, the Mountains of Shadow.\n-   Linhir, a port city in Lebennin.\n-   Minas Tirith (originally Minas Anor), City of the Kings, the capital\n    (Third Age) and largest city of Gondor.\n-   Osgiliath, a city and former capital of Gondor on the river Anduin,\n    largely destroyed and abandoned by the end of the Third Age. During\n    the War of the Ring, Gondor kept a garrison on the west bank to\n    prevent the Enemy from crossing the river and assaulting Minas\n    Tirith. Osigiliath was the key to besiege Minas Tirith because of\n    its location and access to the river. Although the massive\n    Morgul-host led by the Witch-King to beseige Minas Tirith\n    overwhelmed the garrison, and drove the Gondorians out thus gaining\n    the passage of Anduin- the true beginning of the Siege of Gondor\n    that would conclude at the Battle of the Pelennor Fields. King\n    Elessar had it rebuilt after Sauron's downfall.\n-   Pelargir, the great southern harbour, which was captured by the\n    Corsairs during the War of the Ring. The people of Pelargir helped\n    in the Batttle of Pell\n-   Tarnost, a hill-town in Belfalas.\n\nAdditionally, Gondor had held the following locations at certain points\nin its history:\n\n-   Angrenost (Isengard), one of the three Fortresses of Gondor and held\n    within it one of the realm's Palantiri. Its location in Nan\n    Curunir (valley at the end of the Misty Mountains), was at the\n    northwestern corner of the Southern Kingdom of Gondor, guarding the\n    Fords of Isen from enemy incursions into Calenardhon, and together\n    with the fortress of Helm's Deep to its south protected the Gap of\n    Rohan. After Calenardhon was given to the Éothéod by Cirion, Steward\n    of Gondor and became Rohan, Isengard remained part of Gondor, and\n    the company of Aglarond removed to the northern fortress, although\n    the rest of Gondor almost forgot about it. The small guard\n    intermarried much with the Dunlendings , until the place became a\n    Dunlending fortress in all but name. Orthanc, however, remained\n    closed, as the Steward of Gondor still held the keys. Isengard soon\n    came all but deserted.\n-   Durthang, the largest fortress in Mordor, originally built to guard\n    the Ephel Dúath (Mountains of Shadow)..\n-   Erech, a town of Gondor that was abandoned by the end of the Third\n    Age. To the north lay the Paths of the Dead.\n-   Minas Ithil, a city founded by Isildur that was originally the\n    sister city of Minas Anor. Located in an upland valley at the feet\n    of the Mountains of Shadow, it was built as a fortress city to\n    defend Gondor from Sauron in Mordor. It was later conquered by\n    the Nazgûl and renamed Minas Morgul.\n-   Tharbad, a city on both sides of the river Greyflood, (at one time\n    held by Gondor in the south and Arnor in the north) but abandoned as\n    Gondor's borders recessed through Enedwaith to the Isen, and later\n    ruined.\n-   Tower of Cirith Ungol, a Tower Fortress in western Mordor built by\n    Gondor to guard the pass of Cirith Ungol from any evil creature\n    trying to enter -or leave- Mordor. The Great Plague wiped out the\n    garrison located here, so it was easily captured when Sauron's\n    minions re-entered Mordor.\n-   Towers of the Teeth, two towers situated on either side of the Black\n    Gate. The two towers, called Carchost and Narchost, that stand on\n    either side of Cirith Gorgor, the Haunted Pass, which lies between\n    the Ephel Dúath (Mountains of Shadow), and the Ash\n    Mountains. Originally built by Men of Gondor following the downfall\n    of Sauron at the end of the Second Age, the Towers of the Teeth were\n    eventually taken over by the servants of the Dark Lord. They were\n    then repaired and fortified and were incorporated into the defenses\n    of the pass and gate.\n-   Umbar, the far southern harbour which was lost and reclaimed several\n    times, in the end being the home of Black Númenóreans, the Corsairs\n    of Umbar.\n",
    "type": "<a href=\"/wiki/Kingdom\" title=\"Kingdom\">Kingdom</a>",
    "other_names": "Hyaralondie, Hyallondie, Turmen Hyallondi&#xE9;va, Stoningland, South-kingdom",
    "location": "Southern <a href=\"/wiki/Middle-earth\" title=\"Middle-earth\">Middle-earth</a>",
    "capital": "<a href=\"/wiki/Osgiliath\" title=\"Osgiliath\">Osgiliath</a> (<a href=\"/wiki/SA_3320\" title=\"SA 3320\">SA 3320</a> - <a href=\"/wiki/TA_1640\" title=\"TA 1640\">TA 1640</a>)<br><a href=\"/wiki/Minas_Tirith\" title=\"Minas Tirith\">Minas Tirith</a> (from <a href=\"/wiki/TA_1640\" title=\"TA 1640\">TA 1640</a>)",
    "description": "Southern <a href=\"/wiki/N%C3%BAmen%C3%B3rean\" title=\"N&#xFA;men&#xF3;rean\" class=\"mw-redirect\">N&#xFA;men&#xF3;rean</a> <a href=\"/wiki/Realms_in_Exile\" title=\"Realms in Exile\">Realm in Exile</a>, part of the <a href=\"/wiki/Reunited_Kingdom\" title=\"Reunited Kingdom\">Reunited Kingdom</a> by <a href=\"/wiki/FO_1\" title=\"FO 1\">FO 1</a>",
    "race": "<a href=\"/wiki/N%C3%BAmen%C3%B3reans\" title=\"N&#xFA;men&#xF3;reans\">N&#xFA;men&#xF3;reans</a><br><a href=\"/wiki/D%C3%BAnedain\" title=\"D&#xFA;nedain\">D&#xFA;nedain</a><br><a href=\"/wiki/Gondorians\" title=\"Gondorians\" class=\"mw-redirect\">Gondorians</a><br><a href=\"/wiki/Wood-elves\" title=\"Wood-elves\" class=\"mw-redirect\">Wood-elves</a><br><a href=\"/wiki/Sindar\" title=\"Sindar\">Sindar</a><br><a href=\"/wiki/Nandor\" title=\"Nandor\">Nandor</a><br><a href=\"/wiki/Silvan_Elves\" title=\"Silvan Elves\">Silvan Elves</a>",
    "spoken_languages": "<a href=\"/wiki/Ad%C3%BBnaic\" title=\"Ad&#xFB;naic\">Ad&#xFB;naic</a>, <a href=\"/wiki/Westron\" title=\"Westron\">Westron</a>, <a href=\"/wiki/Sindarin\" title=\"Sindarin\">Sindarin</a>",
    "governance": "<a href=\"/wiki/Kings_of_Gondor\" title=\"Kings of Gondor\">Kings of Gondor</a><br><a href=\"/wiki/Stewards_of_Gondor\" title=\"Stewards of Gondor\">Stewards of Gondor</a><br><a href=\"/wiki/King_of_the_Reunited_Kingdom\" title=\"King of the Reunited Kingdom\">Kings of the Reunited Kingdom</a>",
    "founded/built": "<a href=\"/wiki/SA_3320\" title=\"SA 3320\">SA 3320</a>",
    "lifespan": "<a href=\"/wiki/SA_3320\" title=\"SA 3320\">SA 3320</a> -"
  },
  {
    "title": "Elwing",
    "page_id": "185",
    "text": "ELWING, also known as ELWING THE WHITE, was the daughter of Dior the\nFair and his wife Nimloth. She was the younger sister of the twin\nbrothers Eluréd and Elurín. She became the wife of Eärendil the Mariner,\nand was the mother of Elrond and Elros.\n\n\nBiography\n\nElwing, as well as her brothers, were born in a house near Lanthir\nLamath and lived there until her father went to Doriath to assume his\ninheritance as King of Doriath.\n\nWhen the Sons of Fëanor attacked Doriath, all of her immediate family\nwas either killed or lost, but those loyal to her family took Elwing as\nwell as the Silmaril they sought and bore her away to the Havens of\nSirion.\n\nIt was at the Havens that Elwing met Eärendil and later married him. She\nbore him twin sons, Elrond and Elros. Elrond later went on to marry Lady\nCelebrian, daughter of Lord Celeborn and Lady Galadriel of Lothlórien.\nFrom this marriage they produced three children, Elladan and Elrohir,\ntwin brothers, and Arwen Undómiel, future Queen of Gondor. These\nchildren were therefore Elwing's grandchildren, a privilege shared with\nthe Lord and Lady of Lothlórien. In the present matter at hand, Elwing\nwas forced to abandon her children when the Sons of Fëanor came for the\nSilmaril in Elwing's possession. Rather than give it over, she threw\nherself into the Sea and was transformed into a great white bird.\n\nShe flew continuously until she found her husband's sailing ship, the\nVingilot. Then, on behalf of the Elves and Men of Middle-earth, they\nchose to sail for Valinor in the faint hope that they could make a final\nplea on behalf of those who suffered under Morgoth.\n\nWhen they arrived, Elwing chose to accompany her husband onto the\nshores, even though she knew it might mean her death. While Eärendil\njourneyed to visit the Valar, Elwing walked the shores, eventually\nmeeting the Elves of Alqualondë. There, she told them the tale of what\nwas happening in Middle-earth and became much loved by them.\n\nThe Valar eventually agreed to go to war to aid those in Middle-earth,\nand also decided to give both Eärendil and Elwing the choice of which\nkindred they would belong. Eärendil, out of respect for his wife,\nallowed her to choose for the both of them. She chose to be counted\namong the elves, in honor of her foremother, Lúthien.\n\nA white tower was later built for Elwing where she could live. It was\nalso said that the birds taught her their language and that she would\nfly to meet Eärendil when he returned from his nightly voyages.\n\n\nEtymology\n\nThe name ELWING means “Star-foam”, from the Sindarin _el_ (“star”) and\n_wing_ (“foam, spray”).\n\n\nGallery",
    "other_names": "Elwing the White",
    "titles": "Princess of Doriath",
    "birth": "<a href=\"/wiki/FA_503\" title=\"FA 503\">FA 503</a><sup id=\"cite_ref-0\" class=\"reference\"><a href=\"#cite_note-0\">[1]</a></sup>",
    "death": "Still Alive",
    "spouse": "<a href=\"/wiki/E%C3%A4rendil\" title=\"E&#xE4;rendil\">E&#xE4;rendil</a>",
    "race": "<a href=\"/wiki/Half-elven\" title=\"Half-elven\">Half-elven</a>",
    "gender": "Female",
    "hair": "Dark",
    "culture": "Elves of <a href=\"/wiki/Doriath\" title=\"Doriath\">Doriath</a> (House of Dior)<br>Elves of the <a href=\"/wiki/Havens_of_Sirion\" title=\"Havens of Sirion\">Havens of Sirion</a>"
  },
  {
    "title": "Rohirric",
    "page_id": "221",
    "text": "ROHIRRIC was the language of the Rohirrim of Rohan.\n\nIn the novels it is always represented by the Mercian dialect\nof Anglo-Saxon. This is because Tolkien saw the relationship between\nRohirric and the Common Speech to be the same as that of Anglo-Saxon and\nEnglish, which was used to represent Westron. Only a few actual Rohirric\nwords are given by Tolkien: _kûd-dûkan_, an old word meaning\n“hole-dweller” which led to _kuduk_, the name the Hobbits had for\nthemselves. Even these terms were translated in the book: “hobbit” is\nsaid to derive from the Anglo-Saxon construction “hol-bytla”, or\nhole-builder.\n\nThe only other Rohirric given is the element “lô–”/“loh–” corresponding\nto Anglo-Saxon “éo” (horse), and the derived names _Lôgrad_ for\n_Horse-Mark_, and _Lohtûr_ for _Éothéod_, horse-people, or horse-land.\n\nAll names beginning with Éo– are actually names beginning with Lô– or\nLoh–, but the real forms of Éomer, Éowyn etc. are not given. Only one\nproper name is given, that of Théoden: the actual form was _Tûrac_,\nwhich implies that Rohirric had adopted the Sindarin element “tur–” also\npresent in names like Turgon, with meaning power/mastery (i.e. King).\n\nThe languages of the Kingdom of Rhovanion, Esgaroth, and Dale (often\ncalled Dalish or Dale-ish) were related to Rohirric.\n\nde:Rohirrische Sprache it:Rohirric ru:Роханский язык"
  },
  {
    "title": "The History of Middle-earth",
    "page_id": "210",
    "text": "THE HISTORY OF MIDDLE-EARTH (abbreviated sometimes\nas HOME, and here as THOME) is a 13-volume series of books that collects\nand analyses material relating to Middle-earth, twelve of which were\ncompiled and edited by the son of J.R.R. Tolkien, Christopher Tolkien.\n\nMost of the content consists of earlier versions of already published\nworks by Tolkien, while other portions are completely new material.\nThese books are extremely detailed, to the point of documenting scraps\nof paper (of J.R.R. Tolkien's) that had been erased multiple times with\nmany footnotes. Christopher Tolkien thoroughly documents the history of\nthe writing of the Middle-earth stories, with as much detail as his\nfather documented the fictional history of Middle-earth itself.\n\nThe first two books introduce readers to _The Book of Lost Tales_, a\nmythology for England from which Tolkien drew ideas that eventually\nbecame the 'Silmarillion' mythology. The next three books follow the\nhistory of the emerging early mythology usually known as _The\nSilmarillion_. The discussion of the published book is deferred until\nbook ten. Books six through nine discuss the development of _The Lord of\nthe Rings_, book nine's second half discussing the Númenor story (the\nfirst versions of which were covered in Book Five). Book ten and eleven\ndiscuss the _Annals of Beleriand_ and _Annals of Aman_, which works were\ndeveloped together with the _Silmarillion_ tradition and which also\nserved as source material for the published Silmarillion. Book twelve\ndiscusses the development of the Appendices to _The Lord of the Rings_,\nfollowed by some assorted essays from Tolkien's last years of life.\n\n1.  _The Book of Lost Tales Part One_ (1983)\n2.  _The Book of Lost Tales Part Two_ (1984)\n3.  _The Lays of Beleriand_ (1985)\n4.  _The Shaping of Middle-earth_ (1986)\n5.  _The Lost Road and Other Writings_ (1987)\n6.  _The Return of the Shadow_ (The History of The Lord of the Rings\n    v.1) (1988)\n7.  _The Treason of Isengard_ (The History of The Lord of the Rings v.2)\n    (1989)\n8.  _The War of the Ring_ (The History of The Lord of the Rings v.3)\n    (1990)\n9.  _Sauron Defeated_ (The History of The Lord of the Rings v.4) (1992)\n10. _Morgoth's Ring_ (The Later Silmarillion v.1) (1993)\n11. _The War of the Jewels_ (The Later Silmarillion v.2) (1994)\n12. _The Peoples of Middle-earth_ (1996)\n13. _The History of Middle-earth: Index_ (2002)\n\nThe thirteenth volume, _The History of Middle-earth: Index,_ completely\nintegrates all the indices from the other twelve books into one large\nindex."
  },
  {
    "title": "Unfinished Tales",
    "page_id": "224",
    "text": "UNFINISHED TALES (fully titled _UNFINISHED TALES OF NÚMENOR AND\nMIDDLE-EARTH_) is a collection of stories by J.R.R. Tolkien that were\nnever completed during his lifetime, but were edited and concluded by\nhis son Christopher Tolkien and published in 1980.\n\n\nPublication and edition\n\nUnlike _The Silmarillion_, in which the narrative fragments were\nmodified to connect into a consistent and coherent work, the _Unfinished\nTales_ are presented as Tolkien left them, with little more than names\nchanged (the author having had a confusing habit of trying out different\nnames for a character while writing a draft). Thus some of these are\nincomplete stories, while others are collections of “factual”\ninformation about Middle-earth. Each tale is followed by a long series\nof Christopher's notes explaining inconsistencies and obscure points.\n\nAs with _The Silmarillion_, Christopher Tolkien edited and published\n_Unfinished Tales_ before he had finished his study of the materials in\nhis father's archive. Despite its shortcomings in editorial consistency,\n_Unfinished Tales_ does provide more detailed information about\ncharacters, events and places mentioned only briefly in _The Lord of the\nRings_. Versions of such tales including the origins of Gandalf and the\nWizards, the death of Isildur and the loss of the One Ring in the\nGladden Fields, and the founding of the kingdom of Rohan help expand\nknowledge about Middle-earth.\n\nOf particular note is the tale of Tar-Aldarion and Erendis (chapter two\nof Part Two), the only known story of Númenor before its fall. A map of\nNúmenor is also included in the book.\n\nThe _Unfinished Tales_ had commercial success, demonstrating that the\ndemand for Tolkien's stories several years after his death was not only\nstill present, it was actually growing. Considering this, Christopher\nTolkien began to embark upon the more ambitious twelve-volume work\nentitled _The History of Middle-earth_ which encompassed nearly the\nentire corpus of Tolkien's writings about Middle-earth.\n\n\nContents\n\nPart One: The First Age:\n\n-   “Of Tuor and his Coming to Gondolin”\n-   “Narn i Chîn Húrin (The Tale of the Children of Húrin)”\n\nPart Two: The Second Age:\n\n-   “A Description of the Island of Númenor”\n-   “Aldarion and Erendis: The Mariner's Wife”\n-   “The Line of Elros: Kings of Númenor”\n-   “The History of Galadriel and Celeborn”\n\nPart Three: The Third Age:\n\n-   “The Disaster of the Gladden Fields”\n-   “Cirion and Eorl and the Friendship of Gondor and Rohan”\n-   “The Quest of Erebor”\n-   “The Hunt for the Ring”\n-   “The Battles of the Fords of Isen”\n\nPart Four\n\n-   “The Drúedain”\n-   “The Istari”\n-   “The Palantíri”"
  },
  {
    "title": "Minas Tirith",
    "page_id": "240",
    "text": "MINAS TIRITH  (IPA:\n) was the capital of Gondor in the Third Age and the Fourth Age of\nMiddle-earth. Originally known as MINAS ANOR, the “Tower of the Setting\nSun”, it replaced the city Osgiliath as the new capital and stockade of\nGondor.\n\nWhen the Enemy began to take shape again, Minas Anor was renamed Minas\nTirith, the “Tower of Guard.” The city was also called THE WHITE CITY,\nas the courtyard in the front of the city's Citadel contained the White\nTree. Many important events took place in and in front of the city, such\nas the Battle of the Pelennor Fields, the healing of Éowyn by Aragorn\nafter the battle, and the coronation of Aragorn II Elessar.\n\n\nLayout\n\nMinas Tirith was surrounded by the Rammas Echor, a large ringwall\nencircling the city and the Pelennor Fields. This wall was built after\nMinas Ithil fell and was renamed Minas Morgul. It was repaired by\nEcthelion II during the time of the War of the Ring, but it had not the\nstrength to defend the city from the Dark Lord Sauron's legions of\nUruk-hai from Mordor. The city itself lay on a hill beneath Mount\nMindolluin, which rose above the city's citadel, by a length of a couple\nof thousand feet. Mount Mindolluin was where Aragorn found the seedling\nof the White Tree. \n\nThe city was divided into seven one-hundred-foot high levels, each\nsurrounded by white walls, except the first walls which had the same\nkind of black stone as Orthanc as a face. The gates connecting the\nlevels did not lay behind one another in a line, but faced in different\ndirections. A spur of rock, whose summit was level with the city's\nuppermost tier, jutted out from the front of the city in an easterly\ndirection, dividing all but the first level into two. Each level was\nscattered with many alleys, narrow passageways, and full-fledged houses\n(which were probably quite rare in the city). On the sixth level were\nlocated the Houses of Healing, surrounded by pleasant gardens. Finally,\nwithin the seventh wall, was the Citadel of Minas Tirith, with the White\nTower of Ecthelion - three hundred feet high, so that its apex was one\nthousand feet above the plain.\n\nLevels\n\n\n\nThe First Level of Minas Tirith was the lowest level of Minas Tirith\nwhere was the Main gate.\n\nDuring the Siege of Minas Tirith, Uruk-hai cast fire into the First\nLevel, burning many buildings and causing general havoc to many of the\ndefenders. Later on, the Main Gate was breached when Grond was finally\nused against it, and the soldiers of Gondor and Uruk-hai clashed in the\nstreets of the First Circle but Aragorn ordered a retreat and then made\ntheir way up.\n\n\nHistory\n\nMinas Tirith (as Minas Anor) was built in SA 3320. King Ostoher rebuilt\nthe city in TA 420, and, gradually, it became more important than\nOsgiliath, the original capital, which in later years fell into ruin.\nKing Tarondor finally moved the King's House to the city in TA 1640,\nthereby making it the official capital of the kingdom of Gondor. In the\nyear TA 2002, the White City's companion tower Minas Ithil (the “Tower\nof the Moon”) on the borders of Mordor was captured by the Ringwraiths\nand renamed Minas Morgul (the “Tower of Sorcery”). Minas Anor was then\nrenamed Minas Tirith, meaning the “Tower of Guard”, to indicate that,\nsince the fall of Minas Ithil, Minas Tirith was the only thing that\ndefended Gondor and all the other lands around and behind it against the\ndarkness from Mordor. The Rammas Echor, the great wall encircling the\nrich farmlands and suburbs of the City, was built at this time.\n\nWar of the Ring\n\nMinas Tirith only has Gondorian soldiers while the civilians dwell in\nOsgiliath with several Gondorian soldiers. After the Uruk-hai attacked\nand overran Osgiliath a thousand soldiers were killed while the\nremaining thousand soldiers fled to Minas Tirith while the civilians\nwere evacuated to Rohan. The remaining gondorian soldiers entered\nOsgiliath and once the uruk-hai were slain the civilians departed from\nRohan and returned to Osgiliath.\n\nSiege of Minas Tirith\n\nMinas Tirith was besieged by the armies of Mordor, under the Great\nDarkness generated by Sauron's power. The Battle of the Pelennor Fields\ntook place on March 15, 3019 in the fields surrounding the city. It was\na very large battle. Theoden, the King of Rohan was killed during this\nbattle by the Witch-king of Angmar. At about the same time, the\nWitch-king was destroyed by Éowyn, lady of Rohan, who was severely\nwounded in the process. It was also there that Gandalf took command of\nthe City's defenses from the Ruling Steward Denethor after he fell to\ndespair. Aragorn later arrived at the hour of need with Gondor's Army of\nthe South which he had liberated from defending the port city of\nPelargir, turning the tide of battle in favor of the Free Peoples. After\nthe battle, the stench of death was heavy in Minas Tirith's air, and the\nPelennor Fields lay strewn with bodies.\n\nFourth Age\n\nOn 1 May 3019, the Crowning of King Elessar took place on the plain\noutside Minas Tirith. After his coronation, he entered the city as the\nKing of Gondor, as he was destined to become from the start of his\nlifetime. With his coronation, King Elessar refounded the line of the\nKings of Gondor, and as he was also the King of the Kingdom of Arnor,\nMinas Tirith became Capital of the Reunited Kingdom.\n\nMinas Tirith was repaired by its new king (who grew plants inside of its\nwalls to add to its luster and beauty) and by the Dwarves of Glittering\nCaves, particularly Gimli, who built a new gate for the city (made of\nmithril and steel) and altogether fixed the layout of the city as well.\nMinas Tirith was said to have been made even more beautiful than when it\nwas at the time of its founding. The city is known to have stood firm\nand strong well into the Fourth Age because of these two renovations.\n\nIn _The Silmarillion_, as Of The Ring Of Power And The Third Age says,\nafter War of the Ring, the city is referred to as Minas Anor again after\nthe overthrow of Sauron and the destruction of Barad-dûr.\n",
    "type": "City",
    "location": "Easternmost point of the <a href=\"/wiki/White_Mountains\" title=\"White Mountains\">White Mountains</a>, close to the <a href=\"/wiki/Anduin\" title=\"Anduin\">Anduin</a>",
    "regions": "<a href=\"/wiki/Gondor\" title=\"Gondor\">Gondor</a>",
    "governance": "<a href=\"/wiki/King_of_Gondor\" title=\"King of Gondor\" class=\"mw-redirect\">King of Gondor</a>",
    "founded/built": "<a href=\"/wiki/SA_3320\" title=\"SA 3320\">SA 3320</a>",
    "lifespan": "<a href=\"/wiki/SA_3320\" title=\"SA 3320\">SA 3320</a>"
  },
  {
    "title": "Lindon",
    "page_id": "248",
    "text": "LINDON was a Elven Kingdom founded by Gil-galad at the beginning of the\nSecond Age. It was the longest-standing Eldarin Kingdom in the history\nof Middle-earth, and the mightiest throughout the Second Age. It was\nruled by its founder, Gil-galad, the High King of the Ñoldor, who,\nduring that age, was the strongest and most powerful enemy of Sauron in\nMiddle-earth.\n\nThe realm endured through the Third Age, though diminished, and was the\nsite of the Grey Havens, where the Elves, as well as the Ring-bearers,\nsailed to the Undying Lands.\n\n\nDescription\n\n\n\nLindon was located in what remained of Ossiriand; the Land of Seven\nRivers and all that was left of the peninsula of Beleriand after the War\nof Wrath. The mountains, partially sunk in the ruin of Beleriand,\nformed a portion of the realm's east border. The realm reached as far\nnorth over the mountains as the Little Lune. North of that boundary was\nwhat remained of the Dwarf kingdom of Belegost. After the ruin of\nBeleriand, Gil-Galad founded the realm of Lindon, which encompassed all\nthe land west of the Blue Mountains and east of the sea in the North of\nMiddle-earth. The Gulf of Lune broke the realm of Lindon into Forlindon\nand Harlindon. The Grey Havens lay at the mouth of the river Lune.\nThrough a break in the Blue Mountains, the land of Eriador lay to the\neast, and farther southeast laid the Shire. Eastward also lay the\nKingdom of Eregion, at the feet of the Misty Mountains, which was also\nruled by Gil-Galad under the lordship of Celebrimbor. Towards the\nend of the Second Age, the realm of Arnor was established by Elendil to\nthe northeast of Lindon.\n\nThe lands of Lindon were said to be lush and green, with thick forests\nlining the foothills of the Blue Mountains. The havens of the elves were\nfound along the Gulf of Lune, where the land became rocky yet lush along\nthe coast. Tolkien stated that Lindon was Elven country “where no Man\ndwells”. It was the last realm that was fair and free. It also had a\nmildly tempered climate, with mild winters and mild summers.\n\n\nHistory\n\nBefore the Second Age\n\n_Lindon_ was another name for the Ossiriand in East Beleriand, where the\nLaiquendi dwelt.\n\nSecond Age\n\nAfter the War of Wrath, those Elves who had sought refuge on the coast\nof the sea at the mouths of the river Sirion removed into the land that\nwas left in the northwest of Middle-earth. They, led by Gil-Galad,\nestablished the realm of Lindon in SA 1. In the North at Forlindon\nGil-galad ruled a majority of Noldorin Elves. In southern Harlindon,\nCeleborn ruled a fiefdom of many Sindar and the remaining Green Elves of\nBeleriand under Gil-Galad. He did not rule under Gil-galad for long,\nthough, eventually removing to the shores of Lake Nenuial with his wife,\nGaladriel. At the Grey Havens Círdan was the lord of many shipbuilders\nof the Teleri who survived the ruin of the First Age. The Elves believed\nnow that the threat of Morgoth was removed, and Lindon became a fair\nkingdom. Gil-galad and the Elves of Lindon had a very strong friendship\nwith Númenor and its kings before the Darkening of Númenor.\n\nEarly in the sixth century of the Second Age, the first ships of Númenor\nreturned to Middle-earth. Vëantur, father-in-law of Tar-Meneldur, led\nthe first expedition. Later he returned with his grandson and heir to\nthe throne, Aldarion, and the Númenoreans were well liked by Gil-galad\nand his people. Tar-Aldarion continued his voyages to Lindon throughout\nhis reign as the sixth King of Númenor, and Gil-galad and Círdan taught\nmuch to the mariners of Númenor. Gil-galad befriended Aldarion and gave\nhim and his father, Tar-Meneldur, many gifts. After the reign of\nAldarion, Númenor was less active in the affairs of Lindon for many\nhundred years, though friendship remained.\n\nIn the twelfth century, Sauron attempted to infiltrate Lindon disguised\nas 'Annatar', the Lord of Gifts. His strength now on the mend after\nMorgoth's defeat, Sauron purposed to corrupt the strongest of all the\nremaining Elf-kingdoms. Gil-galad denied him, and so did Elrond, who\ndwelt then with the King in Forlindon. Though they did not know\nAnnatar's true identity at the time, the wise king of Lindon foresaw\nevil in Annatar. Sauron then turned his attention to Eregion, where he\nsucceeded in befriending the Noldorin smiths under Celebrimbor who\nworked there.\n\n\n\nAfter Sauron forged the One Ring at the beginning of the sixth century,\nhe declared war on the Elf-kingdoms to capture the Rings of Power they\nhad hidden from him. Gil-galad sent a small army led by Elrond east to\nthe aid of Eregion. There he joined with Celeborn, but Sauron's forces\ndefeated the combined force. His army ravaged Eregion and the rest of\nEriador, and came to the borders of Lindon. There, Gil-galad's forces\ndug in against the forces of Sauron, and were strengthened by a great\nfleet sent from Númenor by Tar-Minastir, the King of Númenor, under his\nson and heir Ciryatan. With the aid of the Númenoreans, participating in\ntheir first war upon Middle-Earth, Lindon was freed and Sauron's forces\noverthrown. Sauron returned to Mordor and focused his attention now on\nruining Númenor.\n\nIn the year SA 3319 of the Second Age, Númenor was destroyed, and\nElendil and sons and his remnant of Faithful Númenoreans landed on the\ncoast of Middle-earth. Elendil established the Realms in Exile which\nwere the North-Kingdom of Arnor and the South-Kingdom of Gondor. He\nbecame close friends and ally with Gil-galad, and they pledged support\nto one another against the preparing blow of Sauron, who had risen to\npower once again after fleeing the ruin of Númenor.\n\nThe War of the Last Alliance began in SA 3434, and the Elves of Lindon\nformed a large part of the backbone of the Elven armies. Elendil's\nNúmenorean refugees, along with Dúnedain who had removed to Middle-Earth\nbefore the destruction of Númenor, marched alongside the host of\nGil-galad, and eventually they laid siege to the Dark Tower. Sauron\nhimself then came to battle, and fought Gil-galad and Elendil. The two\nkings defeated him but died in the process. Then, Isildur son of Elendil\ncut the ring from Sauron's hand, and he was for a time defeated.\n\nThird Age\n\nAfter the death of Gil-galad, the lordship of Lindon passed to Círdan;\nand the line of Noldorin kings in Middle-Earth came to an end. The\npopulation of Lindon had been reduced by the long and bloody war with\nSauron. With the loss of their king, many of the Noldor and Sindar left\nfor Valinor. Following the war, many Elves began to come to the Grey\nHavens and sail to Valinor, further depleting Lindon's population.\nCírdan continued his shipbuilding, and had much work constructing the\nvessels to carry the Elves west. However, the kingdom began to dwindle\nas the ships continued to sail.\n\nThe Witch-king of Angmar attacked the Kingdom of Arnor in the thirteenth\ncentury of the Third Age. Lindon lent what aid it could to the Dúnedain,\nbut after many years, the North-Kingdom was overthrown. The Dúnedain\nwent into exile, and the kingdom of Lindon shrank rapidly into a safe\nhaven for the Elves of Middle-earth. By the time of the War of the Ring,\nit was a shadow of its former glory, with only Grey Havens seeing\nregular traffic and activity. After Sauron's defeat, the last Elves\nbegan to sail for Valinor, and Círdan remained there well into the\nFourth Age, awaiting the last ship to sail west himself.\n\n\nEtymology\n\nThe name _LINDON_ means “Land of the Singers”, from the Quenya term\n_lin_ or _lind_ (“to sing, make musical sound”) and _-on_, which\nis a common suffix for regions.",
    "type": "<a href=\"/wiki/Elven\" title=\"Elven\" class=\"mw-redirect\">Elven</a> Realm",
    "location": "West of the <a href=\"/wiki/Blue_Mountains\" title=\"Blue Mountains\">Blue Mountains</a>",
    "capital": "<a href=\"/wiki/Grey_Havens\" title=\"Grey Havens\">Grey Havens</a>",
    "major_towns": "<a href=\"/wiki/Forlond\" title=\"Forlond\">Forlond</a>, <a href=\"/wiki/Harlond\" title=\"Harlond\">Harlond</a>, <a href=\"/wiki/Thorin%27s_Halls\" title=\"Thorin&apos;s Halls\">Thorin&apos;s Halls</a>, Dwarven halls and mines in the Ered Luin",
    "description": "Dates back to the <a href=\"/wiki/First_Age\" title=\"First Age\">First Age</a>. In later times, it was known as the seat of the last <a href=\"/wiki/High_King_of_the_%C3%91oldor\" title=\"High King of the &#xD1;oldor\">High King of the &#xD1;oldor</a> <a href=\"/wiki/Gil-galad\" title=\"Gil-galad\">Gil-galad</a> and afterwards a safe-haven for Elves under C&#xED;rdan, who would be leaving for the <a href=\"/wiki/Undying_Lands\" title=\"Undying Lands\">Undying Lands</a>.",
    "race": "<a href=\"/wiki/%C3%91oldor\" title=\"&#xD1;oldor\">&#xD1;oldor</a><br><a href=\"/wiki/Sindar\" title=\"Sindar\">Sindar</a><br>few <a href=\"/wiki/Dwarves\" title=\"Dwarves\">Dwarves</a>",
    "spoken_languages": "<a href=\"/wiki/Sindarin\" title=\"Sindarin\">Sindarin</a><sup id=\"cite_ref-0\" class=\"reference\"><a href=\"#cite_note-0\">[1]</a></sup>, <a href=\"/wiki/Khuzdul\" title=\"Khuzdul\">Khuzdul</a>, <a href=\"/wiki/Westron\" title=\"Westron\">Westron</a>",
    "governance": "<a href=\"/wiki/Gil-galad\" title=\"Gil-galad\">Gil-galad</a><br><a href=\"/wiki/C%C3%ADrdan\" title=\"C&#xED;rdan\">C&#xED;rdan</a>",
    "founded/built": "<a href=\"/wiki/SA_1\" title=\"SA 1\">SA 1</a>",
    "lifespan": "<a href=\"/wiki/SA_1\" title=\"SA 1\">SA 1</a> - Early <a href=\"/wiki/Fourth_Age\" title=\"Fourth Age\">Fourth Age</a>"
  },
  {
    "title": "Misty Mountains",
    "page_id": "225",
    "text": "The MISTY MOUNTAINS, also named the _HITHAEGLIR_ , was a mountain range that\nran 1280 kilometres (795.35 miles) from north to south between Eriador\nand the valley of the Great River, Anduin, and from Mount Gundabad in\nthe far north to Methedras in the south.\n\nAn early version of this range's name was _ERED HITHUI_ .\n\n\nGeographical description\n\n\n\nThe range's notable peaks were Caradhras, Celebdil, Fanuidhol, Mount\nGundabad, and Methedras.\n\nLocation\n\nThe northernmost peak of the Misty Mountains was Mount Gundabad; where\naccording to legend Durin (eldest of the Seven Fathers of the Dwarves)\nawoke, though it became an abode and mountain-fortress of Orcs.\n\nThe greatest Dwarven realm in Middle-Earth, Khazad-dûm (later named\nMoria), was located at the midpoint of the Misty Mountains. The three\npeaks that were part of Khazad-dûm were Caradhras (Redhorn), Celebdil\n(Silvertine) and Fanuidhol (Cloudyhead). Inside Celebdil, the Dwarves\nbuilt the Endless Stair, from the foundations of the mountain to the top\nof it. The southernmost peak of the Misty Mountains was Methedras,\nmeaning “the Last Peak”.\n\nRoutes through the Misty Mountains\n\nThe most important passes were the High Pass and the Redhorn Pass. There\nwas also a pass at the source of the Gladden river.\n\nRoutes around the Misty Mountains\n\nThe Gap of Rohan was the valley (probably of the River Isen) between the\nsouthernmost peaks of the Misty Mountains and the northernmost of the\nWhite Mountains. There may have been a gap between Mount Gundabad in the\nMisty Mountains and the westernmost extremity of the Grey Mountains,\nthough published maps differ on this point. \n\nInhabitants\n\nUnder the Misty Mountains were the former Dwarf realm of Khazad-dum, and\nthe “Goblin-town” in which Bilbo Baggins stumbled across the One Ring,\nwhich had been in the possession of the creature Gollum, who also dwelt\nthere himself on the eastern side. Rivendell was hidden in the foothills\nof the Misty Mountains at the western end of the High Pass.\n\nCarn Dûm, where the Witch-King of Angmar resided for several centuries\nin the Third Age, lay between a western spur of the northern extreme of\nthe range, known as the Mountains of Angmar. Mount Gundabad, the largest\nGoblin dwelling in the Misty Mountains, was located south-east of\nAngmar.\n\nIsengard lay centered around the Tower of Orthanc in Nan Curunír, the\nvalley between the arms of Methedras, which was the southernmost peak of\nthe Misty Mountains. The “stone-giants” also inhabited this mountain\nrange, as told in _The Hobbit_.\n\n\nHistory\n\nOrigins\n\nThe Misty Mountains were created by Melkor during the Time of the Trees,\nwho wanted to make it difficult for Oromë, who often rode across\nMiddle-earth hunting his fell beasts, to pass.\n\nYears of the Trees\n\nThe Dwarves of Durin awoke under Mount Gundabad and later established\nthe caves of Khazad-dûm. Later, when the Elves on their Great Journey to\nValinor looked upon their terrible height a portion of the Teleri, later\nknown as the Nandor grew afraid and turned south down the Great River.\nThousands of years later, the Ñoldor returned to Middle-earth and\nestablished great realms in the Beleriand and in the highlands, but they\nnever crossed the mountains or established realms within them.\n\nFirst and Second Ages\n\nOver three-hundred years into the First Age, the tribes of Men crossed\nthe Misty Mountains and began migrating into the Beleriand, first the\nEdain and then later the Easterlings or Swarthy Men. After the defeat of\nMorgoth, the surviving orcs and a Balrog came to live there and would\nremain a problem for over six-thousand years. The Easterling men who\nfought with Morgoth crossed the mountains and began living east of the\nWilderland in Rhûn. The Great Eagles also began living here in a place\nknown as the Eagles Eyrie.\n\nThe great Dwarven realm of Khazad-dûm beneath the Misty Mountains\nthrived as good relations with the Ñoldor of Eregion were established,\nuntil Sauron invaded Eriador from Mordor and the east destroying Eregion\nand ravaging the lands beyond. The dwarves survived by shutting\nthemselves in Khazad-dûm behind the Doors of Durin.\n\nThird Age\n\nIn TA 1980, the great Dwarven realm of Khazad-dûm came to an end when\nthe Dwarves unearthed a Balrog which led to its desertion by TA 1981,\nafter which it was known as Moria (literally, “black chasm”). Slowly,\nthe Misty Mountains became increasingly perilous and dangerous to\ntravelers as Goblins and other creatures came to dwell under there.\n\nAlmost a thousand years later, the thirteen Dwarves, Gandalf, and Bilbo\nBaggins used the High Pass to cross the Misty Mountains during the Quest\nfor the Lonely Mountain, and were captured by Goblins whilst crossing.\nUnder the mountains, the Great Goblin was slain, and Bilbo found the One\nRing.\n\nThe Fellowship of the Ring tried to cross the Redhorn Pass (after\nrejecting the High Pass leading to Rhovanion as being watched by the\nEnemy, and the Gap of Rohan as taking the Fellowship too close to\nIsengard), but a blizzard forced it to go under the mountain instead of\nover it. They faced a Balrog that dwelt in the deserted realm of\nKhazad-dûm. Gandalf slew the Balrog by casting it down from Zirakzigil,\nbut it had worn his life already, and on that high ground he lay until\nGwaihir bore him to Lothlorien.",
    "type": "Mountain Range",
    "other_names": "<i>Hithaeglir</i> (<a href=\"/wiki/Sindarin\" title=\"Sindarin\">S</a>)<br>The Mountains of Mist<br>Towers of Mist<br><p><i>Ered Hithui</i> (<a href=\"/wiki/Sindarin\" title=\"Sindarin\">S</a>)</p>",
    "location": "Between <a href=\"/wiki/Eriador\" title=\"Eriador\">Eriador</a> and  <a href=\"/wiki/Rhovanion\" title=\"Rhovanion\">Rhovanion</a>",
    "major_towns": "<a href=\"/wiki/Moria\" title=\"Moria\" class=\"mw-redirect\">Khazad-d&#xFB;m</a>, <a href=\"/wiki/Carn_D%C3%BBm\" title=\"Carn D&#xFB;m\">Carn D&#xFB;m</a>, numerous Orc-holds including <a href=\"/wiki/Goblin-town\" title=\"Goblin-town\">Goblin-town</a> and <a href=\"/wiki/Gundabad\" title=\"Gundabad\" class=\"mw-redirect\">Gundabad</a>",
    "regions": "<a href=\"/wiki/Moria\" title=\"Moria\" class=\"mw-redirect\">Khazad-d&#xFB;m</a><br>Under the Mountains include <a href=\"/wiki/Angmar\" title=\"Angmar\">Angmar</a>, <a href=\"/wiki/Eregion\" title=\"Eregion\">Eregion</a>, <a href=\"/wiki/Dunland\" title=\"Dunland\">Dunland</a>, <a href=\"/wiki/Lothl%C3%B3rien\" title=\"Lothl&#xF3;rien\">Lothl&#xF3;rien</a>, <a href=\"/wiki/Fangorn\" title=\"Fangorn\" class=\"mw-redirect\">Fangorn</a>",
    "description": "Created by the <a href=\"/wiki/Valar\" title=\"Valar\">Vala</a> <a href=\"/wiki/Morgoth\" title=\"Morgoth\" class=\"mw-redirect\">Melkor</a> during the <a href=\"/wiki/Years_of_the_Trees\" title=\"Years of the Trees\">Years of the Trees</a> as a hindrance for <a href=\"/wiki/Orom%C3%AB\" title=\"Orom&#xEB;\">Orom&#xEB;</a>",
    "race": "<a href=\"/wiki/Dwarves\" title=\"Dwarves\">Dwarves</a><br><a href=\"/wiki/Orcs\" title=\"Orcs\">Orcs</a><br><a href=\"/wiki/Trolls\" title=\"Trolls\">Trolls</a><br><a href=\"/wiki/Giants\" title=\"Giants\">Giants</a><br><a href=\"/wiki/Eagles\" title=\"Eagles\" class=\"mw-redirect\">Eagles</a>",
    "spoken_languages": "<a href=\"/wiki/Westron\" title=\"Westron\">Westron</a><br><a href=\"/wiki/Khuzdul\" title=\"Khuzdul\">Khuzdul</a><br><a href=\"/wiki/Black_Speech\" title=\"Black Speech\">Black Speech</a><br><a href=\"/wiki/Orkish\" title=\"Orkish\">Orkish</a><br><a href=\"/wiki/Sindarin\" title=\"Sindarin\">Sindarin</a>",
    "founded/built": "<a href=\"/wiki/Years_of_the_Trees\" title=\"Years of the Trees\">Years of the Trees</a>"
  },
  {
    "title": "Maia (Born of Hope)",
    "page_id": "245",
    "text": "MAIA was a Dunedain of the North girl of the refuge of Taurdal.\n",
    "name": "Maia",
    "race": "<a href=\"/wiki/Men\" title=\"Men\">Men</a>",
    "lifespan": "<a href=\"#\" class=\"new\" title=\"TA 2924 (page does not exist)\" rel=\"nofollow\" data-uncrawlable-url=\"L3dpa2kvVEFfMjkyND9hY3Rpb249ZWRpdCZyZWRsaW5rPTE=\">TA 2924</a> - ?",
    "gender": "Female",
    "culture": "<a href=\"/wiki/D%C3%BAnedain\" title=\"D&#xFA;nedain\">D&#xFA;nedain of the North</a>",
    "actor": "<a href=\"#\" class=\"new\" title=\"Amylea Meiklejohn (page does not exist)\" rel=\"nofollow\" data-uncrawlable-url=\"L3dpa2kvQW15bGVhX01laWtsZWpvaG4/YWN0aW9uPWVkaXQmcmVkbGluaz0x\">Amylea Meiklejohn</a> (Younger), <a href=\"#\" class=\"new\" title=\"Phoebe Chambers (page does not exist)\" rel=\"nofollow\" data-uncrawlable-url=\"L3dpa2kvUGhvZWJlX0NoYW1iZXJzP2FjdGlvbj1lZGl0JnJlZGxpbms9MQ==\">Phoebe Chambers</a> (Older)"
  },
  {
    "title": "The Adventures of Tom Bombadil",
    "page_id": "279",
    "text": "_THE ADVENTURES OF TOM BOMBADIL_ is a collection of poetry by J.R.R.\nTolkien, published in 1962 (ISBN 0044407262). The book contains 16\npoems, only two of which deal with Tom Bombadil, a character who is most\nfamous for his encounter with Frodo Baggins in _The Fellowship of the\nRing_, the first volume in Tolkien's best-selling _The Lord of the\nRings_. The rest of the poems are an assortment of bestiary verse and\nfairy tale rhyme.\n\nThe book was illustrated originally by Pauline Baynes and later by Roger\nGarland.\n\n\nEditions\n\n2014 Edition\n\nThe 2014 release can be seen as a kind of special edition as it not only\nincludes the main published poems and artwork, but also a new\nIntroduction, 'commentary' section that discusses the history of each\npoem, and secondary early versions of the poems. It also includes an\nappendix with an unreleased fragment of prose story about Tom Bombadil,\nand two additional poems: _Once Upon A Time_ and _An Evening in\nTavrobel_.\n\n\nCanon\n\nThe book, like the first edition of _The Fellowship of the Ring_, is\npresented as if it is an actual translation from the Red Book of\nWestmarch, and contains some background information on the world of\nMiddle-earth which is not found elsewhere. Examples are the name of the\ntower at Dol Amroth and the names of the Seven Rivers of Gondor. There\nis some dispute about its canonical status since the information\npresented about the secondary world is considered only as folklore among\nthe Hobbits.\n\n_Tom Bombadil_ can best be seen as a small, poetic venture into\nTolkien's imagination."
  },
  {
    "title": "Lords of Andúnië",
    "page_id": "622",
    "text": "The Lords of Andúnië were the rulers of a noble house of Númenor in the\nSecond Age.\n\n\nHistory\n\nThe Lords of Andúnië named for their ancestral home of Andúnië were\ndescended from Silmariën, daughter and oldest child of Tar-Elendil the\nfourth King of Númenor. The laws of Númenor at that time would not allow\nher to rule as queen, so she wedded Elatan of Andúnië and took up\nresidence there. Their son Valandil would be named the first Lord of\nAndúnië in about the seventh century of the Second Age.\n\nThroughout the Second Age, the Lords of Andúnië became leaders of the\nElendili, or Elf-friends, for remaining friends with the Elves and\nfaithful to the Valar. This was despite opposition and eventually\npersecution from the King's Men.\n\nAt the end of the Second Age, Númenor's estrangement from the Elves and\nthe Valar under the evil guidance of Sauron corrupted Númenórean\nsociety. Seeking pardon of the Valar for the wickedness of the\nNúmenóreans, Amandil the Faithful, Lord of Andúnië, sailed into the west\nbut was never heard of again.\n\nHis son Elendil, the last Lord of Andúnië, did not join Ar-Pharazôn's\ngrand armada to attack Valinor, and instead fled with his sons Isildur\nand Anárion and many of the Faithful to Middle-earth, where they founded\nthe lines of the Kings of Gondor and Arnor.\n\nElendil brought with him the Sceptre of Andúnië, the instrument of his\nlordship, which became a hereditary emblem of royal authority in Arnor,\nalong with the Ring of Barahir. It later became known as the Sceptre of\nAnnúminas and by the Third Age thought to be the oldest artifact made by\nMen in Middle-earth.\n\nit:Signori di Andúnië\n\n Category:Men"
  },
  {
    "title": "White Mountains",
    "page_id": "578",
    "text": "The WHITE MOUNTAINS or ERED NIMRAIS was a mountain range in\nMiddle-earth that lay east-to-west across the length of Gondor.\n\n\nDescription\n\nThe mountains were named after the glaciers of their highest peaks. The\nrange lay mostly East-West, but also had a northern section, which was\nseparated from the main line of the Misty Mountains by the Gap of Rohan.\nEven at the southern latitude of Gondor and Rohan, the White Mountains\nbore snow even in summer, suggesting they were extremely high. The range\nhad no passes. The Paths of the Dead passed under it, but only the most\ncourageous (or foolhardy) ever ventured that route. The White Mountains\nformed the northern boundary of Gondor and the southern boundary of\nRohan except in their easternmost provinces, where Gondor's province of\nAnorien lay to the north of the mountains.\n\nBecause of their always bearing snow at their highest peaks, the White\nMountains must have been at least 4800 meters (16'000 feet) above sea\nlevel, with occasional peaks probably in excess of 5500 meters. They\nwere, however, not as high as the Misty Mountains.\n\nIts notable peaks included _Irensaga_ “Iron Saw” and _Starkhorn_.\nBetween these two lay the _Dwimorberg_, entrance to the Paths of the\nDead.\n\nAt the eastern end, the city of Minas Tirith was carved into\n_Mindolluin_ mountain. The Warning beacons of Gondor were placed on top\nof seven peaks in the range: _Amon Dîn_, _Eilenach_, _Nardol_, _Erelas_,\n_Min-Rimmon_, _Calenhad_ and _Halifirien_.\n\nSeveral rivers raised in the White Mountains, among them: the Adorn (a\ntributary of Isen), and the Snowbourn and Mering Stream (tributaries of\nthe Entwash); and, on the south side, the Erui (a tributary of Anduin),\nthe Ringló and its tributary Ciril (which together with the Morthond all\nentered the Bay of Belfalas at Edhellond near Dol Amroth), the Lefnui of\nthe Anfalas, and the Five Rivers of Lebennin.\n\n\nHistory\n\nThe natives to the White Mountains were Drúedain who inhabited this\nregion in the Second Age. The only remnants of the Druedain's presence\nin this mountain range were their statues called the _Púkel-men_.\nSometime thereafter, evil men related to the Dunlendings drove the\nDrúedain out. Some of these men swore allegiance to Isildur, but\nbetrayed him and were cursed into the Army of the Dead. Aragorn,\nLegolas, and Gimli followed the Paths of the Dead in year 3019 of the\nThird Age and convinced the army to fight for Gondor in the War of the\nRing. After they did so, Aragorn released the Army of the Dead, for they\nhad fulfilled their oath. After and perhaps before the War of the Ring\nDwarves settled in the White Mountain, where they could have better\ncontact with their allies.\n\n\nEtymology\n\n_ERED NIMRAIS_ is a Sindarin name: _Ered_ ('Mountains') and _Nimrais_\n('White peaks')",
    "type": "Mountain Range",
    "other_names": "Ered Nimrais",
    "location": "South-eastern <a href=\"/wiki/Middle-earth\" title=\"Middle-earth\">Middle-earth</a> between Gondor and Rohan",
    "regions": "<a href=\"/wiki/Gondor\" title=\"Gondor\">Gondor</a>, <a href=\"/wiki/Rohan\" title=\"Rohan\">Rohan</a>",
    "description": "Formed the border between Gondor and Rohan",
    "race": "Men of the Mountains<br><a href=\"/wiki/Longbeards\" title=\"Longbeards\">Longbeards</a><br><a href=\"/wiki/Orcs\" title=\"Orcs\">Orcs</a><br><a href=\"/wiki/Dunlendings\" title=\"Dunlendings\">Dunlendings</a><br><a href=\"/wiki/Dr%C3%BAedain\" title=\"Dr&#xFA;edain\">Dr&#xFA;edain</a>",
    "spoken_languages": "<a href=\"/wiki/Westron\" title=\"Westron\">Westron</a><br><a href=\"/wiki/Rohirric\" title=\"Rohirric\">Rohirric</a><br><a href=\"/wiki/Dunlendish\" title=\"Dunlendish\">Dunlendish</a><br><a href=\"/wiki/Khuzdul\" title=\"Khuzdul\">Khuzdul</a><br><a href=\"/wiki/Orkish\" title=\"Orkish\">Orkish</a>",
    "governance": "King of the Mountains",
    "founded_or_built": "First inhabited in the <a href=\"/wiki/Second_Age\" title=\"Second Age\">Second Age</a>",
    "lifespan": "<a href=\"/wiki/Years_of_the_Lamps\" title=\"Years of the Lamps\">Years of the Lamps</a>"
  },
  {
    "title": "Drúadan Forest",
    "page_id": "580",
    "text": "The DRÚADAN FOREST also known as the TAWAR-IN-DRÚEDAIN was a\npine forest in Gondor, located in Anorien, which was north of Minas\nTirith. The forest was inhabited by a strange folk of men known as the\nDrúedain, the Wild Men of the Woods or Wood Woses. \n\nAccording to the _The Atlas of Middle-earth_, the forest was over forty\nmiles in total length. The highest point in the Drúadan Forest is\nEilenach which was the sixth Beacons and could be seen from the west.\n\n\nHistory\n\nThe forest had been occupied by the Drúadan since sometime between or\nsometime after the Second Age years: SA 883 and SA 1075. It was known\nfor being avoided by outsiders. The forest is remembered most for\nwhen the Riders of Rohan where guided through the forest on their way to\nthe relief of Minas Tirith, by their leader Ghân-buri-Ghân. There was a\nroad there, created long ago by the “Stonehouse-folk” (Men of Gondor),\nthat everyone except the Wild Men had forgotten. It would have taken the\nDrúedain from sunrise to noon to walk it, but it required around ten\nhours for all of Rohan's army to get through. Each company of soldiers\nwas guided by a Wild Man, who also sent out scouts to keep their\nmovements secret. Movement through the forest keep the army from being\nspotted by the enemy.\n\nIn the Fourth Age, King Aragorn II Elessar declared that the men of the\nforest would have the land to themselves because of their help during\nthe war."
  },
  {
    "title": "Battle of Fornost",
    "page_id": "584",
    "text": "The BATTLE OF FORNOST was the decisive battle between the forces of\nAngmar, under the Witch-king, and of Eärnur, the Crown Prince of Gondor,\nin the year TA 1975 that ended the evil northern Kingdom of Angmar.\n\n\nHistory\n\nA year prior to the battle, the armies of Angmar conquered Arthedain,\nthe last realm of Arnor. Angmar's armies had taken Fornost, the capital\nof the Dúnedain, and Arvedui, the last King of Arnor, had drowned in the\nIce-Bay of Forochel. A year later, a fleet of ships under Eärnur arrived\nin the Grey Havens and set off toward what was left of the once-great\nnorthern kingdom. With the armies of Gondor came men from Rhovanion,\nelves from Lindon, and the remainder of the Dúnedain (among them\nAranarth, the Prince of Arthedain). According to Shire historians, a\ncompany of archers was also sent to the battle.\n\nThe battle itself did not take place in the city of Fornost, but on the\nplains to the west of the city, near Lake Evendim. The armies of Angmar\nhurried west to meet the assault, and seeing this, the cavalry of Gondor\nrode north into the Hills of Evendim to wait in ambush. As the main part\nof the army of Gondor met the enemy in battle, the Gondor cavalry set\nout from the hills to strike the rear of the army of Angmar. This served\nas the turning point in the battle, and allowed the combined armies of\nthe west to gain the advantage. Realizing that his forces were all but\ncompletely destroyed, the Witch-king of Angmar fled eastward. As he\nfled, an army led by Glorfindel came up out of the south and blocked his\nescape, destroying what was left of his crumbling army; the Witch-king\nhimself was able to escape during the night and fled southward. Though\nthe battle itself had been lost and Angmar utterly destroyed, Sauron was\nextremely pleased with the Witch-King's work, for the destruction of the\nnorthern kingdoms of the Dúnedain was a victory for the Dark Powers\nwhich far exceeded the loss of the Witch-King's realm."
  },
  {
    "title": "Kin-strife",
    "page_id": "626",
    "text": "The Kin-strife was a disastrous civil war in Gondor in the Third Age.\n\n\nBackground\n\nThe unrest that created the Kin-strife began when Valacar, the son of\nthe Gondor king Rómendacil II, married a woman of the Northmen of\nRhovanion, Vidunavi. She bore him a son Eldacar, but many of the people\nof Gondor of Númenórean blood were angered by this mixing of blood of\nMiddle Men and Númenóreans, and the coastal provinces rebelled when\nValacar grew old.\n\n\nCivil War\n\nWhen in TA 1432 Eldacar succeeded his father the unrest grew into open\nrebellion, as many people saw Eldacar as a half-breed who had no right\nto rule. The chief of them was his distant relative Castamir the\nUsurper, Lord of Ships, who in TA 1437 usurped the throne, forcing\nEldacar into exile. Castamir was supported by the people of the realm of\nUmbar, who sought revenge against Gondor. During the rebellion Osgiliath\nwas burned, and the great Dome of Stars was lost, together with its\nPalantír. Castamir also murdered Eldacar's son and heir Ornendil.\nEldacar fled to Rhovanion, and Castamir ruled in his stead.\n\nA full decade later, in TA 1447, Eldacar returned with Rhovanion troops;\nat the same time a rebellion against Castamir's cruel rule took place.\nEldacar managed to kill Castamir at the Battle of Erui, but Castamir's\nsons and many of their supporters fled south to Umbar. Eldacar could not\nfollow them, as the fleet was under Castamir's control.\n\nNot only did Gondor lose the city of Umbar for four centuries and gain a\nnew enemy in the Corsairs of Umbar, descendants of Castamir's sons, but\nalso many of the Númenóreans of purest blood were killed during the\ncivil war, leaving Gondor weakened.\n\nThe Kin-strife was, along with the Great Plague and sheer laziness one\nof the chief reasons for the abandonment of the fortresses in and\nsurrounding Mordor."
  },
  {
    "title": "Dunland",
    "page_id": "579",
    "text": "DUNLAND was the land of the wild men, or 'Dunlendings'. _Dunland_ means\n_Hill Land_ in the language of neighboring Rohan, whose people named it\nafter arriving in nearby Calenardhon in the later Third Age.\n\n\nInhabitants\n\nDunland was inhabited by the Dunlendings, Men who were mostly bearded\nand had dirty faces, and long matted hair. They wore clothes of leather\nand animal skin and carried weapons that were simple but effective for\ntheir purpose. They usually fought with clubs and pitchforks, and at\ntimes they carried torches to act as lights at night and to burn\nbuildings by day. The buildings that Dunlendings lived and worked in\nwere crude shacks of wood and animal skin that were often sabotaged by\nWargs and sometimes the Rohirrim.\n\nThe vernacular of this land's inhabitants, including possibly the\nStoors, was Dunlendish.\n\nAncestors of the Dunlendings inhabited the forested regions of\nMiddle-earth on either side of the Gwathló in the early Second Age; thus\nthe early Númenóreans called them _Gwaithuirim_. They spoke a language\nrelated to that of the Second House of Men, the Haladin, rather than the\nvastly different Bëorian-Marachian tongue which stood at the base of\nAdûnaic, and this lack of mutual understanding led to outright\nhostility. The Númenóreans greedily harvested _Gwaithuirim_ forests for\ntimber, and after much war and bloodshed, the _Gwaithuirim_ from south\nof the Gwathló fled east to the Hithaeglir while others scattered to the\ncape of Eryn Vorn and the White Mountains.\n\nAt the end of the Second Age, the land north of the Gwathló and south of\nthe Baranduin was named Minhiriath “Land between the Rivers”, although\nthe land south of Minhiriath remained unnamed. Its inhabitants were\nlargely ignored despite the fact that the Gondor colonial city of\nTharbad grew up on the Gwathló west of the Misty Mountain hillfolk who\nhad been _Gwaithuirim_ long before. It was not until Gondor abandoned\nthis city in TA 2050 that the people and their land were renamed: both\nbecame known as Enedwaith “Middle-Folk, Middle Region”, because they\nowed no allegiance to the North or South Kingdom.\n\nThe Hillfolk of the Hithaeglir kept their hatred of the descendants of\nNúmenor (unlike those of Eryn Vorn and the White Mountains, who\nnevertheless remained uncooperative). The Dead Men of Dunharrow who\nbetrayed Isildur were descended from _Gwaithurim_.\n\nIn T.A. 2770, Smaug the Dragon destroyed the Kingdom under the Mountain.\nDwarves fleeing from this disaster settled in Dunland, from\nwhere Thrór departed when he and his companion Nár journeyed\nto Moria in T.A. 2790. After the Battle of Azanulbizar, provoked by\nthe Orcs' brutal slaying of Thrór, Thráin II and Thorin led the remnants\nof their followers back to Dunland but soon left (to eventually settle\nin the Blue Mountains).\n\nWhen Gondor decided to give the depopulated province of Calenardhon to\nthe numerous people of Éothéod in TA 2510, the Hillfolk of the\nHithaeglir felt threatened by these _Forgoil_ “Strawheads” (a demeaning\nreference to the blonde hair of the refugees from Calenardhon). The\nHillfolk had slowly colonised Calenardhon during the dwindling of the\nDúnedain and had already reclaimed all the land between the Adorn and\nIsen. Still, open war was not waged until the reign of Helm Hammerhand\n(TA 2741 - TA 2759). Freca, the Lord of the Hillmen (whom the Rohirrim\nnow called Dunlendings) tried to get the throne of Rohan for himself by\npetitioning for the marriage of his son Wulf to the daughter of Helm.\nThe Hill-men leader Freca was killed and Wulf led the Dunlendings into\nopen war with Rohan. They unsuccessfully besieged the Hornburg during\nthe Long Winter of TA 2758 - TA 2759. Wulf did take Edoras and killed\nHaleth, the son of Helm, in front of the golden hall of Meduseld.\nNonetheless, Helm's nephew Fréalaf held out against the Dunlendings in\nthe refuge of Dunharrow. He recaptured Edoras at the end of the Long\nWinter and killed Wulf personally. The Dunlendings were driven out of\nRohan, and Fréalaf succeeded the deceased Helm Hammerhand.\n\nGuarding the Gap of Rohan was the fortress of Isengard, where a\nhereditary guard watched for Gondor. However, by the time of the Steward\nof Gondor Beren, these guards had mixed with Dunlendings, and it had\nbecome hostile to Gondor. To remedy this situation, Beren gave Saruman\nthe keys to Orthanc to guard Isengard for Gondor.\n\nSaruman used the historical hostility against outlanders to tempt the\nDunlendings into supporting him during the War of the Ring. In The Two\nTowers extended edition, the Dunlending warlord is shown giving a\nblood-oath to Saruman.\n\nAfter the battle at Helm's Deep, the Rohirrim allowed the surviving\nDunlendings to return to their homes. The Rohirrim required that all\nhostilities cease and that the Dunlendings again retreat behind the\nIsen.\n\n\nNearby locations\n\n-   North: Galanduin River\n-   East: Misty Mountains\n-   South: Isengard\n-   West: Enedwaith\n",
    "type": "Region",
    "location": "The west-skirts of the southern <a href=\"/wiki/Misty_Mountains\" title=\"Misty Mountains\">Misty Mountains</a>, south of the <a href=\"/wiki/Glanduin\" title=\"Glanduin\">Glanduin</a>",
    "regions": "<a href=\"/wiki/Gondor\" title=\"Gondor\">Gondor</a>",
    "description": "Fair, fertile land. Briefly the seat of the <a href=\"/wiki/King_of_Durin%27s_Folk\" title=\"King of Durin&apos;s Folk\">King of Durin&apos;s Folk</a>",
    "race": "<a href=\"/wiki/Dunlendings\" title=\"Dunlendings\">Dunlendings</a><br><a href=\"/wiki/Stoors\" title=\"Stoors\" class=\"mw-redirect\">Stoors</a><br><a href=\"/wiki/Durin%27s_Folk\" title=\"Durin&apos;s Folk\">Durin&apos;s Folk</a>",
    "spoken_languages": "<a href=\"/wiki/Westron\" title=\"Westron\">Westron</a>,<br><a href=\"/wiki/Dunlendish\" title=\"Dunlendish\">Dunlendish</a>,<br><a href=\"/wiki/Hobbitish\" title=\"Hobbitish\">Hobbitish</a>,<br><a href=\"/wiki/Khuzdul\" title=\"Khuzdul\">Khuzdul</a>",
    "governance": "<a href=\"/wiki/King_of_Durin%27s_Folk\" title=\"King of Durin&apos;s Folk\">King of Durin&apos;s Folk</a> (very briefly over the Dwarves in exile)",
    "founded_or_built": "First inhabited in the early <a href=\"/wiki/Second_Age\" title=\"Second Age\">Second Age</a>",
    "lifespan": "Early <a href=\"/wiki/Second_Age\" title=\"Second Age\">Second Age</a> -"
  },
  {
    "title": "Andrast",
    "page_id": "576",
    "text": "The ANDRAST, also known as RAS MORTHIL, was a long cape in the\nfarthest south-west of Gondor in Middle-earth.\n\n\nDescription\n\nThe White Mountains ended their southward bend at the Andrast, and as\nsuch it formed an effective barrier to invaders from the north for\nGondor. The Drúedain lands actually extended north along the coast on to\nthe rivers Adorn and Angren, and were collectively known as Drúwaith\nIaur or “Old Púkel land”.\n\nThe climate hovered near the moderate and the extreme with mild winters\nand hot, dry summers and the terrain consisted of scattered\nwoodlands.\n\n\nHistory\n\n\n\nThe Andrast was nominally part of Gondor, but it was not populated by\nthe Númenóreans. At the end of the Third Age, it was believed the area\nwas still populated by tribes of the Drúedain and other hostile men. The\nDrúedain were notorious for using poisoned Arrows.\n\n\nSee Also\n\n-   Regions of Gondor"
  },
  {
    "title": "Bay of Belfalas",
    "page_id": "577",
    "text": "The BAY OF BELFALAS was a large southern bay in the Great Sea.\n\nThe Bay of Belfalas was the remainder of the eastern edge of the Great\nGulf that had divided Beleriand from the Lands to the South in the First\nAge. After the end of the War of Wrath a large section of western\nMiddle-earth was drowned, and with the new coastline the Bay of Belfalas\nextended from Andrast to the Mouths of Anduin, and then south past Umbar\nto the unknown southern shores.\n\nMost of the Rivers of Gondor flowed into the Bay of Belfalas, and it had\nmany smaller bays and capes.\n\nThe Bay was named for the region of Belfalas (or “Great Shore”), and in\nit lay the rocky island of Tolfalas.",
    "aliases": "Bay of Bel",
    "summary": "The Bay of Belfalas was the only part of the <a href=\"/wiki/Great_Gulf\" title=\"Great Gulf\">Great Gulf</a> of <a href=\"/wiki/Beleriand\" title=\"Beleriand\">Beleriand</a> that survived the <a href=\"/wiki/War_of_Wrath\" title=\"War of Wrath\">War of Wrath</a>.",
    "realm": "<a href=\"/wiki/Middle-Earth\" title=\"Middle-Earth\" class=\"mw-redirect\">Middle-Earth</a><br>",
    "type": "<a href=\"#\" class=\"new\" title=\"Bay (page does not exist)\" rel=\"nofollow\" data-uncrawlable-url=\"L3dpa2kvQmF5P2FjdGlvbj1lZGl0JnJlZGxpbms9MQ==\">Bay</a>"
  },
  {
    "title": "Great Plague",
    "page_id": "582",
    "text": "The GREAT PLAGUE, known also as the DARK PLAGUE, was a disastrous\npestilence in Middle-earth during the Third Age.\n\n\nHistory\n\nBeginning\n\nThe Great Plague began in the east beyond Mordor, reaching Osgiliath in\nTA 1636 just a year after King Minardil of Gondor had been killed at\nPelargir by the Corsairs of Umbar, and only two centuries after the\nKin-strife of Gondor. The new king, Telemnar was killed together with\nhis kin, as well as many others of the Dúnedain. Together these events\nserved to further destroy the people of Gondor.\n\nMovement of the Plague\n\nThe Plague had first hit Rhûn and Rhovanion, and after the plague had\npassed more than half the folk of the Kingdom of Rhovanion had been\nkilled. From Osgiliath the plague spread west and then north. Enedwaith\nand Dunland were scarcely affected, but the Plague regained strength as\nit went north, and Minhiriath (the southern part of Cardolan) was\nespecially hit hard. The last of the Dúnedain of Cardolan died on the\nBarrowdowns, and evil spirits from Angmar and Rhudaur entered the realm.\n\nArthedain further to the north was scarcely affected, while the Shire\nwas hit harder, with the Hobbits suffering great losses. Arthedain\nstill defended Fornost to the north.\n\nThe city of Osgiliath was especially hit hard, suffering the highest\ncasualties outside of Rhovanion. Many fled the city and re-located to\nIthilien and Anórien, and Minas Anor became the King's seat there.\n\nAfter the Plague\n\nThe casualties were so high that the fortresses guarding Mordor were\nabandoned as the troops were recalled. For the next two centuries\nGondor, as well as its enemies, did little but try to regain strength.\nEventually Gondor did recover and garrisoned the fortresses for a short\ntime.\n"
  },
  {
    "title": "White Tree of Gondor",
    "page_id": "583",
    "text": "The WHITE TREE OF GONDOR was the symbol of the realm of Gondor, growing\nin the Court of the Fountain at Minas Tirith. The White Tree was also\nthe motif of Gondor's flag.\n\n\nDescription\n\nThis iconic tree was in appearance a tall spacious tree of graceful\nform, white thin unwrinkled bark over white wood. In spring it bore\nnumerous white flowers, but few of these ever fructified; what shape the\nfruit was is never described, nor is it considered to be edible. The\nleaves were laurel-like, dark green above and bright silver beneath. The\nwood when burned gives off a dense, choking, volumnious smoke that forms\na fog capable of burying an entire country in darkness for several days.\n\nIt was fashioned in the image of Telperion, elder of the Two Trees of\nValinor, originally. This image was given to the Elves of Kortirion in\nValinor and named Galathilion. From it a sapling was taken to Tol\nEressëa, named Celeborn. This in turn sired the tree Nimloth of Númenor,\nfelled by Sauron and burned on the altars.\n\n\nHistory\n\nFirst White Tree\n\nThe first White Tree of Gondor came from a fruit that Isildur, at great\npersonal risk, managed to steal from Nimloth the Fair, the White Tree of\nNúmenor, before that one was destroyed at Sauron's insistence. He\nsuffered many wounds at this mission, and he came near death, but when\nthe first leaf opened in the spring, Isildur was healed of his wounds.\n\nThis sapling was brought to Middle-earth on Isildur's ship, and it was\neventually planted in Minas Ithil before the house of Isildur. But when\nSauron returned to Middle-earth, he launched a sudden attack that\ncaptured Minas Ithil, and he destroyed the White Tree. Isildur escaped\ntaking with him again a sapling.\n\nSecond White Tree\n\nIn the Year 2 of the Third Age, Isildur plants the seedling of the White\nTree in Minas Anor.\n\nThis White Tree lasts until TA 1636, when the Great Plague hits Gondor,\nkilling among many others King Telemnar and his children.\n\nThird White Tree\n\nA third sapling is planted in TA 1640 by King Tarondor. This one lasts\nuntil the year 2852 and the death of the Ruling Steward Belecthor II.\n\nAt this time no seedling of the tree could be found. As a result it was\nleft standing after its death.\n\nFourth White Tree\n\nWhen Aragorn becomes king he discovers (with Gandalf's help) a sapling\nof the White Tree upon the slopes of Mindolluin, high above the city,\nwhich he reverently plants in its place. The dead tree is removed from\nthe court but is placed in the Tombs of the Kings with all the honour\nthat would normally be accorded a fallen monarch. In June of TA 3019 the\nsapling blooms.\n"
  },
  {
    "title": "Angmar",
    "page_id": "650",
    "text": "ANGMAR was a realm established in TA 1300 by the Lord of the Nazgûl\nlater called the “Witch-king of Angmar” - located in a northern fork in\nthe western Misty Mountains, and founded with the sole purpose of\nweakening the northern realm of Arnor. The land was known in part for\nits cold and snowy weather.\n\n\nHistory\n\nLong before the Witch-king came to Angmar, the dwarves had many\nflourishing mines in the region, and halls that were secure and\nprosperous. It was not long before Durin's Folk felt the first assaults\nof Angmar. They fled southward, seeking the safety of their mines in the\nWeather Hills. \n\nThe Witch-king arose in Angmar during the realm of Malvegil of\nArthedain, at some time between TA 1272 and TA 1349. Men became aware of\nthe growing evil in the mountains, but Angmar was still preparing its\npower. No assaults on the Dunedain came until Argeleb I, the son of\nMalvegil, assumed the throne of Arthedain. \n\nIn TA 1356, the sub-realm Rhudaur was forced to invade Arthedain; many\nwere slaughtered including their king, Argeleb I. However, with the help\nof Cardolan's armies, Arthedain maintained a strong line of defense at\nthe foot of the Weather Hills. \n\n\n\nThen in TA 1409, Angmar attacked Cardolan and Rivendell and destroyed\nall the settlements within except Cardolan's capital, the Barrow-downs.\nAmon Sul was razed and burned and the Dunedain were forced to flee\nwestward. Arthedain was now left without any allies to aid it, and so\nbegan a mighty struggle lasting another 500 years.  \n\nHelp came from the Elves of the Grey Havens, Rivendell, and Lorien. The\narmies of Angmar were repelled from Fornost and the North Downs, and\nforced to withdraw to Angmar. The shadow of the North was contained for\na time.  \n\nAfter the Great Plague, which started from the east of Mordor in TA\n1636, the last of Cardolan's people died, allowing Barrow-wights to be\nsent from Angmar into the downs. \n\nDuring the time of TA 1974, Angmar multiplied its forces and launched a\nfinal assault on Arthedain. Subsequently, they took its capital Fornost,\nthereby defeating the last northern kingdom of the Dunedain.\n\nSometime later, Prince Eärnur - thirty-third and last King of Gondor -\narrived to aid Arthedain, but he found he was too late. His army\ndefeated the forces of Angmar in the Battle of Fornost, and the\nWitch-king fled to Mordor, leaving the kingdom of Angmar to fall in TA\n1975.\n\n\nEtymology\n\n_Angmar_ meant 'Iron home' in Sindarin.\n",
    "type": "<a href=\"/wiki/Kingdom\" title=\"Kingdom\">Kingdom</a> of evil",
    "location": "Northeast of <a href=\"/wiki/Arnor\" title=\"Arnor\">Arnor</a>, south of <a href=\"/wiki/Forodwaith\" title=\"Forodwaith\">Forodwaith</a>",
    "capital": "<a href=\"/wiki/Carn_D%C3%BBm\" title=\"Carn D&#xFB;m\">Carn D&#xFB;m</a>",
    "description": "Known for being the realm of <a href=\"/wiki/Sauron\" title=\"Sauron\">Sauron</a>&apos;s chief lieutenant, the Witch-king of Angmar, who weakened and conquered the <a href=\"/wiki/Arnor\" title=\"Arnor\">North-kingdom</a> of the D&#xFA;nedain",
    "race": "<a href=\"/wiki/Orcs\" title=\"Orcs\">Orcs</a><br><a href=\"/wiki/Trolls\" title=\"Trolls\">Trolls</a><br><a href=\"/wiki/Men\" title=\"Men\">Men</a>",
    "spoken_languages": "<a href=\"/wiki/Black_Speech\" title=\"Black Speech\">Black Speech</a>",
    "governance": "<a href=\"/wiki/Witch-king_of_Angmar\" title=\"Witch-king of Angmar\">Witch-king of Angmar</a>",
    "founded_or_built": "<a href=\"/wiki/TA_1300\" title=\"TA 1300\">TA 1300</a>",
    "lifespan": "TA 1300 - <a href=\"/wiki/TA_1975\" title=\"TA 1975\">TA 1975</a>"
  },
  {
    "title": "The Old Forest",
    "page_id": "651",
    "text": "THE OLD FOREST is the sixth chapter of Book One of _The Fellowship of\nthe Ring_.\n\n\nPlot\n\nAlthough trying to avoid it, the Hobbits get lost and travel to the\nRiver Withywindle, the “queerest part of the whole wood”. Merry and\nPippin are trapped inside Old Man Willow, and are freed only when Tom\nBombadil arrives.\n\npl:Stary Las (rozdział)",
    "data_title": "The Old Forest",
    "number": "6",
    "location": "<a href=\"/wiki/Old_Forest\" title=\"Old Forest\">Old Forest</a>",
    "characters": "<a href=\"/wiki/Frodo_Baggins\" title=\"Frodo Baggins\">Frodo Baggins</a>,<br><a href=\"/wiki/Samwise_Gamgee\" title=\"Samwise Gamgee\">Samwise Gamgee</a>,<br><a href=\"/wiki/Pippin\" title=\"Pippin\" class=\"mw-redirect\">Pippin</a>,<br><a href=\"/wiki/Merry\" title=\"Merry\" class=\"mw-redirect\">Merry</a>",
    "previous": "<i><a href=\"/wiki/A_Conspiracy_Unmasked\" title=\"A Conspiracy Unmasked\">A Conspiracy Unmasked</a></i>",
    "next": "<i><a href=\"/wiki/In_the_House_of_Tom_Bombadil\" title=\"In the House of Tom Bombadil\">In the House of Tom Bombadil</a></i>"
  },
  {
    "title": "Edain",
    "page_id": "656",
    "text": "The EDAIN (sing. ADAN) also known as ATANATÁRI, FATHERS OF MEN, and_'\nThree Houses of Men_', are a group of Men that came to the Beleriand\nfrom the Far East during the First Age.\n\n\nHistory\n\nIn the early fourth century of the First Age the Edain, drawn towards\nthe Light of the West, came into Beleriand where they befriended the\nelves, entered their service, received land and title for that service,\nand fought valiantly in the Battles of Beleriand. Some, however,\nremained in Estolad or fled south or east from the power of Dark Lord\nMorgoth, and passed from history until the Third Age. Despite their\nmighty heroes, the Edain were decimated by the hordes of Morgoth, but\none of their numbers, Eärendil of the House of Hador, sailed to Aman and\nobtained from the Valar the aid by which Morgoth was defeated in the\nLast Battle. The remnant of the Edain, now increased in body and mind by\nEönwë, then sailed to Númenor and became known as Númenóreans and later\nthe Dúnedain who came to live in Middle-earth in the Realms in Exile\nafter the Fall of Númenor.\n\n\nThree Houses of Man\n\nThey were divided into three tribes, or “Houses”:\n\n1.) The HOUSE OF BËOR: they were dark-haired and stoutly built, and most\nresembled the Ñoldor of all Elves. They were first discovered by Finrod\nFelagund, Lord of Nargothrond, and under his guidance later made their\nway to the lands of the Ñoldorin lord Amrod, in a place later known as\nEstolad, the Encampment. They remained loyal to the House of Finarfin,\nand later settled in the lands of Dorthonion.\n\n2.) The Second House, later known as the HALADIN or the HOUSE OF HALETH:\nThey were a reclusive folk, dark-haired but smaller in stature than the\nBëorians. They usually kept separate from the other Men, and were later\ngranted permission to settle in the Forest of Brethil, part of Doriath.\nThey mostly kept out of the wars.\n\n3.) The HOUSE OF MARACH, later best known as the HOUSE OF HADOR: They\nwere originally led by Marach but later took the name of Hador in honor\nof him. Tall and golden-haired, they most resembled the Vanyar of the\nelves. They were a very numerous and war-like tribe, and the Green Elves\nof Ossiriand feared them. They first settled in Estolad, then in the\nsouthern parts of Ered Wethrin (Mountains of Shadow), and then later in\nDor-lómin. They were loyal to Fingolfin.\n\n\nCharacteristics\n\nThe Edain were tall, fair, and strong; their spirits were noble, they\nwere fierce in war, and they shunned all dealings with evil. In\nBeleriand the Edain loved the Eldar, from whom they learned much wisdom,\nand they were further ennobled by the two marriages of Elda and Adan:\nBeren and Lúthien and Tuor and Idril. The lifespan of the Edain before\nthey entered Beleriand was probably about 70 years; in Beleriand, it was\nlengthened to 90, but few of the Edain lived to old age in peace.\n\n\nLanguage\n\nThe language of the Edain (at least those of the First and Third Houses)\nwas related to Adûnaic, but in Beleriand, most of the Edain spoke\nSindarin, and so the tongue of the Haladin was alien to them.\n\n\nFate of the Edain\n\nThe House of Bëor was nearly wiped out by Morgoth, and the remainder of\nits people merged with the Hadorians and became the Númenóreans. It\nwould seem that the Haladin of Beleriand were completely wiped out, or\nat least disappeared as a separate people.\n\nWhen they returned as Númenóreans to Middle-earth in the Second Age,\nthey encountered many men who were obviously related to the Atani: they\nclassified these men as _Middle Men_, and established friendly relations\nwith them. Examples are the Rohirrim, the Men of Dale, and the\nBreelanders.\n\nOther men, such as the Dunlendings, were not recognised as Middle Men\nbecause they were related to the Haladin rather than Bëorians or\nMarachians, and they were hostile to Númenor.\n\nA fourth kind of men came with the Second House, and called themselves\n_Drughu_. This name was adopted in Sindarin as _Drúedain_:\n_Drû_+_Edain_. They were a strange people, living with the Haladin in\nthe forest of Brethil, some even apparently made it to Númenor, but they\ndied out or had left before the Akallabêth. In the Third Age, their far\nkin were known as the _Woses_ of the Drúadan Forest. They had dwindled\nto a very small number and were secretive but were renowned for the\nassistance they gave to the Rohirrim in the War of the Ring.\n\n\nEtymology\n\nThe Sindarin word _Edain_, singular _Adan_ (Quenya _Atani_, _Atan_),\nliterally meant _Second People_, and originally referred to all men, but\nlater it only applied to the Men of Beleriand and their descendants. The\nQuenya term _Atani_ kept its old meaning."
  },
  {
    "title": "Cardolan",
    "page_id": "646",
    "text": "CARDOLAN was sub-kingdom of the Dúnedain Kingdom of Arnor. After the\ndeath of its tenth King, Eärendur, his sons had divided Arnor into the\nkingdoms of Arthedain, Rhudaur and Cardolan.\n\n\nHistory\n\nThe borders of Cardolan extended from the river Brandywine to the west,\nthe river Hoarwell  to the east and the river Gwathló\n(Greyflood) to the east and south. Its northern border was the Great\nEast Road, but Cardolan also claimed the Arthedain-controlled Weather\nHills, which contained the fortress of Weathertop and its valuable\nPalantír. For this reason the Weather Hills were claimed by all three\nkingdoms - Arthedain, Cardolan and Rhudaur. This territorial dispute\ncontinued until Rhudaur became a vassal of Angmar after the line of the\nDúnedain kings failed there.\n\nWhen the kingdom of Angmar arose in northern Eriador, Cardolan became\nthe most important ally of Arthedain. It had to fight the combined\narmies of both Angmar and Rhudaur. It soon became apparent that Cardolan\ncould not hold back the forces of Angmar and in its last years the\npeople became entrenched in the hill region, Tyrn Gorthad (the\nBarrowdowns). This position became untenable after Angmar sent evil\nspirits to inhabit the downs (the Barrow-wights). Arthedain could\nprovide little aid, as it was itself under attack. Around TA 1409\nCardolan was destroyed, and its former inhabitants accepted the King of\nArthedain as their lord. Arthedain managed to reconquer the land\nbriefly, but few people wished to live there on account of the\nBarrow-wights, and so Cardolan was never re-populated. \n\nAfter the final fall of Arnor, and the destruction of Angmar at the\nBattle of Fornost, Cardolan remained an unpopulated area until the\nreestablishment of the northern kingdom under King Aragorn II Elessar at\nthe end of the Third Age. Until then, the region was largely\nunclaimed and known as Minhiriath.\n\n\nEtymology\n\nThe name _Cardolan_ appears to be a dialect Sindarin word for 'Red Hill\nLand'.",
    "type": "<a href=\"/wiki/Kingdom\" title=\"Kingdom\">Kingdom</a>",
    "location": "Southern <a href=\"/wiki/Eriador\" title=\"Eriador\">Eriador</a>; south of the <a href=\"/wiki/Great_East_Road\" title=\"Great East Road\">Great East Road</a> between the <a href=\"/wiki/Brandywine\" title=\"Brandywine\" class=\"mw-redirect\">Brandywine</a> and <a href=\"/wiki/Greyflood\" title=\"Greyflood\">Greyflood</a>",
    "description": "Founded after the break-up of Arnor due to feuding amongst the sons of <a href=\"/wiki/E%C3%A4rendur\" title=\"E&#xE4;rendur\" class=\"mw-redirect\">E&#xE4;rendur</a>",
    "race": "<a href=\"/wiki/D%C3%BAnedain\" title=\"D&#xFA;nedain\">D&#xFA;nedain</a>,<br><a href=\"/wiki/Hobbits\" title=\"Hobbits\">Hobbits</a>",
    "spoken_languages": "<a href=\"/wiki/Westron\" title=\"Westron\">Westron</a>",
    "governance": "<a href=\"/wiki/Kings_of_Cardolan\" title=\"Kings of Cardolan\" class=\"mw-redirect\">Kings of Cardolan</a>",
    "founded_or_built": "<a href=\"/wiki/TA_861\" title=\"TA 861\">TA 861</a>",
    "lifespan": "TA 861 - TA 1636"
  },
  {
    "title": "Tower Hills",
    "page_id": "652",
    "text": "The TOWER HILLS or EMYN BERAID in Sindarin, were a series of steep hills\nlocated at the west end of Eriador.\n\nThey lay about 30 Númenórean miles east of Mithlond, the Grey Havens of\nLindon, and about 50 miles west of the White Downs, of old the border of\nthe Shire.\n\n\nHistory\n\nThe Tower Hills date back to Gil-galad's kingdom in Lindon when he built\nthree tall towers, the highest of which was called Elostirion which had\nheld an important Palantír that looked to Mithlond and the Far\nWest.\n\nThe Tower Hills formed the ancient border between the Elven realm of\nLindon and the Kingdom of Arnor, and the Great East Road which led all\nthe way to Rivendell ran through them.\n\nIn SR 1462, Elanor daughter of Samwise Gamgee and her husband _Fastred_\nmoved to the Tower Hills, founding the town of Undertowers on the\neastern slopes of the Hills, and becoming the _Wardens of Westmarch_,\nwhen the Tower Hills became the new western border of the Shire."
  },
  {
    "title": "Brandywine Bridge",
    "page_id": "643",
    "text": "The Brandywine Bridge or “Bridge of Stonebows” is a bridge going across\nthe Baranduin or Brandywine river. It was originally built some time\nbefore TA 1601 by the Numenoreans of Arnor. King Argeleb II allowed the\nHobbits to settle in the Shire if they kept the bridge in good repair\nand sped his messengers on their way. The only other ways to cross the\nriver are the Bucklebury Ferry, the Sarn Ford, or swimming across.\n\n\nTranslation Around the World\n\n  Foreign Language      Translated name\n  --------------------- ------------------\n  Chinese (Hong Kong)   烈酒橋\n  German                Brandyweinbrücke\n\nde:Brandyweinbrücke it:Ponte sul Brandivino nl:Brandewijnbrug pl:Most na\nBrandywinie"
  },
  {
    "title": "Arthedain",
    "page_id": "647",
    "text": "ARTHEDAIN was one of the three kingdoms of Middle-earth that resulted\nfrom the breakup of Arnor during the Third Age.\n\n\nHistory\n\n\n\nDuring the reign of Eärendur his sons were in open discord, which\nerupted into civil war after Eärendur's death in TA 861. Amlaith, the\ntrue heir to the throne of Arnor, was opposed by his two brothers.\nUnable to resolve the situation, he was reduced to ruling the region of\nArthedain, which consisted approximately of the lands west of the\nBrandywine River and north of the Great East Road. (His brothers created\nthe kingdoms of Cardolan and Rhudaur to the south.)\n\nThe kingdom's capital was at Fornost, and Bree was one of its most\nimportant towns. Annúminas was in the territory of Arthedain, but mostly\nabandoned and falling into ruin.\n\nIn TA 1300 the kingdom of Angmar appeared at Arthedain's north-eastern\nborder. Its King was the chief of the Ringwraiths, although this was not\nknown to the Dúnedain. When this new threat came Cardolan placed itself\nunder the suzerainty of Arthedain, which then began to call itself ARNOR\nagain. Cardolan repeatedly sent aid to Arthedain when needed but by TA\n1409 Cardolan and Rhudaur were conquered by Angmar.\n\nArthedain kept up the resistance against Angmar for over 500 years but\nin TA 1974 Arthedain was overrun and Fornost fell into the hands of\nAngmar. It fell just one year too soon for help was underway from Gondor\nunder the lead of Eärnur. This army reached Arthedain in TA 1975 and\ndestroyed Angmar at the Battle of Fornost.\n\nIts last King, Arvedui, drowned just before the battle was fought. The\nkings of Arthedain were also the lords of The Shire and the Shire chose\nthe Thain to replace the kings.\n\nThe son of Arvedui, Aranarth decided not to rebuild the kingdom and so\nbecame the first Chieftain of the Dúnedain. From him Aragorn is\ndescended.\n\n\nArthedain (people)\n\nThe ARTHEDAIN (Sindarin for _Edain of the Realm_) were the Dúnedain of\nthe old Kingdom of Arthedain.They were the purest-blooded descendants of\nthe Númenóreans among the Dúnedain of Arnor. Arthedain also came to an\nend and its lands remained mostly empty (except for the Shire) and its\npeople became Rangers. Rangers of the North, or simply THE RANGERS, were\nthe northern wandering people of Eriador, the last remnant of the\nDúnedain of Arnor\n\n\nEtymology\n\n_Arthedain_ was a Sindarin word that meant 'Realm of the Edain'.\nArthedain(people)\n\nwere the Dúnedain of the old Kingdom of Arthedain.They were the most\npure blooded descendants of the Númenóreans among the Dúnedain of the\nnorth.\n\nOther mannish peoples of the kingdom of Arthedain included:\n\n-   the Forodrim or eriadorian Northmen of the northern marches\n-   the Breelanders\n-   the Rivermen of Númeriador and the Baranduin\n-   the Lossoth, sometimes temporarily encamped in the northern borders\n    to the ice bay of Forochel. However, they mostly inhabited the far\n    northern Cape of Forochel, beyond the boundaries of any nation.",
    "type": "<a href=\"/wiki/Kingdom\" title=\"Kingdom\">Kingdom</a>",
    "location": "Western <a href=\"/wiki/Eriador\" title=\"Eriador\">Eriador</a>; west of <a href=\"/wiki/Baranduin\" title=\"Baranduin\" class=\"mw-redirect\">Baranduin</a> and the <a href=\"/wiki/Weather_Hills\" title=\"Weather Hills\" class=\"mw-redirect\">Weather Hills</a>",
    "capital": "<a href=\"/wiki/Fornost\" title=\"Fornost\">Fornost</a>",
    "description": "Founded after the break-up of Arnor due to feuding amongst the sons of <a href=\"/wiki/E%C3%A4rendur\" title=\"E&#xE4;rendur\" class=\"mw-redirect\">E&#xE4;rendur</a>",
    "race": "<a href=\"/wiki/D%C3%BAnedain\" title=\"D&#xFA;nedain\">D&#xFA;nedain</a>, <a href=\"/wiki/Hobbits\" title=\"Hobbits\">Hobbits</a>",
    "spoken_languages": "<a href=\"/wiki/Westron\" title=\"Westron\">Westron</a>, <a href=\"/wiki/Hobbitish\" title=\"Hobbitish\">Hobbitish</a>",
    "governance": "<a href=\"/wiki/Kings_of_Arthedain\" title=\"Kings of Arthedain\" class=\"mw-redirect\">Kings of Arthedain</a>",
    "founded_or_built": "<a href=\"/wiki/TA_861\" title=\"TA 861\">TA 861</a>",
    "lifespan": "TA 861 - <a href=\"/wiki/TA_1974\" title=\"TA 1974\">TA 1974</a>"
  },
  {
    "title": "Regions of the Shire",
    "page_id": "653",
    "text": "THE SHIRE is subdivided into several regions.\n\n\nFarthings\n\nThe original parts of the Shire were subdivided into four FARTHINGS\n(“fourth-ings” or “quarterings”): the Three-Farthing stone marked the\npoint where the borders of the Eastfarthing, Westfarthing and\nSouthfarthing of the Shire came together, by the Great East Road.\n\nThe Northfarthing\n\nThe Northfarthing is the least populated part of the Shire. This was the\nsite of the historic Battle of Greenfields.\n\n-   LONG CLEEVE was the home of the small part of the Took clan known as\n    the _North-Tooks_, descendants of Bandobras “Bullroarer” Took, who\n    settled here after the Battle of Greenfields.\n\n&nbsp;\n-   The village of HARDBOTTLE was the home to the Bracegirdle family of\n    Hobbits, to whom Lobelia Sackville-Baggins belonged. Some maps\n    erroneously place Hardbottle in the Southfarthing.\n\nThe Westfarthing\n\nThe western and most populated part of the Shire, this is the site of\nthe towns Michel Delving, Tuckborough (part of Took-land), and Hobbiton.\n\n-   MICHEL DELVING is the chief town of the Shire, located in the White\n    Downs. Its name means simply “large excavation”.\n\n        The Mayor of Michel Delving is the only elected official of The\n        Shire, elected on a seven year term.\n\n&nbsp;\n-   HOBBITON is the village where Bag End is located. This is the home\n    of Bilbo Baggins and Frodo Baggins and the site of the beginning and\n    conclusion of the novels _The Hobbit_ and _The Lord of the Rings_.\n    Sam Gamgee and his grandfather, the “Gaffer”, live on the lane of\n    _Bagshot Row_, below Bag End.\n\n&nbsp;\n-   Bywater is a village a short walk east of Hobbiton. It is best known\n    as the home of two inns, The Green Dragon Inn and The Ivy Bush.\n\nThe Southfarthing\n\nA rural and fertile area, the Southfarthing is the site of the towns\nGamwich (original home of the Gamgee family), Cotton, Longbottom and\nmuch pipe-weed production.\n\n-   LONGBOTTOM, a name meaning “long valley”, was founded by Tobold\n    Hornblower with the introduction of pipe-weed, in TA 2670, allowing\n    the region to become well established due to the success of the\n    pipe-weed industry.\n\nThe Eastfarthing\n\nBorders on Buckland, contains the towns Frogmorton and Whitfurrows and\nthe farms of the Marish. Originally, the Eastfarthing was under the\ncontrol of the Oldbuck family. Even after these became the Brandybucks,\nthe farmers of the Eastfarthing followed the Brandybucks rather than the\nThain and Mayor.\n\n-   THE YALE is the name of the low-lying lands of the Shire's\n    Eastfarthing that lay along the northern side of the long road from\n    Stock westwards to Tuckborough. This seems to have been a sparsely\n    populated area, and in fact the map of the Shire in _The Lord of the\n    Rings_ marks only a single building here.\n    -   The meaning of the Yale's name is obscure. The well-known\n        English personal and placename “Yale” has its origins in a Welsh\n        expression meaning “fertile upland.” Its use may suggest that\n        the Hobbits who named it had contacts with “strange” languages,\n        possibly those of Dunland.\n\n&nbsp;\n-   THE MARISH is the name of fertile, yet boggy farmlands located in\n    the Shire's Eastfarthing. It is where the Oldbuck family is believed\n    to have lived before Gorhendad Oldbuck removed the family across the\n    Brandywine to Buckland and changed their name\n\n\nOther parts of the Shire\n\nThe Buckland and Westmarch are sometimes reckoned part of the Shire,\nthough they are not part of any Farthing. Buckland was described in\nChapter V _A conspiracy unmasked_ in Fellowship of the Ring as being\n_“virtually a small independent country.. a sort of colony of the\nShire.”_ Westmarch became part of the Shire only after the end of the\nevents portrayed in Lord of the Rings, in the fourth age.\n\nBuckland\n\nLocation, villages and borders\n\nBuckland is located east of the Baranduin (Brandywine) river. The\nhobbits living in Buckland grew the High Hay, a hedge, to protect\nthemselves against evil from the nearby Old Forest, which borders\nBuckland to the east. Buckland is bordered in the north by the Hay Gate,\nthe only entrance to Buckland near the Brandywine Bridge. In the south\nthe borders of Buckland follow the High Hay until the Withywindle joins\nthe Baranduin near the village of Haysend. The most important town of\nBuckland is _BUCKLEBURY_ where the Brandy Hall is located, home of the\nMaster of Buckland, one of the important officials of the Shire.\n\nAn important landmark is the _BUCKLEBURY FERRY_, a raft-ferry used as\nthe second main crossing point of the Brandywine River from the Shire to\nBuckland, after the Brandywine Bridge (which is twenty miles further\nsouth). It is apparently left unmanned to be used by hobbit travellers\nas needed. En route to the new house at Crickhollow, Frodo, Sam, Merry\nand Pippin crossed using the Ferry just before the arrival of a Black\nRider, who was forced to go around to the Brandywine Bridge as there\nwere no boats kept on the western bank of the river.\n\nHistory and Culture\n\nBuckland was settled around TA 2340 by Gorhenhad Oldbuck, the ancestor\nof Meriadoc Brandybuck. Gorhenhad Oldbuck thus became the first Master\nof Buckland. He renamed himself Brandybuck, which remained his family's\nname.\n\nBecause Buckland is east of the Baranduin it isn't part of the land\ngiven to the Hobbits by King Argeleb II of Arthedain. It was thus not\npart of the Shire proper until the beginning of the Fourth Age when King\nElessar made Buckland and the Westmarch officially a part of the Shire.\n\nThe Bucklanders are unlike other hobbits as they are prepared for danger\nand are thus less naive than the Shire-hobbits. They close the Hay Gate\nand their own front doors at night and are prepared to rush to arms when\nthe Horn of Buckland is blown. Most Bucklanders were originally of Stoor\nstock, and they were the only Hobbits known to use boats.\n\nThe Westmarch\n\nAfter the events of the War of the Ring at the start of the Fourth Age\nof Middle-earth, King Aragorn Elessar granted the Hobbits of the Shire\neffective self-rule inside his Reunited Kingdom, banning any men from\nentering the land.\n\nHe also granted the Shire a stretch of new land: this reached from the\nancient western borders of the Shire, the White Downs, to the Tower\nHills.\n\nThe area between the downs and the hills became known as the WESTMARCH.\n\nThe eldest daughter of mayor Samwise Gamgee, Elanor the Fair, married\nFastred of Greenholm, and they moved to the Westmarch. After the passing\nof master Samwise, they and their children became known as the\n_Fairbairns of the Towers_ or _Wardens of Westmarch_, and the Red Book\nof Frodo and Bilbo Baggins passed into their keeping, becoming known as\nthe _Red Book of Westmarch_.\n\nGovernmentally, the Westmarch was a region of itself, and like Buckland\nacross the river Brandywine it was not part of any of the four Farthings\nof the Shire.\n\n Category:The Shire"
  },
  {
    "title": "Rhudaur",
    "page_id": "645",
    "text": "RHUDAUR was the smallest of the kingdoms that originated from the\nbreak-up of Arnor in TA 861. The other kingdoms were Arthedain and\nCardolan.\n\n\nHistory\n\nRhudaur formed the eastern part of Arnor, and stretched from the Weather\nHills with Weathertop to the river Loudwater. It shared a long border\nwith Cardolan along the Great East Road, and with Arthedain along the\nline of the Weather Hills.\n\nThe land between the rivers Hoarwell and Loudwater was also considered\npart of Rhudaur. It was called _the Angle_, and it is here that the\nfirst Stoor Hobbits came into Eriador around TA 1150. However, due to\nthe increasing hostility of Angmar these Stoors fled the region around\nTA 1356, with some of them moving west to the Shire, and others moving\nback to Wilderland.\n\n\n\nFrom the start of its existence, Rhudaur was unfriendly towards the two\nother successor states, and took part in a bitter conflict with\nArthedain over the Tower of Amon Sûl and the Palantír associated with\nthe tower.\n\n\n\nThe last Kings of Rhudaur were not of Númenórean blood, but were\ndescended of Men in service of Angmar. Under their rule the land became\na vassal of Angmar, and thus enemies of Cardolan and Arthedain.\n\nAngmar annexed and terminated the kingdom in TA 1409. By this time, the\nDúnedain were gone from the region, as well as most of the other\ninhabitants.\n\nThere is evidence that after the fall of Angmar at the Battle of Fornost\nthe Angle became home to the remainder of the Dúnedain, and the Rangers\nof the North established several villages there, where their people\nlived until the resurrection of the northern Kingdom under King Aragorn\nII Elessar at the end of the Third Age.\n\n\nEtymology\n\nThe _Haeranedain_ (S.“Far Wandering Edain”) were Rhudaurians of\nNúmenorean descent, most were actually mix-blooded Tergil. Most\nRhudaurian Dúnedain belonged to one of seven greater Noble Houses of\nHiri, House Amrothar, House Eldanar, House Enedil, House Melosse, House\nMithlad, House Rhudainor and House Rómentir.\n\nThe name Rhudaur appears to be dialect Sindarin for 'East Forests',\n\nThe _Rhudaurians_ (S.“Rhudaurim”) were the inhabitants of the fallen\nkingdom of Rhudaur, in the closer sense those of númenorean blood, the\nHaeranedain, in a wider sense all those eriadorian tribes living inside\nthe borders of Rhudaur including:\n\n-   the Hillmen of the Trollshaws and Coldfells\n-   the Vulseggi or northrons of the Egladil\n-   the Dunmen of the southern borderlands to Eregion and Cardolan\n-   the Forodrim of the Northern marches\n\n\nAppearance\n\nThe Haeranedain were a bit smaller and darker than the high Dúnedain,\nalthough 6 ft for men was not uncommon.\n\nIn daily life most had adapted clothes much similar to those of the\nindigenous Hillmen, the _Kailth_, a skirt or kilt, and the _Kullodoo_.",
    "type": "<a href=\"/wiki/Kingdom\" title=\"Kingdom\">Kingdom</a>",
    "location": "North-eastern <a href=\"/wiki/Eriador\" title=\"Eriador\">Eriador</a>",
    "capital": "Cameth Brin",
    "description": "Founded after the break-up of Arnor due to feuding amongst the sons of <a href=\"/wiki/E%C3%A4rendur\" title=\"E&#xE4;rendur\" class=\"mw-redirect\">E&#xE4;rendur</a>; later became a vassal for <a href=\"/wiki/Angmar\" title=\"Angmar\">Angmar</a>",
    "race": "<a href=\"/wiki/D%C3%BAnedain\" title=\"D&#xFA;nedain\">D&#xFA;nedain</a><br><a href=\"/wiki/Hill-men\" title=\"Hill-men\">Hill-men</a><br><a href=\"/wiki/Hobbits\" title=\"Hobbits\">Hobbits</a><br><a href=\"/wiki/Trolls\" title=\"Trolls\">Trolls</a>",
    "spoken_languages": "<a href=\"/wiki/Westron\" title=\"Westron\">Westron</a><br>Languages of Evil",
    "governance": "<a href=\"/wiki/Kings_of_Rhudaur\" title=\"Kings of Rhudaur\" class=\"mw-redirect\">Kings of Rhudaur</a>",
    "founded_or_built": "<a href=\"/wiki/TA_861\" title=\"TA 861\">TA 861</a>",
    "lifespan": "TA 861 - <a href=\"/wiki/TA_1409\" title=\"TA 1409\">TA 1409</a>"
  },
  {
    "title": "House of Bëor",
    "page_id": "657",
    "text": "The HOUSE OF BËOR was the oldest of the Three Houses of Men that had\nallied with the Elves in the First Age.\n\n\nHistory\n\nThe House of Bëor ceased to exist as an independent House after\nthe Dagor Bragollach, when Morgoth invaded their land and orcs overran\ntheir land.Some people did survive and the remaining led by Barahir\nstaged many attacks against the orcs but eventually they were betrayed\nand Barahir along with everyone else was slain by Morgoth.Beren was the\nonly survivor due to being sent to scout during the attack. Beren was\nnow the last person of the house of Bëor but in the Second Age some\nfamilies of Númenor still spoke Adûnaic with a notable Bëorian accent.\n\nFurthermore, the majority of faithful were those of Bëorian descent.\nThis was because the majority of the Men of Bëor had settled in the\nwestern part of Númenor, which later became the area controlled by the\nfaithful Lords of Andúnië. Traits of the House of Bëor were passed down\nto the Dúnedain of the Middle-earth and can be seen in Aragorn II\nElessar's physical description: lean, dark and tall, with “a shaggy head\nof dark hair flecked with grey, and in a pale stern face a pair of keen\ngrey eyes.”\n\n\nNotable members\n\n-   BËOR THE OLD, originally named Balan and later given the title _the\n    Old_, was leader of the House of Bëor, the first men to travel into\n    Beleriand. He met Finrod Felagund, who guided them to settle in\n    Estolad, east of Doriath. Bëor took service with Finrod in\n    Nargothrond. His name _Bëor_ meant _vassal_ in the Bëorian tongue.\n    He got his title, _the Old_, because he died at 93 years of age, of\n    which 44 were spent serving Finrod.\n\n&nbsp;\n-   BARAN was the eldest son of Bëor the Old and took up the leadership\n    of the House of Bëor when his father departed to Nargothrond. He\n    dwelt in Estolad and had two sons, BORON and BARANOR.\n\n&nbsp;\n-   BEREG, a grandson of Baran, was dissatisfied with Estolad, and led\n    part of the people away to parts unknown, disappearing from the\n    histories. It is possible some of his descendants were the ancestors\n    of the later Men of Eriador.\n\n&nbsp;\n-   BOROMIR was a son of Boron. The later Boromir of Gondor was named\n    after him. Boromir was granted the land of Ladros in Dorthonion as a\n    fief, and his house removed there.\n\n&nbsp;\n-   BREGOR was a son of Boromir and Andreth was Boromir's daughter.\n\n&nbsp;\n-   BREGOLAS, who died in the Dagor Bragollach, and BARAHIR were sons of\n    Bregor.\n\n&nbsp;\n-   BEREN was a son of Barahir, perhaps the greatest hero of the First\n    Age. He and Luthíen went to Morgoth and successfully cut a Silmaril\n    from his crown.\n\n&nbsp;\n-   BARAGUND was a son of Bregolas and a direct descendant of Bëor the\n    Old. He had one daughter, Morwen, and he was the grandfather of\n    Túrin Turambar. He survived the Dagor Bragollach and lived as an\n    outlaw with his uncle Barahir and some companions. They were\n    eventually betrayed by Sauron and killed."
  },
  {
    "title": "Estolad",
    "page_id": "661",
    "text": "ESTOLAD was a wide plain in East Beleriand.\n\nIt lay south of the forest of Nan Elmoth and west of Thargelion between\nthe rivers Celon and Gelion - and for a time was the realm of Amrod and\nAmras, the youngest of the Sons of Fëanor.\n\n\nHistory\n\nThe people of Bëor first journeyed to Estolad on the advice of Finrod\nFelagund, who often returned to visit them there; though Bëor went to\nNargothrond with Felagund and returned never to Estolad. The Green Elves\nof Ossiriand had sent word to Felagund begging him to remove the Men\nfrom their lands. When the Haladin came later over the Blue Mountains,\nthey encountered hostility from the Laiquendi and entered Thargelion, in\nthe land of Caranthir. They came to Estolad only after the loss of their\nlord Haldad in battle with the Orcs. The people of Marach came up the\nDwarf-Road to Estolad a year after Bëor's folk, and there the friendship\nbetween those houses was enriched.\n\nMany Elves journeyed to Estolad to look upon the Atani, the Second\nPeople. In turn, many young men went away to enter the service of Elven\nKings. Among the renowned Elf-friends who left Estolad with the Elves\nwere Malach or Aradan son of Marach, and Baran son of Bëor. These\nalliances led to the eventual departure of the Edain north to Dor-lómin\nand Ladros.\n\n\nEtymology\n\n_ESTOLAD_ is a Sindarin word that meant 'Encampment'."
  },
  {
    "title": "Nargothrond",
    "page_id": "659",
    "text": "NARGOTHROND (Sindarin IPA: ) was the Elven stronghold built by Finrod\nFelagund, delved into the banks of the river Narog in Beleriand during\nthe First Age.\n\n\nDescription\n\nSimilar to the structures of many underground Dwarven cities,\nNargothrond consisted of many miles of caves and tunnels of various\nshapes and sizes carved through the rock, which was possibly limestone.\nThere were three Great Halls centered around the other tunnels and\ncaves, where the Lord of the city no doubt sat. The deepest of the caves\nwas the Innermost Chamber where Glaurung later hoarded up the remaining\ntreasures of Nargothrond and sat upon them until he left. Lúthien lived\nin a southwestern cave chamber during her stay there. The realms\narmouries were in several chambers south of the Great Halls. The main\nentrance through the Doors of Felagund to Nargothrond facing river Narog\none came into a large chamber, which was about five-hundred feet from\nthe Great Halls of Felagund.\n\n\nHistory\n\nYears of Peace\n\nInspired by Menegroth in Doriath, and seeking a hidden place from which\nto be safe from the forces of Morgoth, Finrod established it in the\nearly years following the return of the Ñoldor to Middle-earth, in the\nCaverns of Narog beneath the forested hills of TAUR-EN-FAROTH on the\nwestern bank of Narog. He was aided by the Dwarves of Nogrod who also\nmade for him the Nauglamír, the Necklace of the Dwarves.\n\nHowever, Finrod was not the first to delve in those caves: it had first\nbeen inhabited by the Petty-dwarves, who called it NULUKKIZDÎN (Khuzdul\nIPA: ) before they were driven out. Originally, a narrow path along the\nbanks of the river could only reach it, but later a bridge was built\nacross the Narog.\n\nFinrod ruled Nargothrond until he joined Beren in his Quest for the\nSilmaril, being succeeded by his nephew Orodreth. However, the Sons of\nFëanor, Celegorm and Curufin lived in Nargothrond at this time and\ncarried a great influence with its people, sowing fear and distrust of\noutsiders. After Finrod's death was reported they were exiled in\ndisgrace.\n\nFall of Nargothrond\n\n[Túrin and Glaurung, by woutart \n\nSince its foundation by Finrod, the Elves of Nargothrond had pursued a\nsecretive war against Morgoth, hunting his forces by stealth and ambush\nrather than going to open war. When Túrin was led there by Gwindor,\nhowever, he grew high in the esteem of Orodreth, Lord of Nargothrond,\nand counseled a different strategy.\n\nTúrin Turambar became one of the chief captains, persuading the people\nto abandon their long standing policy and instead fight openly against\nMorgoth.\n\nTúrin persuaded Orodreth to build the Bridge of Nargothrond to allow\nspeedy passage of forces into the field. Orodreth built the bridge from\nhis doors across the Narog, and went to open war with Morgoth. In\ncenturies of searching, Morgoth had been unable to find the fortress of\nNargothrond, but now not only was its location revealed, but the new\nbridge removed the defence of the River Narog. Glaurung the dragon was\nsent out from Angband with an army of Orcs to capture the city. After\nthe defeat of the army of Nargothrond at the field of Tumhalad in FA\n495, Glaurung and his army of Orcs came south, crossed the bridge, and\nsacked the city, killing or selling some of the inhabitants into\nslavery. The survivors, then went to seek refuge in Doriath, and that's\nhow Thingol knew of the fall of Nargothrond.\n\nGlaurung remained there until FA 499 when he went northeast to Brethil,\nto confront Túrin Turambar who eventually slew him. Though the realm was\nno more, Mîm the Petty-dwarf took up residence in caves claiming it and\nits treasures as his own in payment for the sufferings of his people,\nuntil Húrin came and slew him for his betrayal of his son. The treasure,\nincluding the Nauglamír, was then brought to the Elven Kingdom of\nDoriath and given to King Thingol. Afterwards, the caves were\ndestroyed during the War of Wrath, along with all of Beleriand.\n\n\nEtymology\n\n_NARGOTHROND_ was a Sindarin word that meant 'Narog-fortress-vaulted\nhall'.",
    "type": "<a href=\"/wiki/Elven\" title=\"Elven\" class=\"mw-redirect\">Elven</a> realm",
    "other_names": "Nulukkhizd&#xEE;n",
    "location": "Beneath the forested hills of Taur-en-Faroth in the south-western part of <a href=\"/wiki/West_Beleriand\" title=\"West Beleriand\">West Beleriand</a>",
    "description": "Initially a settlement of <a href=\"/wiki/Petty-Dwarves\" title=\"Petty-Dwarves\">Petty-Dwarves</a>, and then a hidden stronghold of the Noldor",
    "spoken_languages": "<a href=\"/wiki/Quenya\" title=\"Quenya\">Quenya</a><br><a href=\"/wiki/Sindarin\" title=\"Sindarin\">Sindarin</a><sup id=\"cite_ref-1\" class=\"reference\"><a href=\"#cite_note-1\">[2]</a></sup>",
    "governance": "<a href=\"/wiki/Finrod\" title=\"Finrod\">Finrod</a><br><a href=\"/wiki/Orodreth\" title=\"Orodreth\">Orodreth</a> (last)",
    "founded_or_built": "<a href=\"/wiki/FA_52\" title=\"FA 52\">FA 52</a><sup id=\"cite_ref-annals_0-0\" class=\"reference\"><a href=\"#cite_note-annals-0\">[1]</a></sup>",
    "lifespan": "<a href=\"/wiki/FA_52\" title=\"FA 52\">FA 52</a> - <a href=\"/wiki/FA_495\" title=\"FA 495\">FA 495</a><sup id=\"cite_ref-annals_0-1\" class=\"reference\"><a href=\"#cite_note-annals-0\">[1]</a></sup>"
  },
  {
    "title": "Dorthonion",
    "page_id": "663",
    "text": "DORTHONION and later TAUR-NU-FUIN, also called OROD-NA-THON and also\nlater called DELDÚWATH, was a highland region of the First Age, lying\nimmediately to the north of Beleriand, and south of the plains of\nArd-galen (later Anfauglith) that bordered Morgoth's stronghold of\nThangorodrim.\n\n\nDescription\n\n\n\nDorthonion was 60 leagues east to west. In the north, it rose gradually\nfrom the plains, with great pine forests. The Ered Gorgoroth formed the\nsouthern boundary of Dorthonion, bending to the north on the east side\nto create the PASS OF AGLON between Dorthonion and Hills of Himring. To\nthe south and west of Dorthonion were the Echoriath, which surrounded\nthe hidden kingdom of Gondolin. The upper reaches of the River Sirion\npassed between the western slopes of Dorthonion and the Ered\nWethrin.\n\n\nHistory\n\nDorthonion was originally ruled by Angrod and Aegnor, sons of Finarfin,\nbut it was overrun by Morgoth in the Dagor Bragollach, after which it\nwas known as Taur-nu-Fuin which translates as _Forest under Night_ or\n_The Forest under the Shadow of the Night_.\n\nThe northeastern slopes of Dorthonion were known as Ladros, a fief given\nto Boromir of the House of Bëor. Here Barahir and a small band of\noutlaws dwelt until they were all slain at Tarn Aeluin by Orcs sent by\nSauron save for Beren, Barahir's son in FA 460. Beren dwelt alone in the\nwilderness of Dorthonion for a time until he left for Doriath and met\nLúthien.\n\nAlong with the other lands west of the Blue Mountains, Taur-nu-Fuin was\nmostly destroyed in the War of Wrath at the end of the First Age.\nAfterwards, its highest points survived as the island TOL FUIN (Isle of\nNight), part of the WESTERN ISLES.\n\n\nEtymology\n\n_DORTHONION_ was a Sindarin word that meant 'land of pines'."
  },
  {
    "title": "Crickhollow",
    "page_id": "686",
    "text": "CRICKHOLLOW was a village in Buckland located a few\nmiles north of Bucklebury.\n\n\nHistory\n\nIn TA 3018, Frodo Baggins bought a house in Crickhollow after leaving\nBag End, as he was about to exit the Shire."
  },
  {
    "title": "Uglúk",
    "page_id": "670",
    "text": "UGLÚK was the leader of the Uruk-hai scouts, who were sent to pursue the\nFellowship of the Ring in TA 3018, and a highly trusted servant of\nSaruman.\n\n\nBiography\n\nUglúk and his company were the ones who ended up capturing Merry and\nPippin at Amon Hen and headed towards Isengard. He was one of the\nlargest and strongest of the Uruk-hai and was a fierce fighter, managing\nto dismount Éomer and nearly kill him.\n\nBefore that, he had been the commander of those that raided the Wold,\nshortly before the Fellowship left Moria.\n\nAfter his capture of the two hobbits at the end of _The Fellowship of\nthe Ring_, Uglúk stood by his lord Saruman's demands when a band of\nSauron's Orcs, led by Grishnákh, tried to apprehend Merry and Pippin to\ntake them to Mordor, and he beheaded one of Grishnákh's followers to\nprevent Saruman's orders from being disobeyed.\n\nUglúk was ultimately killed when, within that week, Éomer and his\noutlawed Rohirrim attacked his band.",
    "titles": "Captain of the <a href=\"/wiki/Uruk-hai_scouts\" title=\"Uruk-hai scouts\">Uruk-hai scouts</a>",
    "birth": "3019",
    "death": "February 29, <a href=\"/wiki/3019\" title=\"3019\" class=\"mw-redirect\">3019</a>",
    "realms": "<a href=\"/wiki/Isengard\" title=\"Isengard\">Isengard</a>",
    "spouse": "None",
    "weapon": "Scimitar, whip",
    "race": "<a href=\"/wiki/Uruk-hai\" title=\"Uruk-hai\">Uruk-hai</a>",
    "gender": "Male",
    "culture": "Uruk-hai of <a href=\"/wiki/Isengard\" title=\"Isengard\">Isengard</a>",
    "actor": "<a href=\"/wiki/Nathaniel_Lees\" title=\"Nathaniel Lees\">Nathaniel Lees</a>"
  },
  {
    "title": "Buckland",
    "page_id": "680",
    "text": "BUCKLAND, later known as the EASTMARCH, was a small colony of the\nHobbits lying in between the Old Forest and the Brandywine River, which\nseparated the region from the Shire. Although it was colonized by\nShire-hobbits, it was not formally a part of the Shire until early in\nthe Fourth Age, hundreds of years after it was founded.\n\n\nLocation, Villages and Borders\n\nBuckland is located east of the Brandywine river. The hobbits living in\nBuckland grew the High Hay, a hedge, to protect themselves against any\nevil from the nearby Old Forest, which borders Buckland to the east.\nBuckland is bordered in the north by the Hay Gate, the only entrance to\nBuckland near the Brandywine Bridge. In the south, the borders of\nBuckland follow the High Hay until the Withywindle joins the Brandywine\nnear the village of Haysend. The most important town of Buckland is\n_BUCKLEBURY_ where Brandy Hall is located, home of the Master of\nBuckland, one of the important officials of the Shire.\n\nAn important landmark is the _BUCKLEBURY FERRY_, a raft-ferry used as\nthe second main crossing point of the Brandwine river from the Shire to\nBuckland, after the Brandywine Bridge (which is twenty miles further\nnorth). It is apparently left unmanned to be used by hobbit travellers\nas needed. En route to the new house at Crickhollow, Frodo Baggins, Sam\nGamgee, Meriadoc Brandybuck, and Peregrin Took crossed using the Ferry\njust before the arrival of a Black Rider, who was forced to go around to\nthe Brandywine Bridge as there were no boats kept on the western bank of\nthe river. \n\n\nHistory\n\nBuckland was settled around TA 2340 (SR 740) by Gorhendad Oldbuck, the\nancestor of Meriadoc Brandybuck. Gorhenhad Oldbuck thus became the first\nMaster of Buckland. He renamed himself Brandybuck, which remained his\nfamily's name.\n\nBecause Buckland is east of the Brandywine, it isn't part of the land\ngiven to the Hobbits by King Argeleb II of Arthedain. It was thus not\npart of the Shire proper until the beginning of the Fourth Age when King\nElessar made Buckland, now renamed the EASTMARCH, and the Westmarch\nofficial parts of the Shire.\n\n\nCulture\n\nThe Bucklanders are unlike other hobbits as they are prepared for danger\nand are thus less naive than the Shire-hobbits. They close the Hay Gate\nand their own front doors at night and are prepared to rush to arms when\nthe Horn of Buckland is blown. Most Bucklanders were originally of Stoor\nstock, and they were the only Hobbits known to use boats."
  },
  {
    "title": "Sackville-Baggins",
    "page_id": "687",
    "text": "The SACKVILLE-BAGGINS were a wealthy Hobbit family of the Shire in the\nlate Third Age.\n\n\nHistory\n\nThe family was founded by the marriage of Longo Baggins to Camellia\nSackville, heiress of the Sackville family headship. Their son, Otho\nSackville-Baggins, adopted a double name, kept by his wife Lobelia (née\nBracegirdle). The family was never well-liked as they were extremely\nobnoxious, snobby, rude, and greedy. They were obsessed with acquiring\nthe luxurious Bag End from their cousin Bilbo. They had almost succeeded\nin TA 2942 when Bilbo had disappeared a year earlier and was thought to\nbe dead. When this was not so, the family became more and more\ndetestable and for years denied that the Bilbo living in Bag End was the\nreal Bilbo Baggins. They were even more envious of Bilbo's wealth\nwhen he adopted Frodo as his heir.\n\nFrodo Baggins disliked them as they resented his inheritance. When Frodo\nwent away in September, TA 3018, they had finally gotten Bag End.\nLobelia's son Lotho had gained control of the Shire through alliance\nwith Saruman. When he was murdered, Lobelia was the last significant\nmember of the family and after her death the brief-lived family\ndisappeared.\n"
  },
  {
    "title": "House of Haleth",
    "page_id": "665",
    "text": "The House of Haleth (or the HALADIN) was the second of the Three Houses\nof Men.\n\n\nHistory\n\nHouse of Haleth were the descendants of Haldad, but the house was named\nafter Haldad's daughter Haleth, who led her people from East Beleriand\nto Brethil. They were a reclusive folk, dark-haired but smaller in\nstature than the Bëorians. They kept separate from the other Men. Their\nlanguage was different from that used by the other Edain.\n\nThe Haladin first had settled in Thargelion after arriving in Beleriand,\nsince they were unwilling to settle in Estolad with the Bëorians and\nMarachians. They were caught off-guard by an Orc-raid there, and a great\npart of their people was wiped out. The remnant, fighting under Haleth\nand her kin, held out for days in a stockade until the Ñoldor rescued\nthem. Impressed by their virtue Caranthir offered them his lands to live\nin protected, but Haleth refused, and later got permission to settle in\nthe forest of Brethil, part of Doriath but outside the Girdle of Melian.\nThey mostly kept out of the wars.\n\nThe Haladin were ruled by a HALDAD, father of Haldar brother of Haleth,\nbut they formed a lose alliance of clans rather than a strong nation as\nthe other Edain. The Haldad was in charge of a council of elders, which\ntook decisions for the entire people. The last Haldad of Haldar's line\nwas Brandir the Lame, who was killed by Túrin Turambar.\n\nHúrin Thalion wrought the final ruin of the Haladin when he came to\nBrethil. He caused a civil war which killed the last descendants of\nHaldad, and led a great part of the Haladin away south to Nargothrond.\nHe abandoned them after delivering the treasure to Thingol of Doriath.\n\nAfter the fall of Doriath the Haladin were nearly completely wiped out,\nor at least they had disappeared as a separate people. The last Drúedain\nof Beleriand did go to Númenor, suggesting at least a few Haladin\nsurvived as well, as the Drûg formed a part of their people. They must\nhave held out in Brethil forest or fled to the Mouths of Sirion with the\nother survivors.\n\nSome of the Second and Third Age nations of Men, such as Dunlendings,\nwere related to the Haladin, but were not recognised as Middle Men by\nthe Númenoreans because their speech was too different, and they were\nhostile.",
    "dominions": "<a href=\"/wiki/Thargelion\" title=\"Thargelion\">Thargelion</a> (formerly) and <a href=\"/wiki/Brethil\" title=\"Brethil\">Brethil</a>",
    "members": "<a href=\"/wiki/Haleth\" title=\"Haleth\">Haleth</a>, <a href=\"/wiki/Haldad\" title=\"Haldad\">Haldad</a>, <a href=\"/wiki/Haldar\" title=\"Haldar\">Haldar</a>, et al.",
    "height": "Somewhat shorter than those of the <a href=\"/wiki/House_of_B%C3%ABor\" title=\"House of B&#xEB;or\">House of B&#xEB;or</a>"
  },
  {
    "title": "Underhill",
    "page_id": "693",
    "text": "UNDERHILL is a very common Hobbit family name in both the Shire and\nBree. Underhill Village is also the name of a section of Hobbiton that\nis under Hobbiton Hill whence the Underhill family derived their\nnamesake. Underhill was the name used by Frodo Baggins during his\ntravels when he did not wish to be identified-- an example of this being\nhis time at The Prancing Pony in Bree. When some Underhills in Bree\nthink Frodo is an Underhill, they believed him to be one of their long\nlost cousins. Gandalf told Frodo that he should use the name Underhill\non his travels, to be safe.\n\n\nSee Also\n\n-   List of hobbit families"
  }
]