{
  "title": "Trolls",
  "lotr_page_id": "677",
  "text": "_For other uses, see Troll (disambiguation)._\n\nTROLLS were a very large and monstrous (ranging from between 10-50 feet\ntall), and for the most part unintelligent (references are made about\nmore cunning trollsTrolls were abroad, no longer dull-witted, but\ncunning and armed with dreadful weapons.\n\nJ.R.R. Tolkien (2009-04-17). The Lord of the Rings (p. 44). Harper\nCollins, Inc.. Kindle Edition. ), humanoid race inhabiting Middle-earth.\n\n\nHistory\n\nMelkor created trolls before the First Age. They were very strong, but\nturned into stone in sunlight. Many trolls died in the War of Wrath, but\nsome survived and joined the forces of Sauron, the greatest surviving\nservant of Morgoth. In the Second and Third Age, trolls were among\nSauron's most dangerous warriors. He created the Olog-hai, which were\nsmarter than earlier breeds of trolls. While most trolls cannot bear\nexposure to sunlight without turning to stone, the Olog-hai apparently\ncould (to the same extent as orcs); this attribute was mentioned in _The\nReturn of the King_ as making them particularly dangerous.\n\n[A mountain troll at the Black Gate, used for opening the gate]\n\nDuring Bilbo's quest to the Lonely Mountain, trolls were known to speak\nwith thick Cockney accents, specifically three hill trolls who dwelt in\nthe Trollshaws and had gotten there from the Ettenmoors . They turned to\nstone when exposed to sunlight, for stone, as told in _The Hobbit_, is\nwhat trolls were originally made of. They enjoyed eating anything they\ncould get their hands on. While threatening, the trolls in The Hobbit\nserve as a comic element. They even had normal names: Tom, Bert, and\nWilliam (Bill) Huggins (the only one with a given surname).[Armored\nMountain Troll]During the War of the Ring, Frodo and the Fellowship\nencountered cave trolls alongside various orcs within Moria. Boromir's\nsword recoiled off the scaled hide of one troll. As things seemed\nperilous, however, the trolls fled (although this was due to the\napproach of the far more threatening balrog, Durin's Bane). Sauron used\nOlog-hai in the Siege of Gondor and Battle of the Pelennor Fields. In\nthe subsequent Battle at the Black Gate, the hobbit Peregrin Took killed\na large Olog-hai troll with a huge sword. As a result of the One Ring\nbeing destroyed, the Black Gate collapsed into ruin during that battle.\nMost of the trolls present at the battle were killed, and the others are\nknown to have fled.\n\n\nPhysiology and characteristics\n\nThey were strong and vicious, but generally dim-witted and stupid at\nbest. Some were described as being able to speak, while others appear to\nbe as irrational as animals. The major weakness of at least some trolls\nwas that they turned to stone in sunlight. Their hide was as thick as\nstone and nigh-impervious to physical attacks. It is stated that they\nwere created by Melkor, although it's not clear exactly how. The Ent\nTreebeard says that trolls were “made in mockery” of ents, as Orcs were\nof elves, though not necessarily from Entish stock. However, they could\nbe based on another race of Middle-earth, as neither Morgoth nor Sauron\nhas access to the Secret Fire, and therefore cannot create things, only\nalter that which already exists. There is reference that sunlight will\nreturn them to the stone they were made from in _The Hobbit_ and _The\nLord of the Rings_. They seem to be fond of meat, and will eat almost\nany animal or being they come across. They also have very disgusting\nmanners.\n\n[A Cave Troll]\n\nDuring the wars of Beleriand, Gothmog, the Lord of Balrogs, had a\nbodyguard of trolls. While leading his men in a final stand to protect\nthe retreat of Turgon and the continued secrecy of the Kingdom of\nGondolin, the great warrior Húrin faced them and, due to Morgoth's\nemphatic orders to have Húrin captured alive, he managed to kill many of\nthem. Their apparently caustic blood, however, melted his axe, allowing\nOrcs to swarm over him and bind him, his capture ending the Nirnaeth\nArnoediad, where Morgoth triumphed over the united armies of Elves, Men,\nand Dwarves.\n\nDuring the Battle of the Pelennor Fields, there is a reference to\n“men-like half-trolls”, also called troll-men, but it is unclear whether\nthese men actually had some trollish ancestry or were simply compared to\ntrolls (for some readers, the first interpretation is supported by the\nsimilar and interchangeable terms “orc-men” and “half-orcs”, referring\nto crossbreeds of Saruman).\n\n\nTypes\n\n[Stone troll]Originating in Norse mythology, an extremely widespread\nbelief in its time, there are many types of trolls, each unique to its\ninhabitants:\n\n-   “Stone-trolls” were trolls who turned into stone during daylight,\n    like the trolls in _The Hobbit_. They could speak, and used a\n    debased form of Westron (presumably rendered into Cockney English in\n    Tolkien's “translation” of Bilbo's diary).\n\n&nbsp;\n-   Two-headed trolls are said in _The Hobbit_ to be more ferocious than\n    those with one head. It is unknown if they actually have two heads\n    or if it is a term for those working for Sauron, for he controlled\n    them, meaning they have two “heads”.\n\n&nbsp;\n-   Hill-trolls are described in the chronology at one instance as\n    having killed Arador, grandfather of Aragorn, at the Coldfells.\n    Tolkien described the trolls of that region, including the three\n    from The Hobbit, as stone trolls, suggesting that hill trolls might\n    be a subclass or alternate term for such. However, the Army of the\n    West fought “hill trolls” of Gorgoroth that could move in sunlight\n    at the Black Gate, inferring that these hill trolls, at least, were\n    Olog-hai rather than stone trolls. Hill trolls hardly differ from\n    stone trolls and were probably of the same beast-race.\n\n[A cave troll fighting Gondorian soldiers in the BFME series.]\n\n-   Cave-trolls were seen in Moria, and were also in the Ettenmoors. One\n    was described as having dark greenish scales and black blood. Their\n    hide was thick enough that when Boromir struck one on the arm his\n    sword was notched and did no damage. However, Frodo Baggins was able\n    to impale the “toeless” foot of the same troll with the enchanted\n    sword Sting.\n-   Mountain-trolls were mentioned once, wielding the great battering\n    ram Grond in shattering the gates of Minas Tirith. From their name,\n    they are generally assumed to live in the mountains, and their\n    choice as the creatures to wield Grond is sometimes taken to suggest\n    that they were particularly strong even for trolls.\n\n&nbsp;\n-   Snow-trolls are mentioned only in comparison to Helm Hammerhand.\n    When Helm went out clad in white during the Long Winter to stalk and\n    slay his enemies, he was described as being like a snow troll. It\n    thus seems implied that these trolls were white in colour and lived\n    in cold climates, but otherwise nothing is known of them.\n\n&nbsp;\n-   Olog-hai were “strong, agile, fierce, and cunning” trolls created by\n    Sauron, not unlike the Uruk-hai, and were able to withstand sunlight\n    while under the sway of Sauron's will.\n-   Half-trolls were troll-like humanoids from Harad who served Sauron\n    in The Battle of the Pelennor Fields. While it is unlikely that they\n    had any actual troll blood in them, it is still possible (but more\n    likely they were a superior breed of orcs and/or men).\n\n[A half-troll]\n\nThe Olog-hai were actually a breed of mountain trolls. They seldom spoke\nand were said to know no language other than the Black Speech, in which\nOlog-hai means “troll-folk” (singular olog, “troll”). Because of their\ncunning, they were (incorrectly) believed by some to be giant orcs\nrather than trolls. They appeared towards the end of the Third Age and\ncould be found near Dol Guldur and in the mountains around Mordor. In\nthe Battle of the Black Gate, there appear “Hill trolls” of Gorgoroth,\nwhich are implied to be Olog-hai in one of the appendices to The Lord of\nthe Rings (the term is not used within the story proper). These were\ndescribed as being taller and wider than men and their hide or armour\nwas described as a mesh of horny scales. They had black blood. Peregrin\nTook slew one of these trolls at the Battle of the Black Gate and, after\nthe destruction of the One Ring and the fall of Sauron, the surviving\ntrolls scattered as if mindless.\n\n\nOther names\n\n_Torog_ was the Elven (Sindarin) name for those of troll-kind. Tolkien\nnormally renders it as “troll” in his works. The derivation of this word\nis uncertain - it may be derived from old Elvish words or perhaps\nimitates olog, which seems to be the comparative term in Black Speech.",
  "origins": "Created by Morgoth in mockery of Ents",
  "locations": "Mordor, Ettenmoors",
  "affiliation": "Mostly Morgoth and Sauron",
  "rivalries": "Ents",
  "languages": "Black Speech, various Mannish tongues",
  "people": "Cave-trolls, Hill-trolls, Mountain-trolls, Olog-hai, Snow-trolls,\nStone-trolls, Troll-men and Half-trolls",
  "members": "William, Tom, Bert",
  "distinctions": "Strong beasts with limited intellect",
  "average height": "Large",
  "skin color": "Grey",
  "gallery": "Images of Trolls"
}