[
  {
    "title": "The Notion Club Papers",
    "page_id": "3450",
    "text": "THE NOTION CLUB PAPERS is the title of an abandoned novel that Tolkien,\nwrote during 1945 and published posthumously in _Sauron Defeated_, the\n9th volume of _The History of Middle-earth_.\n\n\nStory\n\nThe paper is a space/time/dream travel story, written at the same time\nas _The Lord of the Rings_ was being developed. The story itself\ninvolves the minutes of the meetings of an arts discussion club at\nOxford, a fictionalization of (and a pun on) Tolkien's own Club, The\nInklings.\n"
  },
  {
    "title": "The New Shadow Cult",
    "page_id": "25399",
    "text": "THE NEW SHADOW CULT was the topic of Tolkien's unfinished book, _The New\nShadow_.\n\nIt was to be a secret Melkorist religion of young misguided Men of\nGondor in the early Fourth Age, after the events of _The Lord of the\nRings_. It involves the worship of Saruman, Sauron, and Morgoth, led by\nsomeone named Herumor. Saelon, another key figure in the novel, might be\na possible member.\n\n\nTolkien's comment on _The New Shadow_\n"
  },
  {
    "title": "Finn and Hengest",
    "page_id": "6902",
    "text": "FINN AND HENGEST is a study by J.R.R Tolkien, edited by Alan Bliss and\npublished posthumously in book form in\n1982.\n\nIt is not a work of Middle-earth canon.\n\n\nAbout\n\nFinn and Hengest are two Anglo-Saxon heroes appearing in the Old English\nepic poem _Beowulf_ and in the fragment of “The Fight at Finnsburg”.\nHengest has sometimes been identified with the Jutish king of Kent. He\nand his brother Horsa (the names meaning “stallion” and “horse”) were\nthe legendary leaders of the first Anglo-Saxon immigrants to Britain as\nmercenaries in the 5th century).\n\nThe book is based on an edited series of lectures Tolkien made before\nand after World War II. In his lectures, Tolkien argued that the Hengest\nof “The Fight at Finnsburg” and of _Beowulf_ was an historical rather\nthan a legendary figure and that these works record episodes from an\norally composed and transmitted history of the Hengest named in the\n“Anglo-Saxon Chronicle.” This view has gained acceptance from a number\nof medieval historian and Anglo-Saxon scholars both since Tolkien's\ninitial lectures and since the publication of this posthumous\ncollection.\n\nTolkien's lectures describe what he called the “Jutes-on-both-sides\ntheory”, which was his explanation for the puzzling occurrence of the\nword ēotenas in the episode in _Beowulf_. Tolkien read the word as\nJutes, and theorized that the fight was a purely Jutish feud, and Finn\nand Hnæf were simply caught up by circumstance. Tolkien explained both\ntheir presence and their ambiguous loyalty with his following\ninterpretation of the story.\n\n\nSynopsis\n\nHnæf, son of Hoc Half-Dane, is the lord of a Danish people who have\nconquered part of Jutland (probably the northern part of the Cimbrian\npeninsula) and exiled its former Jutish rulers. Finn, king of Frys-Land\n(modern-day Friesland in the Netherlands) has allowed dispossessed Jutes\nto settle in his lands and enter his service. Finn marries Hnæf's older\nsister Hildeburh, and sends their son (whose name was probably\nFriðuwulf) to be fostered in Hnæf's household.\n\nAround the year AD 450, Hnæf sails to Frys-Land in the autumn; his\npurpose is to return Finn's now-grown son and spend the winter in Finn's\ncitadel, celebrating Yule. He brings a retinue of some sixty thanes.\nChief among these thanes is a Jute named Hengest, leader of a band of\nJutes who have taken service under Hnæf. Unfortunately, and foreseen by\nno one, when they arrive at Finn's stronghold they find that many of\nFinn's thanes are also Jutes, particularly one Garulf, who seems to be\nthe rightful heir to the kingdom conquered by Hnæf's people; and these\nFrisian Jutes are at blood feud with Hengest and his band, because\nHengest supports the conquering Danes, if for no other reason. This\nwould explain why Hildeburh “had no cause to praise the fealty of the\nJutes,” since that fealty led to the re-awakening of the feud, which\nkilled her brother, husband, and son.\n\nFinn (who seems guiltless in Tolkien's interpretation) tries to prevent\ntrouble by separating the parties, and allowing Hnæf and his thanes to\noccupy the royal hall, while he removes his own thanes to a different\nbuilding. However, the Frisian Jutes make a pre-dawn attack, hoping to\ntake Hengest and his band by surprise. But the Danes have been expecting\ntrouble, and a watchman sees the light of their approaching torches. He\nasks rhetorically, “What is this light? Is it the dawn in the East, or\nis it the flight of a dragon, or are the gables burning?” Hnæf answers,\n“Neither is this the dawn in the East, nor is it the flight of a dragon,\nnor are the gables of this hall burning,” it is an attack. Prepared, the\nDanes and Hengest's Jutes barricade the two doors of the hall against\nattack. Garulf is warned by one Guðhere not to risk his “precious life”\nin the assault, but he attacks and is the first to fall. Finn's Frisian\nthanes, who have ties of marriage and friendship to Finn's Jutish\nthanes, join in the fight against the Danes. The Danes hold the hall for\nfive days without losing a man. On the morning of the fifth day the\nFrisians force their way into the hall, and in the battle, both Hnæf and\nFriðiwulf are killed. (It is not clear which side Friðiwulf was fighting\non, but Tolkien thinks it likely he was staying in the hall with Hnæf,\nhis foster-father and uncle; this would explain why Beowulf emphasizes\nthat Friðiwulf was laid on the funeral pyre at Hnæf's side.) The\nsurviving Danes and Hengest's Jutes drive the Frisians and Jutes out of\nthe hall and re-barricade the door.\n\nAt this point Finn (who may not have joined in the fight personally)\nintervenes and offers to make a bargain with the survivors. As Tolkien\npoints out, the Danes had several advantages:\n\n1) Finn had lost so many men that he could not force his way into the\nhall again. 2) The Danes were occupying his royal hall, and he was\nunwilling to burn it to get them out. 3) Finn must have felt both guilty\nand ashamed that his feuding thanes had killed Hnæf, who was his\nbrother-in-law and guest. Inside the hall, the survivors are in two\ngroups: Danes, led by a chief thane who is described as Hunlafing (“the\nson of Hunlaf”) and Jutes, led by Hengest. The Jutes are Hengest's own\nband, and owed loyalty to Hnæf only because Hengest followed him. Finn\nat first tries to make peace with the Danes only, but the Danes loyally\ninsist that any peace agreement must include Hengest and his men. Finn\nagrees, and swears an oath of peace: the Danes and Hengest's men will\nlay down their arms, and since they cannot leave Frys-Land until the\nwinter ends, they will sit at Finn's table and technically accept him as\ntheir protector (since he was now their only possible source of food and\nmaintenance, and they had intended to be his guests throughout the\nwinter anyway.) Finn gives the Danes a separate hall to dwell in for the\nwinter, specifying that they shall share it with the sons of the Jutes\n(meaning Hengest and his band.) He also swears that any one of his own\nthanes who tries to renew the feud (by taunting the Danes that they now\nfollow the slayer of their lord) will be punished, possibly with death,\nby Finn himself. The bodies of Hnæf and Friðiwulf are honorably burned.\n\nOver the winter, the Danes and their Jutish allies brood over the fall\nof Hnæf. Hengest is faced with a conflict of duty: whether to honor the\npeace-treaty with Finn, or to honor his duty to avenge his fallen lord.\nFinally the son of Hunlaf takes a sword Hildeleoma (“Battleflame”) which\nwas probably Hnæf's sword, and lays it in Hengest's lap. Hengest “does\nnot refuse the world's counsel” (that is, he goes along with what\neveryone agrees is right) and decides that his loyalty to Hnæf must\noutweigh his obligation to Finn. (In any case, Tolkien points out that\nwe do not see Hengest swearing any oath to Finn; we only see Finn\nswearing oaths to Hengest and the Danes.) When the spring comes, the\nDanes sail home and tell the story of the downfall of Hnæf. They return\nto Finn's stronghold in force. Hengest, having remained in Frys-Land\nunder the guise of upholding the terms of the peace-treaty, opens the\ngates to the invaders and the Danes sack Finn's stronghold, kill Finn\nand all his men, loot and burn the city and return home, taking\nHildeburh with them."
  },
  {
    "title": "Mr. Bliss",
    "page_id": "6901",
    "text": "_MR. BLISS_ is a children's picture book by J. R. R. Tolkien,\npublished posthumously in 1982. It tells the story of Mr. Bliss and his\nfirst ride in his new motor-car. Many adventures follow like encounters\nwith bears, angry neighbors irate shopkeepers, and assorted collisions.\n\n\nAbout\n\nThe story line was inspired by Tolkien's own vehicular mishaps with his\nfirst automobile. The bears were based on toy bears owned by Tolkien's\nsons. Tolkien was both author and illustrator of the book. His narrative\nbinds the story and illustrations tightly together, as the text often\ncomments directly on the pictures. Despite not being published during\nTolkien's lifetime, he submitted the book to his publishers as a balm to\nreaders who were hungry for more from Tolkien after the success of _The\nHobbit_. The lavish ink and colored pencil illustrations would have made\nproduction costs prohibitively expensive so Tolkien agreed to redraw the\npictures in a simpler style, although that never came to happen.\n\nThe book was eventually published in 1982, with Tolkien's\ndifficult-to-read handwritten story and illustrations on one page, and a\ntypeset transcription on the facing page."
  },
  {
    "title": "The Children of Húrin",
    "page_id": "6109",
    "text": "THE CHILDREN OF HÚRIN (ISBN 0-618-89464-0) is the first of the Great\nTales. It is a story started by J.R.R. Tolkien in 1918 which was\npublished in 2007, once more than thirty years-worth of notes written by\nTolkien were compiled and edited by his son, Christopher.\n\nIt is the expanded account of the story of the wanderings and deeds\nof Túrin Turambar, son of Húrin, and his sister Niënor, their struggle\nagainst fate (and the curse cast upon Húrin's kin), as well as the\ntragic end of their lives and that of their mother, Morwen.\n\n\nThe Synopsis\n\nCHRISTOPHER TOLKIEN:\n\n\"There are tales of Middle-earth from times long before _The Lord of the\nRings_, and the story told in this book is set in the great country that\nlay beyond the Grey Havens in the North: lands where Treebeard once\nwalked, but which were drowned in the great cataclysm that ended the\nFirst Age of the World.\n\nIn that remote time Morgoth, the first Dark Lord, dwelt in the vast\nfortress of Angband in the North; and the tragedy of Turin and his\nsister Nienor unfolded within the shadow of the fear of Angband and the\nwar waged by Morgoth against the lands and secret cities of the Elves.\n\nTheir brief and passionate lives were dominated by the elemental hatred\nthat Morgoth bore them as the children of Hurin, the man who had dared\nto defy and to scorn him to his face. Against them he sent his\nformidable servant, Glaurung, a powerful spirit in the form of a huge\nwingless dragon of fire. Into his story of brutal conquest and flight,\nof forest hiding-places and pursuit, of resistance with lessening hope,\nthe mythological persons of the God and the Dragon enter in fearfully\narticulate form. Sardonic and mocking, Glaurung manipulated the fates of\nTúrin and Nienor by lies of diabolic cunning and guile, and the curse of\nMorgoth was fulfilled.\n\nThe earliest versions of this story by J.R.R. Tolkien go back to the end\nof the First World War and the years that followed; but long afterwards,\nwhen _The Lord of the Rings_ was finished, he wrote it anew and greatly\nenlarged it in complexities of motive and character: it became the\ndominant story in his later work on Middle-earth. But he could not bring\nit to final and finished form. In this book I have endeavoured to\nconstruct, after long study of the manuscripts, a coherent narrative\nwithout any editorial invention."
  }
]
