[
  {
    "title": "Phial of Galadriel",
    "page_id": "724",
    "text": "THE PHIAL OF GALADRIEL was given by Galadriel to Frodo Baggins as a\nlight to use in dark places.\n\n\nHistory\n\nThe Phial of Galadriel was a crystal phial filled with water from her\nfountain which held the light of Eärendil's star - the light of the Two\nTrees as preserved in a Silmaril.\n\nFrodo used the mere touch of it to ease the thought of the One Ring when\nhe, Sam Gamgee, and Gollum were watching the Witch-king lead his army\nout of Minas Morgul. He also used it while entering into Mordor to\ndefend himself from the spider Shelob. When Shelob first approached, Sam\nreminded him of the “star-glass” and its light drove her away. Frodo\ngave the light to Sam to hold while he cut through Shelob's webbing and\nSam wielded it when he attacked Shelob to rescue Frodo. The star-glass\nshone particularly bright in response to his indomitable spirit. He used\nit twice to get past the Two Watchers who guarded the tower of Cirith\nUngol; the second time the phial shone out lightning-bright in tribute\nto his hardiness and faithfulness.\n\n\n\nSam also attempted to use the light in the Crack of Doom but the light\nwas subdued by the power of the heart of Sauron's realm. The light was\none of the items found on him when he and Frodo were rescued by the\nEagles; Gandalf kept both it and Sam's box of Earth from Galadriel safe\nwhile the two hobbits were being healed after their collapse on the side\nof Mount Doom.\nThe Phial of Galadriel seemed to inspire its bearers to call out to\nElbereth, who is also known as Varda, as both Frodo and Sam call out in\nElvish. Frodo also cries out “aiya Eärendil elenion ancalima!” the first\ntime he uses it against Shelob. Although Frodo did not understand these\nwords, they were in reference to Eärendil, and they translate as “hail\nEärendil, brightest of stars!” from Quenya.\n\nAt the end of the Third Age, the Light of Earendil went to the Uttermost\nWest with Frodo.\n",
    "owner": "Galadriel\n\nFrodo Baggins",
    "creator": "Elves",
    "usage": "Served as light in dark places",
    "books": "_The Fellowship of the Ring_\n\n_The Return of the King_",
    "films": "_The Lord of the Rings: The Fellowship of the Ring_\n\n_The Lord of the Rings: The Return of the King_\n_The Hobbit: The Battle of the Five Armies_"
  },
  {
    "title": "Barrow-blades",
    "page_id": "2543",
    "text": "The BARROW-BLADES, also known as DAGGERS OF WESTERNESSE, were daggers\nfrom theBarrow-downs, given by Tom Bombadil to the four hobbits of the\nFellowship.\n\n\nDescription\n\nThe Barrow-blades have long, leaf-shaped blades, which is damasked with\nserpent-forms in red and gold. Fiery stones are set on the strange, yet\nlight and strong, metal. The blades gleam and are made of marvelous\nworkmanship.\n\n\nHistory\n\n The\nBarrow-blades were found in the barrow of a Barrow-wight on the\nBarrow-downs and given to the hobbits by Tom Bombadil, who told them\nthat the blades were forged long ago by Men of Westernesse, foes of the\nDark Lord who were overcome by the evil king of Carn Dûm in the Land of\nAngmar.\n\nFrodo's sword broke in the confrontation with the Nazgûl on the banks of\nthe River near Rivendell and was replaced at Rivendell by Bilbo's gift\nof the elvish sword Sting. Sam, Merry, and Pippin kept their swords. The\nBarrow-blades carried by Merry and Pippin were taken and discarded when\nthe two hobbits were captured by Uruk-hai at Amon Hen, but Aragorn saved\nthem and they were returned when they were reunited at Isengard. Merry's\nBarrow-blade played a major role in the Battle of the Pelennor Fields.\nIt was enchanted with the power to harm the Witch-king of Angmar himself\nby a weaponsmith of Arthedain long before. When he stabbed the\nWitch-king in the knee with it, it distracted the Nazgûl and broke the\nspell binding his undead flesh to his will, allowing Eowyn to kill him\nby driving her sword into his unseen head, thus fulfilling the prophesy\nof Glorfindel that “not by the hand of man shall he fall.” Merry's\nBarrow-blade then burned away, a fate common to weapons brought into\ncontact with the Witch-king. The sword is approximately 30 inches long,\nso as to be wielded by Hobbit-folk.\n\nPippin also used his Barrow-blade to kill a Troll at the Battle of the\nBlack Gate, and afterwards refers to it as a Troll's bane. He later\nwielded this Barrow-blade during the Scouring of the Shire. Sam left his\nsword with Frodo after presuming him dead from an encounter with Shelob,\nand it was later taken from Frodo's body by Shagrat and delivered to\nBarad-dûr with Frodo's Mithril coat. Both were later recovered from the\nMouth of Sauron by Gandalf, who returned them to Frodo and Sam.\n",
    "owner": "Frodo Baggins, Samwise Gamgee, Peregrin Took, Meriadoc Brandybuck",
    "creator": "Númenoreans",
    "books": "_The Lord of the Rings_",
    "films": "_The Lord of the Rings_ film trilogy"
  },
  {
    "title": "Angrist",
    "page_id": "2538",
    "text": "ANGRIST was a knife made by Telchar of Nogrod and borne by Curufin, one\nof Fëanor's sons. It was taken from Curufin by Beren, who used it to cut\na Silmaril out of Melkor's Iron Crown. However, as he was attempting to\nremove a second Silmaril, the knife broke and it cut Melkor. \n\n\nHistory\n\nDuring the First Age, Beren and Lúthien encountered Celegorm and Curufin\nin the forest of Brethil. A fight ensued when the brothers attempted to\nkidnap Lúthien. Curufin's knife, Angrist, was taken by Beren. Later,\nduring the Quest for the Silmaril, Beren used Angrist to cut the\nSilmaril from Melkor's crown. As Beren was trying to cut a second\nSilmaril, however, the knife snapped and its shard grazed Melkor on the\ncheek, awakening him. Angrist was left behind when Beren escaped\nAngband.\n\n\nEtymology\n\nIn Sindarin, ANGRIST means “Iron-cutter”, from _ang_ (“iron”) and _ris_\n(“to cut”).\n\n\nOther versions of the legendarium\n\nThe blade is first described in _The Lays of Beleriand_ in several of\nthe poems and stories, where it had been forged by the Wicked dwarves of\nNogrod.\n\nIn later versions and the version published in _The Silmarillion_, this\nblade became Angrist, which was originally the blade of Curufin. It\nstill maintained its Dwarven heritage, further being described as having\nbeen forged by Telchar of Nogrod (in earlier versions he was of\nBelegost). Although the evil connotations of it being enchanted dark\nweapon or having  'betrayed' him were played down or removed in the\npublished version.\n\nIn earliest versions of the story the knife was once taken from the\nkitchens of Tevildo.\n\nBeren and Lúthien reintroduces both of these accounts (along with the\nreintroduction of the treacherous dwarves) to the 'complete story' as\ntold in the 2017 release.",
    "owner": "Curufin, Beren",
    "creator": "Telchar",
    "usage": "For cutting",
    "books": "_The Silmarillion_\n_The History of Middle-earth_",
    "appearance": "Knife",
    "destroyer": "Beren/Morgoth\nAngband, F.A. 466",
    "notable for": "Removing a Silmaril from the Iron Crown"
  },
  {
    "title": "Ringil",
    "page_id": "2553",
    "text": "RINGIL was the sword of Fingolfin, the High King of the Ñoldor.\n\n\nHistory\n\nThe sword was of elvish make. It bit with chilling cold, a blade that\nglittered like ice by the light of the stars. Fingolfin wielded it to\ngreat effect against Morgoth during their duel before the gates of\nAngband, wounding him seven times. However, he was slain by the Dark\nLord, who broke Fingolfin's neck with his foot. With his last breath,\nFingolfin hewed Morgoth's foot with Ringil, rendering him lame for the\nrest of his existence. Ringil's ultimate fate is unknown, it may have\nbeen broken by Morgoth's foot, or it could have been stolen, and then\nexperienced a similar fate to Glamdring and Orcrist. It is likely that\nneither Morgoth nor his subjects would wish to handle the blade, after\nthe grievous injury it dealt to Morgoth.\n\n\nEarlier versions of the legendarium\n\nBefore the tales that make up the Quenta Silmarillion evolved to their\nfinal versions, _Ringil_ was a name of one of the lamp-pillars erected\nby Melko (Melkor) during the days of the coming of the Valar into\nMiddle-earth - the name of the other pillar being _Helkar_. Melko\n(Melkor) made the two pillars, of ice, and from the light they melted,\neventually forming seas and lakes.\n\nIn the final account (the chapter “Of the Beginning of Days” of _The\nSilmarillion_), the two Lamps of the Valar themselves have names, and\nthey are Illuin and Ormal - and it is Aulë, Yavanna, and Manwë who\ninvent them. _Ringil_ remained only the name of Fingolfin's sword, and\nbears the same meaning as it had before.\n\n\nEtymology\n\nThe name _RINGIL_ may have come from the Quenya _ringa_ (“damp, cold,\nchilly”) or _ringi_ (“cold”).",
    "owner": "Fingolfin",
    "creator": "Elves",
    "books": "_The Silmarillion_\n_The History of Middle-earth_"
  },
  {
    "title": "Pipe-weed",
    "page_id": "3131",
    "text": "PIPE-WEED (also known as HALFLINGS' LEAF) was grown and enjoyed much by\nthe hobbits of the Shire, to whom it was first introduced by a hobbit\nnamed Tobold Hornblower. It was first grown among hobbits by Tobold\nHornblower in Longbottom (a region in the Shire) around S.R. 1070 (TA\n2670). Despite its foreign origins, the hobbits (possibly those in Bree)\nwere the first to use it for smoking.\n\nPipe-weed production is a major industry there, especially in the south.\nIt was known among the Dúnedain as _sweet galenas_ for its fragrance.\n\n\n\nIn Gondor, it is known as '''Westman's-weed '''and grows as a wild\nplant, appreciated primarily for its sweet-scented flowers. The\ncolloquial name is in reference to its origins: it was apparently\nbrought to Middle-earth by Númenóreans during the Second Age.\n\nPopular varieties of pipe-weed include Longbottom Leaf, Old Toby (which\nis named after Tobold Hornblower), Southern Star, and Southlinch, which\nis grown in Bree.\n\nThe Wizard Gandalf learned to smoke\npipe-weed from the hobbits and is known to blow elaborate smoke-rings.\nSaruman initially derided him for this, but at some point he took up\nsmoking himself. After the destruction of Isengard, pipe-weed was found\namong its stores, but the hobbits Merry and Pippin failed to realized\nthe sinister implications of the discovery that Saruman has had commerce\nwith the Shire.\n\n\nSee Also\n\n\n\n-   Old Toby (disambiguation)\n-   Athelas\n\nde:Pfeifenkraut it:Erba Pipa ru:Трубочное зелье",
    "other_names": "Halfling's Leaf, Westman's Weed, Longbottom Leaf, Sweet Galenas, etc.",
    "owner": "Many unspecified Hobbits, Gandalf, Aragorn, Merry, Pippin, Saruman, et.\nal.",
    "creator": "Hobbits of the Shire, Gondorians, Dúnedain, et. al.",
    "usage": "For smoking in a pipe",
    "books": "The Fellowship of the Ring, The Two Towers, The Return of the King.",
    "films": "The Fellowship of the Ring, The Two Towers, The Return of the King."
  },
  {
    "title": "Horn of Gondor",
    "page_id": "6369",
    "text": "The HORN OF GONDOR is a horn that Boromir carried with him during the\nevents in _The Fellowship of the Ring _novel.\n\n\nHistory\n\nIt was a large war-horn and tipped with silver written in ancient\ncharacters. Boromir blew it before leaving Rivendell with the\nFellowship, as he always did when setting out on a journey. He sounded\nit again in Moria, causing the Orcs and even the Balrog to pause in\ntheir advance. The third time he blew it was on the banks of Parth\nGalen, calling for help in defending Meriadoc Brandybuck and Peregrin\nTook. This last call, in addition to being heard by Aragorn, Legolas,\nand Gimli, was faintly heard by his brother Faramir and his father\nDenethor II. The horn was broken into two pieces during Boromir's last\nfight with the Orcs and Uruk-hai of Saruman at Amon Hen.\n\nAn heirloom of the house of the Stewards of Gondor, the Horn of Gondor\nhad been carried by the eldest son for generations. The horn was crafted\nbefore the line of the Kings of Gondor was broken, when \"Vorondil the\nHunter father of Mardil Voronwë hunted the wild Kine of Araw in the far\nfields of Rhûn. The story surrounding the horn mentioned that it was\nmade from the horn of \" the wild ox of the East \" and that “if it be\nblown at need anywhere within the bounds of Gondor, as the realm was of\nold, its voice will not pass unheeded.”\n\n\n\nThe Horn of Gondor was not present in Faramir's vision of his dead\nbrother in the boat from Lórien. However, when Gandalf and Pippin arrive\nin Minas Tirith, the broken horn was being held by Denethor II,\nBoromir's father.",
    "other names": "Horn of Boromir",
    "owner": "Vorondil and descendants up until Boromir",
    "notable for": "Can be heard anywhere in Gondor",
    "appearance": "White horn tipped with silver",
    "creator": "Vorondil\nc. 20th century, Third Age",
    "destroyer": "Uruk-hai\nAmon Hen, 26 February T.A. 3019"
  },
  {
    "title": "Dragon-helm of Dor-lómin",
    "page_id": "8111",
    "text": "The DRAGON-HELM OF DOR-LÓMIN, also known as the DRAGON OF DOR-LÓMIN,\nDRAGON-HEAD OF THE NORTH, and the HELM OF HADOR, was a formidable\nDwarven war helmet from the First Age. It was most notably associated\nwith Túrin.\n\n\nDescription\n\n\n\nThe appearance of the helm was magnificent, adorned by Gold, on the\nbackground of Grey steel. At the top of the helm, the armor bore the\nsculpture of the Dragon, Glaurung, The Deceiver. The helm also had a\nvisor, “in the style of most dwarven armor.” The armor struck fear into\nthe hearts of the enemies of the wearer.\n\n\nHistory\n\nThe Dragon Helm is the ancient Dwarven-crafted war helm crafted by the\nDwarf-smith Telchar of Nogrod for the lord of Belegost, Azaghâl. Azaghâl\nthen gave it to Maedhros as a gift, who eventually passed it on to\nFingon. From then on, it remained in the keeping of the High Kings of\nthe Ñoldor that then passed it on to the Men who settled in Dor-lómin.\n\nThe helm was given to Túrin Turambar by his foster father, Thingol\nsometime between FA 463 and FA 473, and from Túrin's mother, Morwen, he\nhad received it. Since the helm was an heirloom in the House of\nHador, it is sometimes referred to as the Helm of Hador. However, Húrin\nwas not of the stature as the rest of his elders. He could not wear the\nHelm comfortably because he was of lesser stature than his forefathers.\nHe also said he preferred to look at the enemy with his own eyes.\n\nTúrin, however, was of greater stature than his father was and was able\nto unlock the magical properties of the ancient helm. It had the ability\nto protect the wearer from any harm or wound, major or minor: _“A power\nwas in it that guarded any who wore it from wound or death, for the\nsword that hewed it was broken, and the dart that smote it sprang\naside.”_",
    "other names": "Helm of Hador",
    "creator": "Telchar\nNogrod, c. F.A. 260",
    "appearance": "Visored steel helm, embelished with gold and runes, bearing a crest in\nthe image of the head of Glaurung",
    "gallery": "IMAGES OF THE DRAGON-HELM OF DOR-LÓMIN",
    "owner": "Azaghâl, Maedhros, Fingon, Hador, Galdor, Húrin, Túrin"
  },
  {
    "title": "Elfstone",
    "page_id": "10528",
    "text": "The ELESSAR or ELFSTONE was a green gem set on a silver eagle-shaped\nbrooch. It had the light of the Sun within it and those who looked\nthrough it saw everything that was aged and withered as young once more.\n\n\nOrigins\n\nThe elfstone was crafted by an elven-smith in Gondolin named Enerdhil,\nwhose skill in jewel-crafting was second only to Feanor. He gave it to\nIdril which she bore upon her breast during the fall of Gondolin,\naccounting for its escape, and in turn she gave it to her son Eärendil,\nwho bore it upon his breast on his flight to the Undying Lands.\n\nTwo versions are hereafter recorded as to the fate of the stone.\n\n-   Olorin brings the stone to Middle-earth as a sign that the Valar had\n    not forsaken Middle-earth. He gave it to Galadriel but he prophesied\n    that, “...it is not for you to possess. You shall hand it on when\n    the time comes. For before you grow weary, and at last forsake\n    Middle-earth one shall come who is to receive it, and his name shall\n    be that of the stone: Elessar he shall be called.”  (Aragorn, son\n    of Arathorn II).\n-   The stone remains with the Valar, and Galadriel longs to once more\n    return to Valinor but remains under the ban of the Noldor. Thus she\n    turns to Celebrimbor and laments to him, “I am grieved in\n    Middle-earth, for leaves fall and flowers fade that I have loved so\n    that the land of my dwelling is filed with regret that no spring can\n    redress. I would have trees and grass about me that do not die -\n    here in the land that is mine.” Celebrimbor, who is in love with\n    her, remakes the jewel and gives it to her. He learned the art of\n    elven blacksmithing in Gondolin when he was a friend of Enerdhil and\n    ever his friendly, competitive rival. Galadriel then passes the\n    stone to her daughter Celebrian, who in turn gives it to her\n    daughter Arwen. Galadriel keeps it once more in Lothlorien to pass\n    it on to Aragorn.\n",
    "other_names": "Elessar",
    "owner": "Aragorn, Arwen, Enerdhil, Galadriel, et. al.",
    "creator": "Enerdhil",
    "books": "The Lord of the Rings",
    "films": "The Lord of the Rings"
  },
  {
    "title": "Key to the Side-door",
    "page_id": "22040",
    "text": "The KEY TO THE SIDE-DOOR was a small curious-looking silver key with a\nlong barrel. It was used to open the secret entrance to the Lonely\nMountain, and for it there was a hidden keyhole.\n\n\nHistory\n\nLike the map, the key was made at an unknown time by Thrór and his son\nThráin before the fall of the Lonely Mountain. It was kept by Thrór and\nthen Thráin with the map. When Thráin was captured by the Necromancer,\nit was given to Gandalf in TA 2850 by Thráin just before he died in the\ndungeons of the Necromancer. The key and the map was presented to\nThorin the day that he and his fellow Dwarves visited Bilbo at Bag End\nin late April, 2941, and from that moment he kept it fastened to a chain\naround his neck.\n\nWhen Thorin and Company were at the place of Side-door, time began to\npass and the Sun began to fall and the Moon appeared and a hole appeared\nabout three feet from the ground. As the Dwarves attempted to force the\nrock without success, Bilbo suddenly remembered the key Gandalf gave\nThorin and told Thorin to use it to open the door before the light\ndisappeared that revealed it. Thorin took the key and put it in the\nkeyhole which caused the door-cracks to appear and the door to open.\n\n\nRunes\n\nIn _The Hobbit: An Unexpected Journey_, the key is ornately wrought and\nwith Dwarven runes written on both sides of the shaft. When translated,\nthese runes read “Durins Heir”, and are a reference to Thorin's\nancestor, Durin the Deathless.\n",
    "owner": "Thror\n\nThráin II\nThorin II Oakenshield",
    "creator": "Dwarves",
    "usage": "To open the side-door of Lonely Mountain",
    "books": "_The Hobbit_",
    "films": "__The Hobbit_ films_"
  },
  {
    "title": "Ring of Thrór",
    "page_id": "37457",
    "text": "The RING OF THRÓR was the mightiest of the seven dwarven rings.\n\n\nBackground\n\nThe RING OF THRÓR was the first of the Seven Dwarf-rings to be forged,\nand the last to be recovered by Sauron.\n\nWhile Sauron himself gave the Dwarves their Rings of Power, this one was\noriginally given to King Durin III of Khazad-dûm by Celebrimbor, and it\nremained in his line for thousands of years until it was inherited by\nThrór, the King under the Mountain.\n\nIt was during Thrór's reign that Smaug descended on Lonely Mountain and\ndrove the Dwarves into exile. Long after his kingdom's destruction,\nThrór passed the ring to his son Thráin, who dwelt for many years as an\nexile from his ancient home.\n\nAt last, Thráin set out on an ill-fated quest to regain his kingdom, but\nhe was captured by the spies of Sauron, and the Ring of Thrór was lost\nforever.\n\nMany Dwarves however did not know the fate of the Ring, and thought that\nit was lost in Moria when Thrór was killed by Azog. It was thought that\none of the reasons Balin wished to reclaim Moria was to find the Ring.\nIn the Council of Elrond, Gandalf told Glóin that Balin would not find\nthe Ring there, as it was given to Thráin and lost in Dol Guldur.\n",
    "owner": "Durin III, other Kings of Durin's Folk, Thrór, Thráin II",
    "creator": "Celebrimbor",
    "usage": "Amplified their wearer's natural skills and desire of dominion; the\npower to multiply whatever they mined",
    "books": "_The Lord of the Rings_",
    "films": "_The Hobbit films_"
  },
  {
    "title": "Morgul-blade",
    "page_id": "2551",
    "text": "MORGUL-BLADES, also called “Morgul-knives”, were magical and poisonous\ndaggers that were used by the Ringwraiths during the Third Age. After\nhaving tasted flesh, the dagger breaks, leaving a shard of the blade in\nits victim. The remaining blade soon turns to dust, and the shard works\nits way through the body to the heart. If the shard of the blade stays\nin the victim for too long, the victim becomes a wraith.\n\n\nHistory\n\n\n\nSince they are just short daggers, Morgul Blades may not have been very\neffective in battle. The blade might have been reserved for Mordor's\ngreatest enemies or for use as a punishment.\n\nFrodo himself was stabbed by a Morgul Blade at Weathertop by The\nWitch-king of Angmar. A fragment of the blade remained within Frodo's\nwound, working its way toward his heart and threatening to turn Frodo\ninto a wraith. Elrond was able to remove the shard and heal the wound,\nbut each year on the anniversary of receiving the wound Frodo became\nseriously ill. Only his eventual departure to Eldamar, also known as the\nUndying Lands, offered a permanent cure.\n\n\n\n_Athelas_ (or _Kingsfoil_) is known to slow the poisonous effect of the\nMorgul-blade, though true healing (usually Elven healing) is necessary\nin order to fully cure a victim. This remedy is also known to heal other\nMordor-associated illnesses, like the Black Breath of the Ringwraiths.\n",
    "other_names": "Morgul-knives",
    "owner": "Nazgûl",
    "books": "_The Lord of the Rings_",
    "films": "The Lord of the Rings trilogy\nThe Hobbit trilogy",
    "notable for": "Injuring Frodo"
  },
  {
    "title": "Simbelmynë",
    "page_id": "6747",
    "text": "SIMBELMYNË, also named EVERMIND, was a white flower that grew in Rohan,\nprimarily on the grave mounds of the Kings of Rohan, and most abundantly\non the burial mound of Helm Hammerhand.\n\n\nHistory\n\nDuring Tuor's arrival in Gondolin, he found these flowers and named them\n_UILOS_. These flowers also grew on Elendil's tomb in Amon Anwar, and\nwere there called _ALFIRIN_. Legolas also uses the name _alfirin_ (as\nwell as _mallos_) to refer to an apparently different type of flower,\ndescribed as “golden bells”, which could be found in Lebennin.\n\n\nEtymology and Inspiration\n\n_SIMBELMYNË_ is an Old English term which means “ever-mind” and was the\nterm used commonly in Rohan. The Elves called the same flower _uilos_\n(“snow white”) and _alfirin_ (“not mortal” ).\n\nThis flower was inspired by wood anemone (Anemone nemorosa), a European\nflower of the buttercup family. Tolkien stated this in _Nomenclature of\nThe Lord of the Rings_.\n",
    "other_names": "Evermind, Uilos, Alfirin"
  },
  {
    "title": "Iron Crown",
    "page_id": "3308",
    "text": "The IRON CROWN was forged by Morgoth in Angband, after his return to\nMiddle-earth at the beginning of the First Age, to hold the Silmarils\nand to symbolize him as King of the World.\n\n\nHistory\n\nThe three Silmarils were set into the Crown, fastened by iron claws. In\nthe Quest for the Silmaril, as told in the tale “Of Beren and Luthien”,\nBeren pried one Silmaril loose from the crown using his knife.  After\nMorgoth's defeat in the War of Wrath, the other two jewels were removed,\nand the crown was beaten into a collar for his neck.\n\nIn the Third Age, during the Witch-king's campaign against Arnor, he\nwore an Iron Crown, and his supporters often called him “The Iron Crown”\nor “The King of the Iron Crown”."
  },
  {
    "title": "Nimphelos",
    "page_id": "3436",
    "text": "Nimphelos was the greatest of the pearls that Thingol gave to the\nDwarves of Belegost in payment for their service in the building of\nMenegroth. Pearls were especially valuable to the Dwarves as they were\nnot fond of the sea and had no means of acquiring them except through\ntrade.\n\nNimphelos was said to have been the size of a dove's egg. It was\noriginally given to Thingol by Círdan the shipwright. It was found by\nthe Falathrim of the Isle of Balar.\n\n\nEtymology\n\nThe first part of the name “Nim” means white in Sindarin. “Phelos”\nlikely means pearl."
  },
  {
    "title": "Nivrim",
    "page_id": "3443",
    "text": "NIVRIM also known as OAK FOREST was one of the Forests of the Elven\nrealm of Doriath.\n\nNivrim was situated west of Region, southeast of Amon Rûdh, north of\nAelin-uial, south of the southeastern edge of Brethil, and was located\nwithin the Girdle of Melian. Both it and the forest of Region were\njoined by a bridge crossing the Sirion near where the river Esgalduin\njoined with it.\n\n\nHistory\n\nThe forest was loved by Queen Melian who dedicated it in honor of the\nVala Ulmo and that it should be in the power of the realm of Doriath\nproper, thus placing it within the Melian's protective barrier. Its\nfate was ultimately the fate of Doriath's as when Melian left\nMiddle-earth, it was left unprotected and wide-open to its enemies\nand finally destroyed and the end of the War of Wrath.\n\nThe forest was mainly a forest of oak trees hence the other name “Oak\nForest.”\n\n\nEtymology\n\n_Nivrim_ was Sindarin word that meant 'West March'."
  },
  {
    "title": "Angainor",
    "page_id": "3733",
    "text": "ANGAINOR was the chain used to contain Melkor in the Halls of Mandos.\n\n\nHistory\n\nAngainor was constructed by the Vala Aulë and held Melkor for three\nages. After this time, Melkor was judged and released by the Valar, as\nthey thought that he had been changed. However, Melkor went back to\nMiddle-earth and continued his evil ways under the name Morgoth. After\nhis defeat in the War of Wrath at the end of the First Age, Morgoth (as\nhe was now known) was found cowering in the lowest dungeon of his\nfortress Angband. He attempted to negotiate for pardon, but was again\nbound by Angainor, and his iron crown was made into a collar.\n\nThe two Silmarils that had been taken by Morgoth for his crown were\nretaken by Eönwë. Disgusted with Morgoth, the Valar thrust him through\nthe Door of Night beyond the Walls of the World, into the Timeless Void.\nThere he will remain imprisoned until the final battle, Dagor Dagorath,\nthe final judgment of the world.\n\n\nEtymology\n\nIn Quenya, _anga_ means “iron”.\n\n\nEarlier versions of the legendarium\n\nBefore becoming Angainor, the chain was known as Angaino, the Oppressor,\nwhich was coupled with Vorotemnar the manacles and Ilterindi, the\nfetters."
  },
  {
    "title": "Noirinan",
    "page_id": "3445",
    "text": "NOIRINAN was a valley on the southern slopes of the mountain Meneltarma.\n\n\nHistory\n\nWithin the rock of the mountain was a head chamber where the bygone\nKings and Queens of Númenor were entombed. \n\nHere was located a spring from the Siril river where Aragorn first met\nGandalf.\n\n\nEtymology\n\nNOIRINAN was a Quenyan word that meant “Valley of the tombs”. It came\nfrom the words NOIRË, meaning 'tomb', and NAN, meaning 'valley'."
  },
  {
    "title": "Ring of Isengard",
    "page_id": "3591",
    "text": "Three sides of Isengard were guarded by a large wall, known as the Ring\nof Isengard, which was only breached by the inflow of the river Angren\nat the north-east through a portcullis, and the gate of Isengard at the\nsouth, at both shores of the river. Inside the walls is found the\nOrthanc, one of the two towers."
  },
  {
    "title": "Star of Elendil",
    "page_id": "2723",
    "text": "The STAR OF ELENDIL was a white precious jewel made from Mithril and\nworn by Elendil and his heirs, and then by the chieftains of the\nDúnedain in Arnor.\n\n\nHistory\n\nThe Stars of Elendil were also called the _ELENDILMIR_, _THE STAR OF THE\nNORTH_, and _THE STAR OF THE NORTH KINGDOM_.\n\nThis jewel was passed down by way of Silmariën to Elendil, but probably\nwasn't a new creation and existed long before the end of Second Age. It\nwas lost somewhere in the period surrounding the fall of Arnor, at the\nsame time that Isildur was slain. The Kings and Chieftains of the North\nthen wore a new gem, which they had given the same name to replace the\noriginal Elendilmir.\n\nThe original was rediscovered by Saruman's agents while searching for\nthe One Ring, and Aragorn later recovered it from amongst Saruman's\ntreasure in Orthanc after the War of the Ring.\n\nIt is speculated that the jewel contained, like the Phial of Galadriel,\na tiny measure of the light of the Silmarils, which themselves contained\nthe light of the Two Trees.\n\n\nNote\n\nIn Foster's _The Complete Guide to Middle-Earth_ the Elendilmir is\nmistakenly identified with the Star of the Dúnedain which was given to\nSamwise Gamgee, but this is clearly an error."
  },
  {
    "title": "Nimloth",
    "page_id": "2497",
    "text": "NIMLOTH THE FAIR was the name of the White Tree of Númenor. It grew in\nthe King's Court in the royal palace in the capital city of Armenelos.\n\n\nHistory\n\nDuring the reign of Ar-Gimilzôr, the tree was neglected and fell into\ndecline but when his successor Tar-Palantir came to the throne it was\nagain tended. Later, sometime after SA 3262 when Sauron had the ear of\nthe powerful king Ar-Pharazôn and after Isildur stole one of its fruits,\nthe White Tree was felled and used as kindling in the Temple.\n\nDescendants\n\nA seedling of Nimloth was saved by Isildur and replanted in\nMiddle-earth, becoming the “White Tree of Gondor”.\n\n\nEtymology\n\nThe term _Nimloth_ consists of the Sindarin terms _nim_ (“white”) and\n_loth_ (“blossom”)."
  },
  {
    "title": "Dailir",
    "page_id": "2545",
    "text": "DAILIR was an unerring, ever-returning arrow that belonged to Beleg\nCúthalion. With his bow Belthronding, he used it many times.\n\n\nHistory\n\nDailir to be found unharmed when shot from Belthronding until it,\nprobably as a sign, was broken when Beleg fell upon it while he was\ncarrying the unconscious Túrin away from the orc-camp. Later that night,\nhe was accidentally killed by Túrin, who confused Beleg with an orc."
  },
  {
    "title": "Durin's Axe",
    "page_id": "2548",
    "text": "DURIN'S AXE was a great heirloom of the Dwarves of Durin's folk. It was\nthe axe of Durin I, the father of the Longbeard dwarves.\n\n\nHistory\n\nDurin's Axe remained in Khazad-dûm after it was deserted in the TA 1981\nyear of the Third Age. In TA 2989 it was found again by Balin's\nexpedition, and lost again in TA 2994 when the Dwarf-colony was\ndestroyed."
  },
  {
    "title": "Dagmor",
    "page_id": "2546",
    "text": "DAGMOR was the name of the sword that belonged to Beren, in the First\nAge.\n\n\nHistory\n\nAs a lone outlaw in Dorthonion, Beren carried Dagmor throughout his many\njourneys. It is presumably lost after his death.\n\n\nEtymology\n\nThe name _DAGMOR_ may from the Sindarin words _dag_ (“slay”) and _môr_\n(“dark, darkness”).\n\n\nOther versions of the legendarium\n\nThe sword's name was not mentioned in _The Silmarillion_; it is only\nmentioned in the Lay of Leithian in _The Lays of Beleriand_.",
    "owner": "Beren[1]",
    "usage": "For fighting",
    "books": "_The History of Middle-earth_",
    "appearance": "Sword"
  },
  {
    "title": "Red Book of Westmarch",
    "page_id": "2313",
    "text": "The RED BOOK OF WESTMARCH was a red-leather bound book written by the\nHobbit Bilbo Baggins and his household-heir Frodo Baggins, (with\nsupplemental information later added by Samwise Gamgee) which chronicled\nboth their adventures, as well as background information which the\nBagginses had collected.\n\nBilbo Baggins started the book and recounted his quest for Erebor, which\nhe called _There and Back Again_. He later gave the book to Frodo at\nRivendell after completing it, and Frodo organized Bilbo's manuscript\nand used it to write down his own quest during the War of the Ring.\n\n\nDescription and History\n\nInscribed within, it reads:\n\nBilbo's translations of legends from the Elder Days were also added to\nit, as were various Hobbit poems and a lot of background information on\nthe realms of Arnor, Gondor and Rohan, added to it by Peregrin Took and\nMeriadoc Brandybuck.\n\nAfter Bilbo and Frodo left for Valinor, the Red Book passed into the\nkeeping of Samwise Gamgee, mayor of Hobbiton. The book was left in the\npossession of Sam Gamgee's eldest daughter, _Elanor Fairbairns_, and her\ndescendants (the _Fairbairns of the Towers_ or _Wardens of Westmarch_).\nSeveral copies, with various notes and later additions, were made and\nthe original was kept in a red case (with a three-volume Elvish\nTranslation and a fifth volume ).\nCopies were passed on to future generations, of which one, the “_Thain's\nBook_”, is the most important.\n\nFrom the cover it is properly red colored; and has signature print on\nthe top, shaped as a shine of light. It also has stitch patterns and\nbeautiful marks around the edges. Bilbo Baggins' initials BB are in gold\nand it is very smooth, soft and silky to the touch. On the inside, there\nis a page of contents; writing each story by the four owners. There is a\nchance that The Adventures Of Tom Bombadil (a book of poems) was written\nby Samwise Gamgee. However it is unknown what Elanor Gamgee wrote.\n"
  },
  {
    "title": "Bow Of Galadhrim",
    "page_id": "40980",
    "text": "{{Object infobox |othername= Bow |image =Bow_1 |manufacturer=Elves made=\nWood |usage= Weapon |owners= Legolas |books= _The Lord of the Rings_\n|films=''The Lord of the Rings: Fellowship of the ring, two towers,\nreturn of the king.'' [[Category:Weapons"
  },
  {
    "title": "Master-stone",
    "page_id": "34467",
    "text": "The MASTER-STONE was the highest of all the Palantíri.\n\n\nHistory\n\nThe Master-stone was made at an unknown time by the Ñoldor prince Fëanor\nwhile he was still in Aman. Exactly where it was during the rest\nof the Years of the Trees and the First Age has not been recorded. The\nstone is only mentioned in the history of the Dúnedain in the time of\nElendil's rule of the exile kingdoms of Arnor and Gondor in Middle-earth\nafter the Fall of Númenor, as being in the Tower of Avallónë on Tol\nEressëa in the Undying Lands. It is recorded that Elendil, while using\nthe Elostirion-stone to gaze into west was believed to have been able to\nsee the Tower of Avallónë where the Master-stone was kept."
  },
  {
    "title": "Ringwraith sword",
    "page_id": "27636",
    "text": "The RINGWRAITH SWORD were long swords of black steel that were\nhand-forged in Mordor for the Ringwraiths, the deadliest servants of\nSauron.\n\nThey wielded these weapons mainly during the War of the Ring until their\ndeaths in March 25, 3019, when Sauron was finally destroyed."
  },
  {
    "title": "Bow of Bregor",
    "page_id": "25738",
    "text": "The BOW OF BREGOR of the House of Bëor was a bow used by Bregor, son of\nBoromir during his life in Middle-earth during the First Age.\n\n\nHistory\n\nThe bow was never mentioned in Bregor's lifetime only that it was an\nheirloom of House of Bëor and was preserved in Númenor by the royal\nfamily along with Dramborleg and the Ring of Barahir. It did not survive\nthe fall."
  },
  {
    "title": "Thrór's Map",
    "page_id": "21988",
    "text": "THROR'S MAP was the map used in _The Hobbit_ by Thorin and Company in\ntheir Quest to regain the Lonely Mountain.\n\n\nHistory\n\nThe map was drawn up at an unknown time by Thrór and his son Thráin\nElrond believed it was written on a midsummer night under a crescent\nMoon with the Moon-letters giving the directions on how to open the\ndoor. It illustrated the Lonely Mountain, the river that flowed from\nit, the lands surrounding it, and lastly the existence of the\nsecret-entrance on the western side of the mountain. It survived the\ndestruction of the kingdom in TA 2770 by Smaug and was kept by Thrór as\nan heirloom of his people. In TA 2790 when Thrór grew old and decided to\ngo off on an adventure of his own to the Mines of Moria, the map was\ngiven to his son Thráin for safe-keeping. In TA 2841, Thráin left\nhis home in the Blue Mountains with a small company to try his luck with\nthe map, intending to reach the Lonely Mountain despite the threat from\nSmaug, but he never got there. Instead, he was taken prisoner by the\nOrcs of Dol Guldur and imprisoned in its dungeons by Sauron. Sauron took\nhis Dwarven Ring of Power.\n\nThe Moon-letters on the map read: ''Stand by the grey stone when the\nthrush knocks and the setting sun with the last light of Durin's Day\nwill shine upon the key-hole.\n\nIn TA 2850, Gandalf went to Dol Guldur in secrecy and found Thráin dying\nin captivity but before he died he gave Gandalf the map and the key to\nthe secret entrance, and entrusted him to pass it on to his son\nThorin. The map was presented to Bilbo during their visit to Bag\nEnd in late April, 2941 and used throughout their adventure."
  },
  {
    "title": "Elendilmir",
    "page_id": "21827",
    "text": "ELENDILMIR was a token of royalty\nthroughout the Kingdom of Arnor crafted and presented to the High King\nof Gondor and Arnor, Elendil the Tall.\n\n\nDescription\n\nElendilmir was a radiant white gemstone set on a silver fillet and was\nregarded as the Royal Gem of Arnor.\n\n\nHistory\n\nElendilmir was lost at the great massacre in the east, the Disaster of\nthe Gladden Fields, when King Elendil's eldest son, Isildur, and the\nDunedain of Arnor were marching home after the defeat of Sauron. The\ncompany were ambushed by a large group of Orcs from the Misty Mountains\nwho slaughtered many including Isildur, with only three men to come out\nalive. It is a mystery exactly how Elendilmir was lost, but it _is_\nknown that the One Ring was found at the bottom of the Gladden River\nwhere it had slipped off Isildur's finger when he was killed. This may\nbe where Elendilmir was lost.\n\nIn the Unfinished Tales (later published by Christopher Tolkien) it is\nstated that Aragorn II finds the Elendilmir in the tower of Orthanc.\nAfter Sauron's defeat, Aragorn (with the help of Gimli the Dwarf) finds\na hidden door and a steel cabinet. In that cabinet they find a small\ngolden tube without any inscription (the One ring was most likely hidden\nin here by Isildur), and the Elendilmir. Aragorn brings it back to Minas\nTirith and wears it once again, but only on special occasions as he will\nnot risk any more harm to it.\n\nAnother version of the Gemstone was made at a later date by Isildur's\ndescendants, a second Elendilmir, commemorating King Elendil and Isildur\nhimself. It was borne roughly around TA 2940, or most likely later.\n\nde:Elendilmir es:Elendilmir it:Elendilmir pl:Elendilmir ru:Элендильмир"
  },
  {
    "title": "Grond (Warhammer)",
    "page_id": "12225",
    "text": "GROND was the great warhammer of Morgoth, the first Dark Lord, which he\nwielded in the First Age. It was also referred to as the HAMMER OF THE\nUNDERWORLD, and was extremely powerful.\n\n\nHistory\n\nForged in an unknown time and place, Grond was mentioned only once, as\nthe weapon of Morgoth in his single combat with Fingolfin, High King of\nthe Ñoldor. Fingolfin had challenged Morgoth after the Ñoldor's\ndevastating defeat at Dagor Bragollach.\n\nEvery blow of the hammer brought down a lightning strike and left a\ncrater. Fingolfin evaded it, and struck Morgoth seven great wounds,\nfilling the pits with the enemy's blood. At last Fingolfin stumbled into\none of the craters and was pinned by the Dark Lord's left foot. As\nMorgoth readied a death blow, Fingolfin stabbed one last time, at his\nfoot. The blow crippled Morgoth, already weakened by his labors\nin corrupting Arda and grasping the Silmarils, and he limped for the\nrest of his life on earth.\n\nDuring the Third Age, Sauron, Morgoth's great servant and successor,\nrecalled his master's Hammer when he built a huge battering ram to break\nthe gates of Minas Tirith during the Siege of Gondor, also naming it\nGrond.\n\n\nEtymology\n\nThe name _Grond_ means “club”, from the Quenya _rud-_ or _runda_ (“rough\npiece of wood”). In Sindarin, the name means “very weighty and\nponderous”.\n\nAlso, ''Grond ''means “ground” in Dutch, perhaps referring to the fact\nthe hammer was able to form craters into the ground.",
    "other_names": "Hammer of the Underworld[1]",
    "owner": "Melkor",
    "books": "_The Silmarillion_\n_The History of Middle-earth_"
  }
]