[
  {
    "name": "Entmoot",
    "lotr_page_id": "911",
    "text": "The ENTMOOT was a rare gathering and meeting of Ents.\n\nIn Fangorn Forest, these moots were always held in Derndingle, a\nbowl-like valley far south of Treebeard's home. Since the Ents' language\nwas so descriptive and extensively slow, an Entmoot would endure\nunbearably long.\n\nThe Entmoot held in _The Lord of the Rings_ was held from February 30 to\nMarch 2, 3019, of which the subject was the decision whether the Ents\nshould go to war against Saruman. It lasted from noon on the first day\ntill afternoon on the third day, and by Ents, it was considered quick\nfor an Entmoot. \n\n\nEtymology\n\nA moot is a regular gathering of people having a common interest, hence\nan Entmoot is a gathering of Ents.",
    "founder": "Treebeard",
    "notable_members": "Treebeard, Bregalad, Beechbone",
    "purpose": "Discussion for Ents",
    "notable_for": "Last March of the Ents",
    "location": "Derndingle in Fangorn Forest"
  },
  {
    "name": "Great Plague",
    "lotr_page_id": "582",
    "text": "The GREAT PLAGUE, known also as the DARK PLAGUE, was a disastrous\npestilence in Middle-earth during the Third Age.\n\n\nHistory\n\nBeginning\n\nThe Great Plague began in the east beyond Mordor, reaching Osgiliath in\nTA 1636 just a year after King Minardil of Gondor had been killed at\nPelargir by the Corsairs of Umbar, and only two centuries after the\nKin-strife of Gondor. The new king, Telemnar was killed together with\nhis kin, as well as many others of the Dúnedain. Together these events\nserved to further destroy the people of Gondor.\n\nMovement of the Plague\n\nThe Plague had first hit Rhûn and Rhovanion, and after the plague had\npassed more than half the folk of the Kingdom of Rhovanion had been\nkilled. From Osgiliath the plague spread west and then north. Enedwaith\nand Dunland were scarcely affected, but the Plague regained strength as\nit went north, and Minhiriath (the southern part of Cardolan) was\nespecially hit hard. The last of the Dúnedain of Cardolan died on the\nBarrowdowns, and evil spirits from Angmar and Rhudaur entered the realm.\n\nArthedain further to the north was scarcely affected, while the Shire\nwas hit harder, with the Hobbits suffering great losses. Arthedain\nstill defended Fornost to the north.\n\nThe city of Osgiliath was especially hit hard, suffering the highest\ncasualties outside of Rhovanion. Many fled the city and re-located to\nIthilien and Anórien, and Minas Anor became the King's seat there.\n\nAfter the Plague\n\nThe casualties were so high that the fortresses guarding Mordor were\nabandoned as the troops were recalled. For the next two centuries\nGondor, as well as its enemies, did little but try to regain strength.\nEventually Gondor did recover and garrisoned the fortresses for a short\ntime.\n",
    "other_names": "Dark Plague",
    "description": "Pestilence from south of Mordor, spreading north, west and then north",
    "date": "T.A. 1635-7; effects visible for the next 200 years",
    "participants": "Men of Darkness, Gondorians, Dúnedain of Arnor, Hobbits, Woodmen",
    "location": "Harad, Gondor, Eriador, Rhovanion, Rhûn (possibly)"
  },
  {
    "name": "Council of Elrond",
    "lotr_page_id": "7316",
    "text": "The COUNCIL OF ELROND was the secret council called by Elrond in\nRivendell in order to decide what should be done with the One\nRing, during the Great Years in the Third Age.\n\nThose present at this council were people who were of the three largest\nraces of good in Middle-earth: Men, Elves, and Dwarves.\n\n\nSynopsis\n\nDuring the Council, the full story of the Ring was told by Bilbo and\nGandalf. Elrond and the others agreed that this was indeed the One Ring,\nbased on evidence provided by Gandalf.\n\nGandalf related his meeting with Saruman and subsequent imprisonment by\nthe traitor in Orthanc.\n\nBoromir described the dream he and his brother Faramir had experienced,\nand which led him to come to Rivendell. He pleaded that the Ring should\nbe used to aid Gondor in her struggle against Mordor, but was told that\nit would inevitably corrupt anyone who used it. Only a mighty person\ncould hope to wield the Ring against Sauron, and they would in time\nbecome a new Dark Lord whether they wished it or not. Boromir\nreluctantly accepted this conclusion.\n\nGlóin, Gimli's father, spoke of evil messengers who had come to the\nLonely Mountain promising the return of one or more of the Seven rings\nif they would reveal the location of Bilbo Baggins. The possibility of\nwar with Sauron's allies in the region was troubling, but Gandalf was\nrelieved that at least Smaug the dragon was no longer around for the\nDark Lord to use. They had also came seeking news of what happened to\nBalin, who went to Moria in TA 2989 with Ori and Óin.\n\n\n\nLegolas conveyed the bad news that Gollum had escaped captivity and\ndisappeared. Aragorn had gone to great lengths to capture the debased\ncreature, who had possessed the Ring for centuries under the Misty\nMountains. After his capture, Aragorn and Gandalf had interrogated the\nmiserable Gollum, and found to their dismay that he had been to Mordor.\nApparently, while under torment there, Gollum had confessed both that he\nhad held the One Ring and that Bilbo had taken it to the Shire.\n\nAfter much debate about the fate of the Ring, it was decided that the\nonly way to be free of Sauron's evil was to cast the Ring into the\nCracks of Doom in Mount Doom (in Mordor), where it would be unmade. This\nmight well undo the power of the three Elf-rings, but would certainly\nrender Sauron impotent and free Middle-earth from his menace forever.\n\nTom Bombadil was also mentioned as a possible ring bearer since the ring\ntook no effect on him, but Gandalf stated that Tom would most likely\nlose it as Tom seemed to be very nonchalant about the War of the Ring.\n\nIt then became necessary to decide who should take responsibility for\nsuch a perilous undertaking. Bilbo offered to finish the job he had\nstarted, but Gandalf told him he could not take back the Ring. Frodo\nsurprised everyone (including himself) by announcing that he would take\nthe Ring, and after some thought Elrond agreed. At this point Sam\nemerged from hiding and demanded to accompany Frodo, and since it was\nhardly possible to separate them Elrond agreed.\n\nThe matter of who else should accompany Frodo (later to be known as the\nFellowship of the Ring, hence the title of the book and subsequent\nmovie) was decided later, although the movie version of _The Fellowship\nof the Ring_ depicts the choosing of the Fellowship as taking place at\nthe end of the Council, and has Merry and Pippin also eavesdropping on\nthe proceedings and demanding to accompany Frodo.\n\n\nPresent individuals\n\nThose present at the Council had arrived at Rivendell by different paths\nand on separate errands, yet they were all ultimately concerned with the\nRing and its effect upon the people of Middle-earth. Important\nparticipants at the Council were:\n\n-   Elrond - a Half-elven conveyor, member of White Council and lord of\n    Rivendell.\n-   Erestor - an Elf-lord, advisor, and the chief of the House of\n    Elrond.\n-   Gandalf the Grey - a Wizard, one of the Istari, and member of both\n    the White Council and The Fellowship.\n-   Aragorn - a Ranger, heir of Isildur, member of The Fellowship, and\n    Chieftain of the Dúnedain in the North.\n-   Frodo Baggins - a Hobbit of the Shire, member of The Fellowship, and\n    Ring-bearer.\n-   Bilbo Baggins - a Hobbit of the Shire, former Ring-bearer, uncle of\n    Frodo and long resident in Rivendell.\n-   Boromir of Gondor - son of Denethor II Ruling Steward of Minas\n    Tirith, and member of The Fellowship.\n-   Glóin of the Lonely Mountain - representative of the King under the\n    Mountain, Dain Ironfoot of the Dwarves.\n-   Gimli - son of Gloin, member of The Fellowship, and dwarf of the\n    Lonely Mountain.\n-   Legolas - a Sindar Elf of the Woodland Realm (Mirkwood), son of\n    Thranduil the Elvenking, and member of The Fellowship.\n-   Glorfindel - an Elf-lord of Rivendell, rescuer of Frodo and his\n    company from the Nine.\n-   Galdor of the Havens - messenger from Círdan of the Grey Havens.",
    "location": "Rivendell",
    "result": "Formation of the Fellowship of the Ring",
    "date": "25 October, T.A. 3018",
    "participants": "Elrond, counselors of Elrond and other Elves, Gandalf, Men, four\nHobbits, Dwarves from Erebor"
  },
  {
    "name": "Awakening of Men",
    "lotr_page_id": "7943",
    "text": "The AWAKENING OF MEN describes the emerging of Mankind from the slumber\nof Eru Ilúvatar.\n\n\nHistory\n\nMen who were created by Eru Ilúvatar, awoke in the easterly land of\nHildórien which was a land southeast of Cuiviénen, at the first\nrising of the first Sun These Children of Ilúvatar awoke during the time\nwhen the Elves of the Ñoldor were already returning from Valinor to\nMiddle-earth. Men were befriended by the Dark Elves, of which there\nwere few, but were also approached by Morgoth. The Men were divided into\nmany different groups. Two were seen in the First Age: the Edain and the\nEasterlings, also known as the Swarthy Men.\n\nWhen the Elves had awakened, Middle-earth was still lit only by stars\nand they had no fear of the night, thus Oromë called them the People of\nthe Stars: Eldar. However Men were awakened when the Sun first arose\nin the heavens and the Elves therefore called them the Children of the\nSun, the Night-fearers.\n\nAccording to legends of the Edain, Morgoth visited Men while they were\nstill in Hildórien seeking their allegiance and converted them away from\nEru Ilúvatar, and were convinced that Men were made mortal in divine\npunishment. However this was merely a trait bestowed upon men by Eru and\nnot out of any punishment. To escape the evil of Morgoth and his\nfollowers, the Atanatári were the first to flee Hildórien, travelling\nwest and eventually coming to Beleriand.",
    "location": "Hildórien",
    "description": "The creation of Mankind",
    "date": "F.A. 1[note\\ 1]",
    "result": "The existence of Men in Arda",
    "participants": "Eru, Men",
    "part_of": "Eru's plan for Eä"
  },
  {
    "name": "Awakening of the Elves",
    "lotr_page_id": "2631",
    "text": "The AWAKENING OF THE ELVES is an event which took place long before the\nbeginning of the First Age of Middle-earth.\n\nAccording to a legend of the Elves, the first Elves were awakened by Eru\nIlúvatar near the bay of Cuiviénen. The first Elf to awake was called\nIMIN (“First”). Next to him lay IMINYË, who would become his wife. Near\nwhere Imin woke, awoke TATA (“Second”) and TATIË, and ENEL (“Third”) and\nENELYË.\n\nImin, Tata, and Enel and their wives joined up and walked through the\nforests. They first came across six pairs of Elves, and Imin, as eldest,\nclaimed them as his people, and woke them. After a short time Imin and\nhis people, together with Tata and Enel, continued their journey. Next,\nthey came across nine pairs of Elves, and Tata as second eldest, claimed\nthem as his people. After a short time the now thirty-six Elves\ncontinued their journey. Then they found twelve pairs of Elves, and\nEnel, as third eldest, claimed them as his people.\n\nFor many days the now sixty Elves dwelt by the rivers, and they began to\ninvent poetry and music.\n\nFinally they set out again, but Imin thought to himself that since each\ntime they had found more Elves and his folk was least in size, he would\nnow choose last.\n\nThey came across eighteen pairs of Elves, who were watching the stars,\nand Tata and Enel waited for Imin to claim them for his people, but Imin\ntold them he would wait, so Tata added them to his folk. They were tall\nand had dark hair, and they were the fathers of most of the Ñoldor of\nlater times.\n\nThe ninety-six Elves now spoke with each other and invented many new\nwords, but then they continued their journey. Next they found\ntwenty-four pairs of Elves, who were singing without language, and again\nImin was offered the choice, but refused. Therefore Enel chose them as\nhis people, and from them came most of the Lindar or singers of later\ntimes.\n\nAnd the hundred and forty-four Elves now dwelt long together, until all\nhad learned the same language, and they were glad. But then Imin said it\nwas time to seek more companions for him, but most of the others were\ncontent and did not join him. So Imin and Iminyë and their twelve\ncompanions set out alone, and they searched long near Cuiviénen, but\nnever found any more companions.\n\nAnd because all Elves had been found in groups of twelve, twelve became\nthe number they counted with ever after, and 144 was for long their\nhighest number, and in none of their later tongues was there therefore\nany common name for a greater number.\n\nAfter the tale of the Awakening of the Elves the _Companions of Imin_ or\nthe Eldest Company (the later Vanyar) numbered fourteen, and they\nremained the smallest company. The _Companions of Tata_ (half of whom\nbecame the Ñoldor) numbered fifty-six, and they remained the\nsecond-largest company. The _Companions of Enel_ (the later Lindar or\nTeleri) were the largest company, numbering seventy-four.\n\nMelkor was the first to learn of the Awakening. He soon began sending\nevil spirits among the Elves, who planted seeds of doubt against the\nValar. It is also rumoured that some of the Elves were being captured by\na Rider if they strayed too far, and the Elves later believed these were\nbrought to Utumno and twisted into Orcs.\n\nOromë one day came across the Elves, and realized who they were. At\nfirst the Elves were suspicious of him, fearing he was the Rider who\ncaptured the Elves, and because of the lies of Melkor. Nevertheless,\nthree lords of the Elves agreed to come with Oromë to Valinor. These\nwere Ingwë of the _Minyar_ (later _Vanyar_), Finwë of the _Tatyar_\n(later _Ñoldor_), and Elwë of the _Lindar_. In due time, Ingwë, Finwë\nand Elwë returned to Cuivienen, and told the Elves of the glory of\nValinor, and there befell the Sundering of the Elves. All the Minyar and\nhalf of the Tatyar were persuaded, along with most of the Lindar, and\nfollowed Oromë into the west on the Great Journey. These have been known\never since by the name Eldar, or “Star-folk”, which Oromë gave to them\nin their own language. The remainder of the Tatyar and Lindar remained\nsuspicious, or simply refused to depart from their own lands, and spread\ngradually throughout the wide lands of Middle-earth. They were after\nknown by the name Avari, meaning 'the Unwilling', because they refused\nthe summons, in Quenya, the language of the Eldar that eventually\nreached Valinor.\n\n------------------------------------------------------------------------\n\nThe tale of Imin, Tata and Enel, known as _CUIVIENYARNA_, was a very\nlate writing by Tolkien, written as part of _Quendi and Eldar_. They\nreplaced Ingwë, Finwë and Elwë as the eldest Elves, who now merely\nbecame the first ambassadors and the Kings of the Elves in exile.\n\nit:Risveglio degli Elfi ru:Пробуждение эльфов",
    "participants": "Eru, the Elves",
    "result": "The existence of Elves in Arda",
    "date": "Y.T. 1050",
    "description": "The creation of the Elves",
    "location": "Cuiviénen",
    "part_of": "Eru's plan for Eä"
  }
]