[
  {
    "title": "The Return of the King (1980 film)",
    "page_id": "2787",
    "text": "_THE RETURN OF THE KING_ (subtitled _A STORY OF THE HOBBITS_) is an\nanimated adaptation of the novel by J. R. R. Tolkien that was released\nby Rankin/Bass as a TV special in 1980. It has since been released on\nVHS and DVD.\n\nThe film was created by the same team that had worked on the 1977\nanimated version of _The Hobbit_.\n\n\nPlot\n\nThe film begins with Bilbo Baggins celebrating his 129th birthday in\nRivendell. When he notices that Frodo is missing a finger, he asks for\nan explanation. Gandalf introduces the Minstrel of Gondor to recall the\nstory of the One Ring, going all the way back to when Bilbo found it in\nGollum's cave many decades prior.\n\nA flashback begins with the Ring sitting in Bag End. As the years pass,\nits power grows stronger and stronger. Gandalf takes notice of this and\ntells Frodo that the Ring must be taken in Mordor and destroyed in\n“fires where it was wrought”. Should Frodo fail, all of Middle-earth\nwill be ended by the Ring's maker, Sauron. Frodo and his companion,\nSamwise, depart the Shire for Mordor. After many daring adventures, they\nreach Mordor's borders, only for Frodo to be captured and imprisoned in\nCirith Ungol.\n\nSam, after trying and failing to infiltrate the tower, takes it upon\nhimself to be Ring-bearer in Frodo's absence and heads for Mount Doom.\nBut he is stopped when he feels the Ring's weight growing on him and a\nstrong temptation to claim it for himself almost overcomes him. He stops\nhimself when he realizes that he already has everything he could ever\nwant back home. Realizing that he is not fit for the task, he makes his\nway back to Cirith Ungol to rescue Frodo. After successfully\ninfiltrating the tower and fighting his way to Frodo, Sam returns the\nRing to him and, disguised as Orcs, they manage to escape just as the\ntower collapses.\n\nMeanwhile, at the Gondorian capital of Minas Tirith, Gandalf and Pippin\nbear witness as the forces of Mordor prepare to attack the city. They\nturn to Denethor II for help, trying to reassure him that, thanks to the\nRed Arrow, King Théoden and the army of Rohan are on their way. But they\nare dismayed to discover that the Steward has gone mad, referring to\nvision seen through a palantír of the West burning. He orders his own\ndemise, leaving Gandalf and Pippin to face the invasion, with Gandalf\nbeginning to lose hope.\n\nIn Mordor, Frodo and Sam press their way on, with Frodo becoming weaker\nand weaker as they progress. At one point, they are mistaken for Orcs\nand are forced to join a legion heading back to Cirith Ungol. When a\nlegion of Easterlings prevents the Orcs from going any further, Sam\nbegins a riot between the two armies, allowing him and Frodo to escape.\nOnce they are out of sight, they find a cave and spend the night there.\n\nAfter days of searching, Frodo and Sam arrive at Mount Doom, only to\nfind Gollum waiting for them. He attacks the two, trying to seize back\nhis “Precious”. Sam holds him off, allowing Frodo to make for the Cracks\nof Doom. When Sam follows, he finds Frodo reluctant to finish the task.\nThe power of the Ring overtakes him and he claims it, as Sam is forced\nto watch in horror.\n\nThéoden's forces arrive at Pelennor Fields just as the gates to Minas\nTirith are broken down. But the tides turn when the Witch-king of Angmar\nattacks and kills Rohan's king. Coming to avenge her uncle, Éowyn sheds\nher soldier disguise and, with Merry's help, slays the Witch-king. At\nthe same time the battle is won, Aragorn, the heir to the throne of\nGondor, arrives and plans an attack on Mordor. When they arrive at the\nBlack Gate, the Mouth of Sauron mockingly advises that they turn back.\nAragorn stands his ground, refusing to back down.\n\nAt the same time, Sam searches for Frodo in Mount Doom and finds Gollum\nfighting with him for the Ring. Gollum bites off Frodo's finger and\nreclaims the Ring. As he dances with joy, he loses his footing and falls\ninto the magma chamber, simultaneously killing himself and destroying\nthe Ring. Sauron is finally vanquished. As Mount Doom begins to\ncollapse, Frodo and Sam attempt to escape and are almost killed by the\nflowing lava when they are rescued by the Eagles. They are taken to\nMinas Tirith, where they witness Aragorn's coronation.\n\nAs the Minstrel ends the tale, Frodo agrees to come with Bilbo, Elrond,\nand Gandalf as they prepare to set sail into the west and to the Undying\nLands, leaving Middle-earth forever. He passes on the Red Book of\nWestmarch to Sam, saying that he will finish it with stories of his\npeaceful life in the Shire. Gandalf reassures Sam that someday, his kind\nwill have human descendants and when they hear the tale of the Ring,\nthey will wonder: “Is there hobbit in me? Is there?”\n\nAt the Grey Havens, Sam, Merry, and Pippin watch from afar as a ship\nwith Frodo, Elrond, Gandalf, and Bilbo on board disappears into the\nwest.\n\n\nProduction\n\nOrson Bean returned as the voice of the older Bilbo Baggins, as well as\nthat of the story's hero, Frodo Baggins. John Huston was back as well,\nas the beloved wizard Gandalf, and co-starring with them were: William\nConrad as Denethor, Roddy McDowall as Samwise Gamgee, Theodore Bikel as\nAragorn the King himself, and reprising his darkly spoken role of Gollum\nwas the grumpily dangerous Brother Theodore. Rankin/Bass stalwart Paul\nFrees replaced Cyril Ritchard (who had died not long after completing\nhis voice work on _The Hobbit_) as the voice of Elrond; Casey Kasem,\nbest known for his role as Shaggy in Hanna-Barbera's Scooby-Doo, was\nMerry with Sonny Melendrez as Pippin; Nellie Bellflower as Eowyn; and\nGlenn Yarborough returned as principal vocalist, billed here as simply\n“the Minstrel of Gondor”.\n\nVoices\n\n-   Orson Bean - Frodo, Bilbo\n-   Theodore Bikel - Aragorn\n-   William Conrad - Denethor\n-   John Huston - Gandalf\n-   Roddy McDowall - Sam\n-   Theodore - Gollum\n-   Paul Frees - Elrond, Orc, Uruk-hai\n-   Don Messick - Theoden, Easterlings, The Mouth of Sauron\n-   John Stephenson - The Lord of the Nazgul, Gondorian Guard\n-   Casey Kasem - Merry\n-   Sonny Melendrez - Pippin\n-   Nellie Bellflower - Eowyn\n-   Glenn Yarbrough - The Minstrel of Gondor\n\n\n\nReception\n\nReception for the animated TV special is varied. Some commentators view\nit affectionately as an adaptation which children and parents can enjoy\ntogether 1. However, others regard it with disdain, comparing it\nunfavorably to Ralph Bakshi's earlier animated film and Peter Jackson's\nlater live-action film 2, 3. Glenn Yarborough's songs are widely\nderided, although some admit to a campy affection for the surprisingly\ntuneful Orc marching song “Where There's a Whip, There's a Way” or the\nballad “Frodo of the Nine Fingers” 4.\n\nThe film currently garners as 67% Fresh rating on Rotten Tomatoes\n\nMarketing\n\nIn the absence of an official sequel to Ralph Bakshi's _The Lord of the\nRings_, _The Return of the King_ has come to be marketed by Warner Bros.\nas the final part of a loose animated Tolkien trilogy, preceded by _The\nHobbit_ (to which Rankin/Bass originally presented _The Return of the\nKing_ as a direct sequel). The middle film is very different in tone and\ncharacter design, however, and the final two films do not join up\nseamlessly, as both omit various segments from The Two Towers, most\nnotably regarding the events in Shelob's lair and the Ents' march on\nIsengard. Other omissions in the Rankin/Bass version include the\ncharacters of Legolas, Gimli, Arwen, Saruman, Éomer, and Faramir (though\nit's possible the latter makes a brief appearance; there is an\nunidentified Man - who has no lines of dialogue - who accompanies Éowyn\non horseback during Aragorn's coronation, and the two of them exchange\nrather knowing looks). Even Aragorn doesn't have much dialogue or\nscreentime despite being the 'King' of the movie's title.\n\nThe animated _Return of the King_ is available on DVD from Warner Bros.,\nboth individually and as a “boxed trilogy” with the Rankin/Bass _Hobbit_\nand Bakshi's _Lord of the Rings_."
  }
]
