[
  {
    "title": "Dwarves of Belegost",
    "page_id": "46045",
    "text": "The DWARVES OF BELEGOST were a people of Dwarves who dwelt in the city\nof Belegost, the northernmost of the two great Dwarf-cities that stood\nin the Blue Mountains during the First Age.\n\nThey had generally better relations with the Elves than their neighbors\nin Nogrod, and were behind the building of Menegroth. The Dwarves of\nBelegost were friends to the Sindar and later allies of the Noldor of\nBeleriand. They first met the Noldor Elves near Mount Rerir and a great\nfriendship began between the two peoples; Maedhros once saved Lord\nAzaghâl from an Orc-assault. They joined the Union of Maedhros and\nfought bravely beside each other during the Nirnaeth Arnoediad, where\nthey lost their ruler Lord Azaghâl in battle to the dragon Glaurung.\n\nWhen the Dwarves of Nogrod assembled a great host of Dwarves to attack\nDoriath, the Dwarves of Belegost tried to dissuade them from war, but\ntheir brethren from Nogrod did not heed their advice. These Dwarves went\non to fight in the Battle of the Thousand Caves, and later met their\ndemise the Battle of Sarn Athrad. After this tragedy the Dwarves of\nBelegost started leaving for Khazad-dûm, for fear of reprisal from the\nElves. There was much loathing between Elf and Dwarf from there on.\n\nBelegost was later ruined in the War of Wrath, and most of the dwarves\nleft for Khazad-dûm. Some stayed to build, or rebuild, new homes and\nmines, along with the remaining Dwarves of Nogrod.\n\nIn smithing, the Dwarves of Belegost were second only to the Dwarves of\nNogrod. They learned many secrets in smithing from the Elves, and Elves\nfrom them. They created many weapons for the Elves when evil began to\nstir in Beleriand, and the smiths of Belegost were the first to create\nlinked ring mail.\n"
  },
  {
    "title": "Mirkwood warriors",
    "page_id": "35374",
    "text": "MIRKWOOD WARRIORS are warriors of the Woodland Realm.\n\n\nHistory\n\nIn TA 2941, they participated in the Battle of the Five Armies. They are\nsimilar to the Galadhrim warriors and the Ñoldor Warriors, but they\napparently have more variants in armour, for example, Thranduil's guards\nare silver, but the regular troops are golden, another type of warrior\nthat can be considered a variant of these are the palace guards of\nMirkwood, they mount guard over the Elven king's halls.\n\nThey wear more protective armour than the Galadhrim, but in comparison\nto the Ñoldor, they have the same protection, if not less, making them\nsturdy warriors that can cut through Goblin ranks with ease.\n\nQuotes\n\nGANDALF: My lord, dispatch this force to Ravenhill. Thorin must be\nwarned! THRANDUIL: By all means, warn him. I have spent enough Elvish\nblood in defense of this accursed land. No more!\n"
  },
  {
    "title": "Brockhouses Family",
    "page_id": "38300",
    "text": "BROCKHOUSE was a populous family of the Bree-hobbits. While some members\nof the family lived in the Shire, Sapphira Brockhouse was the wife of\nUffo Boffin, and Bilbo Baggins greeted the Brockhouses among other\nhobbit families in his famous farewell speech on September 22, TA 3001.\n\n\n\nNotable Family Members\n\n-   Sapphira Brockhouse\n"
  },
  {
    "title": "Bucklanders",
    "page_id": "39586",
    "text": "The BUCKLANDERS are the inhabitants that live in Buckland, located on\nthe eastern borders of the Shire.\n\n\nHistory\n\nThe Bucklanders acknowledged the “Master of Buckland” as their leader.\nThe Brandybucks, descendants of Gorhendad Oldbuck who founded Buckland,\nwere considered the most important family of the Bucklanders. They all\nhad a strong Fallohidish strain in their blood, it is said, and this\nmade them more adventurous than many of their more conservative\nneighbours in the Shire. They did not share the Shire-hobbits' fear of\nwater, for example, and the Bucklanders' boats where often seen on the\nBrandywine River that bordered their land. On the eastern border of\nBuckland lay the dangerous Old Forest, and the constant threat of the\ndark trees made the Bucklanders somewhat hardier than typical hobbits."
  },
  {
    "title": "Guldur War Troll",
    "page_id": "36820",
    "text": "These Were giant armored war beasts (most likely Mountain Trolls) that\nparticipated in the Battle of the Five Armies, in The Hobbit: The Battle\nof the Five Armies.\n\n\nStatistics\n\nThese trolls were very large, dwarfing all the others seen previously,\n(about 25 feet tall or more) more importantly they were either fully or\npartially armored, unlike the smaller yet extremely similar Guldur\nOlog-Hai, which were fully armored but as stated above much smaller\n(about the size of a regular troll in the films) These trolls were\nfearsome weapons on the field and devastated dozens of soldiers with one\nstrike alone of their weapons.\n\nThese trolls were quite intelligent and kept formation with the orcs as\nthey marched to battle, in battle these trolls carried bladed axe/sword\nlike weapons upon their arms, (similar to the Guldur Orcs's shields)\nlong metal maces which could smash the very earth several feet into the\nair, taking down several men at once. Some even used their bare hands,\nballing them up into fists to smash the allied armies, or sweeping them\nup and throwing them like rag-dolls.\n\nThe less fortunate of these trolls were also hideously amputated by the\norcs, giving them morning star (wrecking ball-like) arms in place of\ntheir flesh and blood ones, some had metal hooks placed into their backs\nfor goblins to take hold of, and the most unfortunate was blinded and\ngiven reigns dangling from their eye sockets for orcs to directly take\ncontrol of.\n\nThese trolls were probably Mountain Trolls from Gundabad in the northern\nmisty mountains, this would explain their height, and color of their\nskin (being a peach like hue) instead of the darker blue cave troll skin\nor dark grey olog-hai skin.\n\nUnlike the smaller Guldur Olog's these trolls couldn't simply be taken\ndown by a spear throw to the neck or a few arrows. It would take dozens\nof arrows and several spears/pikes to be sent into the unarmored parts\nof the trolls in order to take them down. A premeditated attack upon a\ntroll would usually work and need to be planned out well in order to\ntake out the beast before it took down a whole garrison.\n\n\nHistory\n\nThese trolls were used primarily in Azog the Defiler's Dol-Guldur orc\narmy, directed to come out as soon as Azog called for the war beasts,\nalmost immediately these trolls smashed into the allied army, causing\nmassive damage, when some of the orc regiments made their way to the\nruins of dale, some of these trolls joined them, climbing over the walls\nor simply smashing them down to gain access. One of these trolls was\neven given a stone headpiece to act as a battering ram to the walls of\ndale. Most of these trolls survived until the end of the battle, still\nfighting on when the bats of gundabad arrived. But once the Eagles\narrived, the remaining trolls either fled into the Were -Worm tunnels,\nor were eventually taken down by the combined allied forces."
  },
  {
    "title": "Lords of Andúnië",
    "page_id": "622",
    "text": "The Lords of Andúnië were the rulers of a noble house of Númenor in the\nSecond Age.\n\n\nHistory\n\nThe Lords of Andúnië named for their ancestral home of Andúnië were\ndescended from Silmariën, daughter and oldest child of Tar-Elendil the\nfourth King of Númenor. The laws of Númenor at that time would not allow\nher to rule as queen, so she wedded Elatan of Andúnië and took up\nresidence there. Their son Valandil would be named the first Lord of\nAndúnië in about the seventh century of the Second Age.\n\nThroughout the Second Age, the Lords of Andúnië became leaders of the\nElendili, or Elf-friends, for remaining friends with the Elves and\nfaithful to the Valar. This was despite opposition and eventually\npersecution from the King's Men.\n\nAt the end of the Second Age, Númenor's estrangement from the Elves and\nthe Valar under the evil guidance of Sauron corrupted Númenórean\nsociety. Seeking pardon of the Valar for the wickedness of the\nNúmenóreans, Amandil the Faithful, Lord of Andúnië, sailed into the west\nbut was never heard of again.\n\nHis son Elendil, the last Lord of Andúnië, did not join Ar-Pharazôn's\ngrand armada to attack Valinor, and instead fled with his sons Isildur\nand Anárion and many of the Faithful to Middle-earth, where they founded\nthe lines of the Kings of Gondor and Arnor.\n\nElendil brought with him the Sceptre of Andúnië, the instrument of his\nlordship, which became a hereditary emblem of royal authority in Arnor,\nalong with the Ring of Barahir. It later became known as the Sceptre of\nAnnúminas and by the Third Age thought to be the oldest artifact made by\nMen in Middle-earth.\n\nit:Signori di Andúnië\n\n Category:Men"
  },
  {
    "title": "Sackville-Baggins",
    "page_id": "687",
    "text": "The SACKVILLE-BAGGINS were a wealthy Hobbit family of the Shire in the\nlate Third Age.\n\n\nHistory\n\nThe family was founded by the marriage of Longo Baggins to Camellia\nSackville, heiress of the Sackville family headship. Their son, Otho\nSackville-Baggins, adopted a double name, kept by his wife Lobelia (née\nBracegirdle). The family was never well-liked as they were extremely\nobnoxious, snobby, rude, and greedy. They were obsessed with acquiring\nthe luxurious Bag End from their cousin Bilbo. They had almost succeeded\nin TA 2942 when Bilbo had disappeared a year earlier and was thought to\nbe dead. When this was not so, the family became more and more\ndetestable and for years denied that the Bilbo living in Bag End was the\nreal Bilbo Baggins. They were even more envious of Bilbo's wealth\nwhen he adopted Frodo as his heir.\n\nFrodo Baggins disliked them as they resented his inheritance. When Frodo\nwent away in September, TA 3018, they had finally gotten Bag End.\nLobelia's son Lotho had gained control of the Shire through alliance\nwith Saruman. When he was murdered, Lobelia was the last significant\nmember of the family and after her death the brief-lived family\ndisappeared.\n"
  },
  {
    "title": "Calaquendi",
    "page_id": "937",
    "text": "The CALAQUENDI (singular _Calaquendë_) are the ELVES OF THE LIGHT, and\nrefers to those that reached Valinor and dwelt there ever after or for\nsome time.\n\nThe Calaquendi include the Vanyar, Ñoldor, and those Teleri who passed\nover Belegaer, as well as the Sindarin King Thingol alone of all his\npeople. Another name for them is AMANYAR (with the exception of Thingol,\nwho was not of the Amanyar), “Those of Aman”. Those kindreds who settled\nin Aman or descended from them were also referred to as High Elves, or\n“Tareldar”.\n\nThose Elves who refuse the summons of the Valar or did not complete the\nGreat Journey to Valinor are called the _Úmanyar_, meaning “Not of\nAman]” and “Moriquendi,” or Dark Elves (those who had not seen the\nLight)."
  },
  {
    "title": "Rangers of the North",
    "page_id": "2269",
    "text": "RANGERS OF THE NORTH, or simply THE RANGERS, were the northern\nwandering people of Eriador, the last remnant of the Dúnedain of Arnor,\nwho had once peopled the North Kingdom of Arnor. They protected the\nlands they wandered although their secretiveness made other peoples\nconsider them dangerous and distrustful in Bree and the Shire, where\nthey were known as “Watchers”.\n\nThey were grim in appearance and were usually dressed in grey or dark\ngreen, with a cloak-clasp shaped like a 6-pointed star.\n\nThe term 'Rangers of the North' was used most often by those who lived\nin the southern lands of Rohan and Gondor, perhaps to distinguish this\npeople from their distant cousins, the Rangers of Ithilien. Like the\nRangers of the North, these were also Dúnedain, but they belonged to the\nSouth-kingdom of Gondor, and their ancestors had been divided from the\nNorthern Dúnedain for some three thousand years.\n\n\nBackground\n\n The Dúnedain of\nArnor dwindled after the breaking of Arnor into three kingdoms and the\nwars with Angmar. Cardolan and Rhudaur soon fell and only the\npetty-kingdom of Arthedain maintained the noble line of Isildur.\nFinally, that too was destroyed in the Battle of Fornost and Arvedui,\nthe last King of Arthedain was lost in the sea.\n\nArvedui's son and heir, Aranarth claimed the title of the Chieftain, who\nwould rule the remnants of his people. Elrond had in his keeping the\nheirlooms of the house of Isildur: the shards of Narsil, the Star of\nElendil, the Sceptre of Annúminas and later the Ring of Barahir,\nransomed from the Lossoth.\n\nEach of Aranarth's heirs (who, like him, could trace his descent back to\nIsildur himself) would be secretly born and raised in Rivendell.\n\nThe Rangers became a secretive wandering and nomadic people around\nEriador, far from Sauron's spies, little known or remembered, and their\ndeeds were seldom recorded.\n\n\nHistory\n\nThe Watchful Peace followed the loss of Arnor and after its end, the\nenemies concentrated mostly against Rhovanion and Gondor. During that\ntime, the Rangers fought minor battles and skirmishes against orcs and\nwolves in order to keep the region safe. The hobbits of the Shire\nflourished under their protection.\n\nDuring the rule of Arassuil, the Orcs of the Misty Mountains became more\nbold, daring to invade Eriador. The Rangers fought many battles trying\nto hold them back, but one party managed to reach the Shire, and were\nfought off by a party of brave Hobbits under Bandobras Took in T.A.\n2747. Soon after, the Long Winter arrived and many lives were lost, and\nGandalf and the Rangers had to help the Hobbits of the Shire survive.\n\nIn 2911, during Argonui's rule, the Fell Winter began with the\nBrandywine freezing over. This was a catalyst for White Wolves invading\nEriador from the North which must have harassed the Rangers. In the last\nyear of his reign, great floods devastated Enedwaith and Minhiriath\nleaving Tharbad ruined and deserted. The following years were peaceful\nalthough Arador was killed by hill-trolls and his son Arathorn II was\nkilled while hunting orcs.\n\nArathorn's son, Aragorn II succeeded him, who between 2957 to 2980 took\ngreat journeys, serving in the armies of King Thengel of Rohan, and\nSteward Ecthelion II of Gondor. Many of his tasks weakened Sauron and\nhis allies, and the West endured him during the War of the Ring.\n\nAt that time Aragorn's Rangers were scattered and diminished. When\nHalbarad led a troop of the Rangers into the south to Aragorn's aid in\nthe War, in haste he could muster no more than thirty in this company\nwho fought in the Battle of Pelennor Fields.\n\nAragorn eventually became King Elessar of the Reunited Kingdom and the\nRangers became once more a united people under the line of Elendil in\nthe Fourth Age.\n\nFor over a thousand years, the Rangers of the North faithfully preserved\nthe Line of Elendil and the ways of the Dúnedain and the ancient\nheirlooms of the Heir of Isildur such as the Shards of Narsil, Star of\nElendil, Sceptre of Annúminas, and the Ring of Barahir. Like all\nDúnedain, they were very friendly with the Elves, particularly those of\nRivendell, where each heir would be born and raised. They secretly\nguarded and protected Eriador, from spies and invaders, brigands, and\nother worse foes.\n\nAt the time of the War of the Ring, the Rangers of the North were led by\nAragorn, future king of the reunited kingdoms of Gondor and Arnor. But\ndespite Aragorn's leadership, most of the Rangers remained scattered and\ndiminished. Therefore, when the ranger Halbarad endeavored to aid\nAragorn in the War, he could muster only a small number of Rangers to\njoin him."
  },
  {
    "title": "Children of Ilúvatar",
    "page_id": "2353",
    "text": "The CHILDREN OF ILÚVATAR are Elves and Men, the two races created by Eru\nIlúvatar, the supreme being of created universe.\n\n\nHistory\n\nAfter the themes of Ilúvatar and the proclamation of Eä, Eru set the all\nthe firstborn of Elves and Men in places of the world that even the\nValar could not find. Elves were the first of the Children of Ilúvatar\nto appear in Middle-earth, whereas Men were not to follow until the\nbeginning of the First Age, with the creation of the Sun and Moon, many\nthousands of years later.\n\nElves were also named the _Quendi_ (“those who speak”, in Quenya) and\nthe _Minnónar_ (“Firstborn”). They were further divided into many\ngroupings, often distinguished by their respective linguistic branches.\nMen were also named the _Apanónar_ (“Those born after” or “Afterborn”),\n_Fírimar_ (“Mortals”), _Engwar_ (“the Sickly”), and the _Followers_.\nThese somewhat derogatory names were given to Men by the Elves, who were\nthe primary historians of the early events of Middle-earth.The reason\nfor this naming was simple.\n\nDwarves were not originally included in this distinction, as they were\ncreations of Aulë alone. The story of their creation was told in the\n_Quenta Silmarillion_, and explains how the Elves and Men were created\nby Eru Ilúvatar directly, without delegation to the Ainur.\n\nAnimals and plants were probably fashioned by Ainur after themes set out\nby Eru in the Music of the Ainur. In cases where animals exhibit\nsapience, as in the case of Huan or the Eagles, this is questionable\nthey may actually be Maiar instead."
  },
  {
    "title": "Éored",
    "page_id": "2607",
    "text": "ÉORED is the name of a cavalry company of riders of the Rohirrim.\n\nIt consisted of one-hundred and twenty mounted warriors, and a full\nmuster of the Éoreds of Rohan was called an Éoherë.\n\nIn the War of the Ring, Éomer commanded one of several Éored involved in\nthe Battle of the Pelennor Fields.\n\n\nDescription\n\nAn Éored was a group of well-trained warriors who rode as a combat unit.\nUnder the military reorganization in the time of King Folcwine, the size\nof a full Éored was determined to be at least 120 men. One Éored was one\nhundredth of the Éoherë - the full muster of Rohan. The Riders of an\nÉored could serve for a term or on a permanent basis. Each Éored was led\nby a captain. In times of war or unrest, the Marshals of the Mark each\nhad a battle-ready Éored as part of his household which he could command\nat his discretion.\n\n\nHistory\n\nDuring the first three hundred years of Rohan's existence, the term was\nused widely to describe any significant number of Riders. Under King\nFolcwine, the military of Rohan was reordered. Under Folcwine, one Éored\nwas made up of 120 riders including their captain. Each Éored was also\nsupposed to comprise one-hundredth of the whole Muster of Rohan, not\nincluding the household of the King.\n\nWar of the Ring\n\nThe changes made by Folcwine continued through the time of the War of\nthe Ring. While the force commanded by Théoden King son of Thengel at\nthe Battle of the Pelennor Fields did not number much more than half of\n12,000 riders, it was possibly the largest riding of the Rohirrim in\nhistory.\n\nDuring the War of the Ring, Éomer, the Third Marshal of the Mark, defied\norders and led his Éored in pursuit of a band of orcs who had entered\nRohan from the Emyn Muil. In the battle between Éomer's men and the\norcs, fifteen Riders were killed. Éomer's Éored thus numbered only 105\nwhen they encountered Aragorn, Legolas, and Gimli on February 30,\n3019.\n\nMerry Brandybuck and Éowyn, disguised as a Rider named Dernhelm, rode\nwith the Éored commanded by Elfhelm to the Battle of the Pelennor Fields\non March 15. When the Rohirrim charged onto the battlefield, Éomer led\nthe first Éored in the center while Elfhelm's Éored was on the right\nflank and Grimbold's was on the left flank and the other companies\nfollowed behind. King Theoden rode before them all.\n\nAfter the War of the Ring, Éomer returned to Minas Tirith with an Éored\nof Rohan's fairest knights to escort the body of their slain King home\nfor burial.\n\n\nEtymology\n\nIn Old English, the word ÉORED means “Cavalry, band, or troop”. It\nmay have also been dervied from _eoh_ (“horse”) and _rád_ (“riding”)."
  },
  {
    "title": "Fathers of the Dwarves",
    "page_id": "2694",
    "text": "The FATHERS OF THE DWARVES were the first seven of the founding fathers\nof the Dwarven race.\n\n\nHistory\n\nThe Vala Aulë created the Dwarves because he was impatient for the\narising of the Children of Ilúvatar (Elves and Men). He created seven\nDwarves, and was teaching them the language he had devised for them.\nWhen Ilúvatar confronted him about what he had done, Aulë offered his\ncreations to Ilúvatar, who accepted them and gave them life.\n\nHowever, the Fathers of the Dwarves had to wait until the Elves first\narrived, and Aulë laid them to rest in various places in the continent\nof Middle-earth.\n\nThe eldest of all, Durin, “lay alone” at Mount Gundabad in the north of\nthe Misty Mountains. He later founded the line of the Longbeards (or\n_Sigin-tarâg_ in Khuzdul), the Dwarves which were most friendly to the\nElves and Men, mostly referred to as Durin's Folk. His city was\nKhazad-dûm.\n\nTwo others were laid to rest near Mount Dolmed in the Blue Mountains,\nand they founded the lines of the Broadbeams and the Firebeards who\nlater lived in Nogrod and Belegost.\n\nThe other four Fathers of Dwarves were laid to rest in the far east, two\nof them at the northern end of the Orocarni, and the other two near the\nsouthern end of the range. These founded the lines of the _Ironfists_\nand _Stiffbeards_, and _Blacklocks_ and _Stonefoots_. No Dwarves of\nthese lines appear in the tales: however, as noted below, the Longbeards\nmay be formed out of Dwarves from all lines, and Dwarves from Durin's\nFolk may therefore have ancestors from these other lines. After the end\nof the First Age, when the ancestral homes of the Broadbeams and\nFirebeards were destroyed, these two lines merged with Durin's Folk, so\nthat Moria had a mixed population, and Thorin Oakenshield grew up in the\nremnants of the Firebeards' halls.\n\nOf the Fathers of the Dwarves, only Durin is said to have “lain alone”.\nThis can be interpreted as referring to the fact he was indeed laid down\nto rest alone while the other Fathers were laid to rest in pairs, but\nolder versions of the story suggest that it meant Durin alone had no\nfemale companion. The other Fathers did: references are made by Tolkien\nto the “Thirteen Dwarves” created by Aulë (Durin and the six pairs). By\nthis version of the story, Durin's Folk was formed out of Dwarves from\nthe other six lines, as a mixed people arose when all Dwarves went to\nGundabad."
  },
  {
    "title": "Northmen",
    "page_id": "2774",
    "text": "The NORTHMEN, also known as the FREE MEN OF THE NORTH,''' '''were Men\nthat lived in the north of Rhovanion in Middle-earth, and were friendly\nto Gondor.\n\n\nHistory\n\n\n\nThe Northmen who dwelt in the Greenwood and other parts of Rhovanion\nwere friendly to the Dúnedain and were, after the Dúnedain, some of the\nmost noble Men in Arda. They were known as Middle Men by the Dúnedain,\nand were believed to have been descended from the same group of Men as\nthe Edain, the Atanatári. The only difference was that they didn't cross\nthe Blue Mountains into Beleriand, and therefore did not journey to\nNúmenor. The result of them not participating in the War against Morgoth\nwas their considerably shorter lifespan; the lifespan of the Dúnedain\nbeing lengthened by the Valar after the War of Wrath. They were\nimportant allies of Gondor and served as a buffer against the\nEasterlings and other foes. For a time many of them even became subjects\nof Gondor, as the realm extended beyond the river Anduin.\n\nEast of Greenwood the Great was the kingdom of Rhovanion, and this\nbecame the most important nation of the Northmen. In the fourteenth\ncentury of the Third Age, King Rómendacil II of Gondor sent his son\nValacar as an ambassador to Vidugavia, the so-called “King of\nRhovanion”. Valacar loved Rhovanion and the daughter of the King,\nVidumavi. He married her and she bore him a son whom she called\n_Vinitharya_ in her mother tongue. In Gondor, Vinitharya became known as\nKing Eldacar and caused a civil war- the Kin-strife- because of his\nmixed Dúnedain/Northmen blood.\n\nShortly after the death of Vidugavia, a small group of Northmen moved to\nthe vales of the Anduin between the Gladden Fields and the Mirkwood,\nprobably to flee from the Wainriders, who had enslaved much of the\npeople of Rhovanion. After the evil Kingdom of Angmar was defeated by\nGondor and the remains of Arnor in TA 1977, these Northmen moved north\nand began to call themselves the Éothéod. They were skilled horse\nbreeders and horsemen. In TA 2510 they responded to a plea of help from\nthe trapped Gondor army at the Field of Celebrant. After they helped\nGondor win this important victory, they were rewarded the province of\nCalenardhon and became known as the Rohirrim. The Men of Rohan who\nfought on foot were called 'Yeomen'.\n\nThe Men of Dale and Lake-town were also counted under the Northmen, as\nwere the woodsmen of Mirkwood. Most of Rhovanion had been depopulated\nafter the wars of the Easterlings and the Great Plague. Their range was\nextremely wide; the Men of the North ranged to the western eaves of\nMirkwood to the southern slopes of the Grey Mountains and from the Long\nLake to Dorwinion on the Sea of Rhun.\n\nIn ''the Hobbit, ''these men carved out a potentially precarious living\nin the eaves of Mirkwood, living as hunters, loggers, trappers, and\nfishermen on the Anduin and its tributaries. They also lived in constant\nfear of attack from Dol Guldur.\n\n\nMilitary\n\nThe larger, more established kingdoms of the North (such as Dale and\nLaketown) would have at least some semblance of a regular standing army.\nThese would have mostly consisted of a force of dismounted men-at-arms,\narmed with a sword and a wooden shield. The Men of the North might have\nreceived some help from Gondor in metalworking, along with their Dwarven\nallies nearby. A militia or town guard would have also been used\nextensively, for the majority of the humans in the north were farmers\nand thus needed their full attention kept on the all-important harvest.\n\nFurther up the military hierarchy would be a force of axemen, for many\nof the woodcutters and loggers in Mirkwood would have learned to use the\naxe from adolescence.\n\nA force of mounted knights and light cavalry would probably have been\navailable for scouting and other duties, for the terrain from Dale to\nDorwinion is mostly flat and featureless, except for a few trees,\nshrubs, and ponds scattered randomly.\n\nBy contrast, the rural, less established kingdom of Rohan trains almost\nevery legitimate soldier it has to fight from horseback, while the\ninfantry division is left to be composed of not soldiers but, as Gamling\nstates in The Two Towers, “every villager able to wield a sword”.\n\n\nLanguages\n\nBeing human means that the Northmen spoke the Common Speech. However,\nthey also have native languages. For example, the Rohirrim spoke\nRohirric, for which Tolkien appears to have been inspired by Old\nEnglish, seeing names like “Éowyn” and “Thengel”. Whereas the Bardings\nand Wood-men speak a similar language to the men of Rohan in terms of\ngross language group, as seen in Old Norse names (akin to Old English\nand Norse being in the same language group), i.e. the name “Brand”\ntranslating to “torch”. The language was not similar to Dwarvish; rather\nthe Dwarf names appearing in _The Hobbit_ and _The Lord of the Rings_\nare Dwarf names given in the language of the Men of Dale, not the native\nDwarf language.  They never shared languages with the Elves or with\ntheir Western, Southern, and Eastern counterparts; other than Westron.\n\nde:Nordmenschen it:Uomini del Nord ru:Северяне"
  },
  {
    "title": "Barrow-wights",
    "page_id": "2758",
    "text": "The '''Barrow-wights '''were shape-shifting beings of darkness, similar\nin circumstance to Wraiths, who dwelt in dark places of Eriador such as\nthe Barrow-downs.\n\nThe characteristic of shape-shifter gave Barrow-wights the ability to\nreanimate whatever life-form they wished. The ones which attacked the\nfour Hobbits reanimated the corpses of the Kings of the Barrows. Most\noften the Barrow-wight came on the unwary traveller in the guise of a\ndark phantom whose eyes were luminous and cold. The voice of the figure\nwas at once horrible and hypnotic; its skeletal hand had a touch like\nice and a grip like the iron jaws of a trap. Once under the spell, the\nvictim had no will of his own. In this way the Barrow-wights drew the\nliving into the tombs of the downs. A dismal choir of tortured souls\ncould be heard inside the Barrow as, in the green half-light, the\nBarrow-wight laid his victim on a stone altar and bound him in chains of\ngold. He draped him in pale cloth and precious jewelry of the ancient\ndead, and with a sacrificial sword ended them.\n\n\n\nEast of the Brandywine River beyond the Old Forest were the\nBarrow-downs, the most ancient burial ground of men in Middle-earth.\nThere were no trees nor water there, but only grass and turf covering\ndome-shaped hills that were crowned with monoliths and great rings of\nbone-white stone. These hills were the burial mounds that were made in\nthe First Age of the Sun for the Kings of Men. For many ages the\nBarrow-downs were sacred and revered, until out of the Kingdom of Angmar\nmany terrible and tortured spirits fled across Middle-earth, desperately\nsearching to hide from the ravening light of the Sun. Demons whose\nbodies had been destroyed looked for other bodies in which their evil\nspirits could dwell. And so it was that the Barrow-downs became a\nhaunted and terrible place. The demons became Barrow-wights, the Undead\nwho animated the bones and jeweled armor of the ancient Kings of Men who\nhad lived in the First Age of the Sun.\n\n\n\nIn the darkness they were powerful spirits and they could be held at bay\nonly with the spell of strong incantations, such as Tom Bombadil's song.\nHowever, normally they could be destroyed only by exposure to light, the\nentity they hated and feared the most. The Barrow-wights were lost and\ntortured spirits, and their last chance to remain upon Earth depended on\nthe dark security of burial vaults. Once the stone chamber was broken\nopen, light would pour in on the Barrow-wights and they would fade like\nmist before the sun and be gone forever.\n\n\nHistory\n\nThe Barrow-wights began appearing in the Barrow-downs after the Dúnedain\nof Cardolan succumbed to the ravages of the Great Plague. They were put\nthere by sorcerers of Angmar who corrupted the souls of the inhabitants\nof the Barrow-downs. The sorcerers were sent by the Witch-king of Angmar\nwho wished to keep the Dúnedain away from there.\n\nOn September 28 of 3018 Frodo Baggins and his companions, Sam Gamgee,\nMerry, and Pippin while passing through the Barrow-downs were captured\none by one by the Barrow-wights, and trapped in what was believed to be\nthe cairn of the last prince of Cardolan.\n\nThere they were almost slain by a wight; three of the Hobbits had been\nlain in a barrow filled with a strange green light and were dressed in\nwhite robes and wore jewels and gold and had a sword across their necks.\nThe wight had finished an incantation, and was preparing to finish them\noff when Frodo summoned up the courage to slice off its hand; he then\ncalled upon Tom Bombadil when the wight extinguished the dim light in\nthe cavern. Bombadil performed some kind of exorcism on the barrow,\nthrough the rare power of his singing, which caused the wight to flee\nwith a shriek; he then gave the hobbits swords and then spread out the\ngold and treasures from the barrow on the grass, so that the barrow's\nspell was broken and no Wight could make habitat there.\n\n\n"
  },
  {
    "title": "Moriquendi",
    "page_id": "2655",
    "text": "The MORIQUENDI (singular _Moriquendë_; also named the LEMBI, HISILDI,_'\nAND Kaliondi) WERE THE Elves of Darkness_': those who did not embark on\nthe journey over the sea to Aman and behold the light of the Two Trees\nof Valinor.\n\n\nHistory\n\nThe Moriquendi lingered on the shores of Middle-earth or, indeed, never\npassed the Blue Mountains in the east of Beleriand or the Misty\nMountains further to the east. Those Moriquendi who originally started\non the journey but did not finish it were named the ÚMANYAR, which meant\n“Those not of Aman”.\n\n_Moriquendi_ is a term for Elves of the Avari, Sindar, and Nandor, but\nin practice is only applied to the Avari. An exception to the hierarchy\nof Elvish peoples is Thingol, who, though he did not complete the\njourney, had earlier been to Valinor. Thingol was therefore considered\nÚmanyar but not Moriquendë.\n\n    ''\"Those Elves the Calaquendi call the Úmanyar, since they came\n    never to the land of Aman and the Blessed Realm; but the Úmanyar and\n    the Avari alike they call the Moriquendi, Elves of the Darkness, for\n    they never beheld the Light that was before the Sun and Moon.\n\nThe term “DARK ELF” in Tolkien's writing seems to hold an additional\nspecial and not explained meaning, as it is given as a special title of\nEöl, an Elf of Nan Elmoth. It is also used as an insult by the Sons of\nFëanor to Thingol (which is incorrect, since Thingol alone of the Sindar\nwas reckoned under the Calaquendi).\n\n\nEarlier versions of the legendarium\n\nThe initial term for these Elves who remained outside of Aman was\n_ILKORINDI_,'' ''in _The Book of Lost Tales Part One._\n"
  },
  {
    "title": "Balchoth",
    "page_id": "2481",
    "text": "The BALCHOTH were a fierce group of Easterlings.\n\n\nHistory\n\nUnder the influence of Sauron from Dol Guldur, the Balchoth attacked\nGondor in TA 2510. They overran the plains of Calenardhon and almost\ndestroyed the army of the Ruling Steward Cirion, but were defeated by\nthe Éothéod under Eorl the Young at the Battle of the Field of\nCelebrant; the entire race was pursued and slaughtered by Eorl and his\nmen. It is not known if any survived the massacre, but if any did, they\nprobably joined the Easterlings around the Sea of Rhûn and were\nassimilated.\n\nLike the Wainriders, whom the Balchoth could be said to have\nsucceeded, they rode in chariots and wagons.\n\n\nReal-world relation\n\nThe fact that they lived near Khand, which may be based on Northern\nIndia, and their name similarity, they may be based on the Baloch people\nof Baluchistan, once part of British India, now in Pakistan.",
    "origins": "Easterlings",
    "locations": "Around Rhûn; Rhovanion"
  },
  {
    "title": "Ñoldorin exiles",
    "page_id": "939",
    "text": "The ÑOLDORIN EXILES were the Ñoldor who left under Fëanor and Fingolfin\nafter the destruction of the Two Trees, the killing of Finwë, and\nrobbery of the Silmarils. The Doom of Mandos was placed on them so that\nthey could not return to Valinor.\n\n\nHistory\n\nThe Exiles were split into two groups during the Kinslaying at\nAlqualondë; Fëanor and his sons and followers took the ships they had\nacquired from the Teleri, leaving Fingolfin's followers behind. They had\nto cross the Helcaraxë in the north, and lost a large number of people\nthere. When asked about the course of action they would take to\ntransport the rest of the exiles, Fëanor ordered the burning of the\nships.\n\nMorgoth wasted no time attacking the exiles, which were vastly superior\nto them in spite of their small number and unprepared state. Fingolfin\nand his followers arrived at the same time as the Moon first rose, and\nthey mainly settled in Hithlum.\n\nThe Exiles set up kingdoms in various places and joined others. Amrod\nand Amras joined the Laiquendi of Ossiriand, Finrod built Nargothrond\nand Minas Tirith, and Turgon built Gondolin.\n\nFor hundreds of years, the Ñoldor held off the forces of Morgoth,\ndefeating him in three of the major battle of Beleriand and laying siege\nto his great abode in the north. However, in FA 455 Morgoth broke the\nsiege, and the Ñoldor began losing ground. About seventeen years later\nthey lost a critical battle and many subsequently enslaved.\n\nThe majority of the survivors were forced to relocate farther into the\nsouth with further hurt coming to them by infighting between them caused\nby the Sons of Fëanor. Eventually, all the great realms occupied by the\nexiles fell by the year FA 510 with all survivors fleeing to the Havens\nof Sirion, which had became their chief colony. More conflict assailed\nthem when again the Sons of Fëanor attacked and killed many of their\nkin. One of their residents raised there was Eärendil who built Vingilot\nallowing him to escape the carnage. Joined by his wife, they both won\nthrough to Valinor by the light of the Silmaril. There they pleaded with\nthe Valar for aid and forgiveness for the rebellion of the Ñoldor.\n\nAfter the Morgoth was defeated in the War of Wrath, the Doom was lifted\nand many of the Ñoldorin Exiles went back to the Undying Lands save for\nGaladriel and the Ñoldor who followed Celebrimbor."
  },
  {
    "title": "Orc Berserker",
    "page_id": "35477",
    "text": "ORC BERSERKERS were the most ruthless and fearsome Orcs of Gundabad.\nTheir chieftain is Bolg, spawn of Azog. \n"
  },
  {
    "title": "Morgul Attack Troll",
    "page_id": "36257",
    "text": "The MORGUL ATTACK TROLL was a breed of Olog-hai and unlike the Mordor\nbreed, these Lack size, strength and armor. During the Siege of Minas\nTirith, these were the first troops to attack the insides of the city\nonce the wolfs head Grond had smashed the door open. Some of them had a\nlittle armor, but not as much as the Mordor breed.\n\n\nStatistics\n\nThese trolls weren't at all as strong as the ones at the black gate and\nwere very weak to incoming arrows and spears. They cannot be mistaken\nwith the Mountain-trolls who are nearby during the same siege.\n\n\nSee Also\n\n-   Mordor Attack Troll\n-   Olog-hai"
  },
  {
    "title": "Elf-fathers",
    "page_id": "29463",
    "text": "ELF-FATHERS was the title given to Imin, Tata, and Enel (Quenya; _one,\ntwo,_ and _three,_ respectively), the first three Elves to be awakened\nat Cuiviénen by Eru Ilúvatar. The three are the founders (fathers) of\nthe first three Elven clans, or tribes: the Minyar, the Tatyar, and the\nNelyar (Quenya; _firsts, seconds,_ and _thirds,_ respectively). The\nMinyar, Tatyar, and Nelyar tribes later became known, respectively, as\nthe Vanyar, the Ñoldor, and the Teleri.\n"
  },
  {
    "title": "Uruk-hai scouts",
    "page_id": "26061",
    "text": "The “URUK-HAI SCOUTS” were an early band of Orcs from Isengard, bred\nunder Saruman's oversight and led by Ugluk.\n\n\nHistory\n\nIn the War of the Ring, these Uruk-hai''' '''were sent out to retrieve\nthe One Ring, with instructions from Saruman to bring back both it and\nits bearer. The Fellowship of the Ring was to be killed, and the Ring\nbrought to Isengard. However, not having instructed them to the specific\nindividual, Saruman ordered them to take “the halflings” alive.\nTherefore the Orcs, who arrived at Parth Galen after Frodo had run away,\nkidnapped Merry and Pippin, and began heading back to Isengard at full\nhaste. They were met by reinforcements sent from Isengard later, under\nthe command of Mauhúr. They were, however, slowed by the less indulgent\nGrishnákh and his Orc patrol from Mordor. In that week they were\nambushed by the banished Rohirrim and wiped out next to Fangorn Forest.\n"
  },
  {
    "title": "Dwarves of the Grey Mountains",
    "page_id": "45927",
    "text": "The DWARVES OF THE GREY MOUNTAINS were the Dwarves of Durin's Folk who\nlived in the Grey Mountains in northern Middle-earth.\n\n\nThe Earliest Settlements\n\nThe Dwarves of Durin's folk considered the Ered Mithrin as part of their\nland as far back as the reign of Durin I. Throughout the First and\nSecond Age, the Grey Mountains had been mined and inhabited by Dwarves\nof Durin's Folk.\n\n\nThe Awakening of Durin's Bane\n\nDurin's folk started to gather in the Grey Mountains in TA 1981 after a\nBalrog was awakened in their ancestral home of Khazad-dûm, which its\npeople fled in fear. Another portion of Durin's folk lead by King Thráin\nI established the Kingdom under the Mountain at Erebor.\n\nSome years after leaving Moria Scatha, the Great Worm of the Ered\nMithrin began to afflict the Dwarves and all who lived in that region,\nuntil Fram of the Éothéod slew him, bringing peace from the Long-Worms\nfrom many years till the War of the Dwarves and Dragons. But there was a\nfeud between the Dwarves and Fram, for he refused to yield any of the\ntreasure of Scatha to the Dwarves. Instead he sent a necklace of\nScatha's teeth to them, saying “treasures like these are hard to come\nby”. For this insult it is said the Dwarves slew him.\n\n\nThe Seat of Durin's Realm\n\nIn TA 2210 King Thorin I, learning that most of his people were\ngathering in the Grey Mountains, left the Lonely Mountain to join the\nDwarves to the north, for those mountains were rich and little explored.\n\n\nThe War of the Dwarves and Dragons\n\nFor many years Durin's folk prospered in the Ered Mithrin, but the\nDragons in the wastes beyond began to multiply again and made war on the\nDwarves in TA 2570, and plundered their works.\n\nAfter 19 years the War of the Dwarves and Dragons came to an end when a\ngreat Cold-drake killed King Dáin I, and his second son Frór at the door\nof his hall. A year later most of Durin's folk abandoned the Grey\nMountains. Grór, youngest son of the king went with many followers to\nthe Iron Hills. In the mean time, the new King Thrór along with his\nuncle Borin, and the remainder of the people went back to Erebor.\n\n\nRemaining Peoples, and Later History\n\nThere still was a remnant of the Dwarves in the Ered Mithrin after the\ncore of the population left but were probably few. Working whatever\nmines they could hold from the Orcs and Dragons, but is speculated that\nthey may have left at some point as well.\n\nIt is likely that the Dwarves reclaimed all their old halls and mines\nsometime during the Fourth Age, if not after Dáin II Ironfoot became\nking of Durin's folk in the late Third Age."
  },
  {
    "title": "The Rangers of Gondor",
    "page_id": "45467",
    "text": "The RANGERS OF GONDOR were a force of Gondor that had duties mostly\nreminiscing those of their Dunedain predecessors in Eriador. They held\nback and informed Gondor of many of Mordor's advances during the Third\nAge.\n\nThey were the scouts and geurilla units that protected Gondor's frontier\nlands, notably Ithilien and Anorien.\n\nThey were led by Faramir during the Great Years of the Third Age.\n"
  },
  {
    "title": "Dúnedain of Gondor",
    "page_id": "44984",
    "text": "The DÚNEDAIN OF GONDOR were the Edain descended from the Númenórean\ncolonists (and from their noble kin who escaped the destruction of\nNúmenórin SA 3319) who settled in the southern land of Gondor throughout\nmost of the Second Age.\n\n\nHistory\n\nEarly History\n\nBefore the Downfall of Númenor, the region that would become Gondor was\nhome to many Númenórean colonists, who either mingled with the\nindigenous Middle Men if they were friendly, or dispersed them into Ras\nMorthil, Dunland, and Drúadan Forest. The land on which Gondor was\nfounded was more fertile than the more northerly areas of Middle-earth,\nand so it already had a fairly large population and settlements,\nincluding a well-established haven, Pelargir, founded by the Faithful\nNúmenóreans in the year 2350 of the Second Age.\n\n\nExiles of Númenor\n\nThe refugees from Númenor led by Isildur and Anárion were given a warm\nreception upon their arrival by those Númenórean colonists. Those north\nof the river Anduin accepted Elendil 's claim to kingship over them,\nbeing an heir of the Faithful Lords of Andúnie. The DÚNEDAIN OF THE\nSOUTH were the descendants of the Exiles of Númenor who settled in the\nsouthern lands of Middle-earth and founded the southern kingdom of\nGondor. Their first independent King was Meneldil, the nephew of\nIsildur, whose line ruled over Gondor for more than two thousand years.\nUnlike their cousins in the North, the Dúnedain of the South maintained\ntheir realm even after the loss of its Kings, and it survived under the\nrule of the Stewards until the time of the War of the Ring, when the\nKingship was restored.\n\nDol Amroth was entirely populated with _Dúnedain of the South_\nthroughout the Second and Third Age."
  },
  {
    "title": "Dúnedain of Arnor",
    "page_id": "44736",
    "text": "The DÚNEDAIN OF ARNOR were one of the two great divisions of the\ndescendants of the Númenóreans living in Middle-earth (the other being\nMen of Gondor of the South-kingdom).\n\n\nHistory\n\nBefore the foundation of Arnor there was already a sizable\nNúmenórean population living in Eriador, a result of the slow emigration\nof Númenóreans which had started under Tar-Meneldur and Tar-Aldarion.\nThe region was home to Middle Men of Edain stock, and the early\ncolonists soon interbred with the indigenous population. Elendil and his\npeople were aided by High King of the Noldor Gil-galad and his people,\nand his ships sailed up the Lune river.\n\nThe North-kingdom of Arnor was founded by the High King of the Dúnedain,\nElendil and its chief city Dúnedain was originally meant to be the\ncapital of the Númenórean Realms in Exile. The Dúnedain of this land\nwere ruled for centuries by the descendants of Elendil's eldest son\nIsildur.\n\nAfter Isildur's death in TA 2, Arnor was ruled by his direct\ndescendants, beginning with his youngest surviving son, Valandil. Before\nthe end of the one-thousand years of the Third Age, the land of Arnor\nfell into dispute between the sons of King Eärendur. Afterwards the\nDúnedain who lived there became divided into three realms: Arthedain,\nCardolan and Rhudaur. One by one, these kingdoms fell to war, plague,\nand assaults by the evil-realm of Angmar and finally ended in TA 1975\nwith the death of its last King Arvedui. The last of the Dúnedain of\nArnor had become a dwindled and wandering people known as the Rangers of\nthe North.\n\nNonetheless, the line of Isildur was maintained through the Chieftain of\nthe Rangers of the North. Aragorn II was Isildur's Heir through\nthirty-nine generations, and it was he who reunited the Kingdoms of the\nDúnedain after three thousand years of separation."
  },
  {
    "title": "Elendili",
    "page_id": "581",
    "text": "The Faithful_Elendili_' or ELF-FRIENDS are a faction of\n    Númenóreans who advocated continued friendship with the Elves. They\n    were also called the FAITHFUL for their continued devotion and\n    obedience to the Valar. Their most noted leader was Elendil, Lord of\n    Andúnië, who later founded the kingdoms of Arnor and Gondor in\n    Middle-earth.\n\nBy the close of the Second Age Númenóreans had become split between the\nElendili and the King's Men — a faction centered around the King that\nsought to assert Númenórean authority and self-determination. With\nNúmenor reaching the apex of its might, the King's Men eventually\nespoused open defiance of the Valar. This split would eventually\nprecipitate the Fall of Númenor.\n\nThe Elendili, however, not only preserved their ancient friendship with\nthe Elves, they also regarded the burgeoning arrogance of the King's Men\nas blasphemy. But the King's Men became more powerful, and by the end of\nthe Second Age had begun to persecute the Elendili as rebels and\ndissidents. Fearing their growing strength, the King's men secured the\nFaithful's deportation from their strongholds in the western regions,\nnotably around the city Andúnië.\n\nThe Elendili enjoyed a brief respite when Elf-friend Tar-Palantir\nassumed kingship and began to turn Númenor back to the ways of the\nFaithful. But after Tar-Panatir died, his nephew Ar-Pharazôn usurped the\nthrone and the Elendili were more vigorously oppressed, this time with\nthe help of the Dark Lord Sauron, who had established an evil cult on\nthe island to corrupt and eventually destroy Númenórean society.\n\nAs Ar-Pharazôn led his grand armada to Aman to challenge the Ban of the\nValar, Elendil and the remaining Elf-friends were warned by the divine\npowers to leave Númenor forever. They were thus spared the downfall of\nNúmenor when, as punishment for an attempt to defy the Ban, Ilúvatar\nsank the island kingdom into the sea.\n\nThe Elendili, under the leadership of Elendil and his sons, eventually\nmade their way to refuge in Middle-Earth where they were welcomed by the\nElves. There they established the Dúnedain kingdoms of Arnor and Gondor.",
    "name": "The Faithful",
    "other_names": "_Elendili_,\n\nElf-friends",
    "origins": "Númenór",
    "leader(s)": "Tar-Palantir\n\nAmandil\nElendil\nIsildur\nAnarion",
    "dominions": "Númenor (early)\nArnor and Gondor (later)",
    "rivalries": "The King's Men",
    "languages": "Adûnaic, Westron, Sindarin",
    "lifespan": "Númenóreans lived around 350 years while royal kindred lived 400 years\n(formerly)\n\n150-180 years of average except the Kings and Chieftains of the Dúnadan\nwho had a considerably longer lifespan.",
    "distinctions": "Mortality, Wisdom",
    "height": "Usually tall",
    "skin_color": "Fair",
    "hair_color": "Black, brown, blonde, grey or white (in later years)"
  },
  {
    "title": "Edain",
    "page_id": "656",
    "text": "The EDAIN (sing. ADAN) also known as ATANATÁRI, FATHERS OF MEN, and_'\nThree Houses of Men_', are a group of Men that came to the Beleriand\nfrom the Far East during the First Age.\n\n\nHistory\n\nIn the early fourth century of the First Age the Edain, drawn towards\nthe Light of the West, came into Beleriand where they befriended the\nelves, entered their service, received land and title for that service,\nand fought valiantly in the Battles of Beleriand. Some, however,\nremained in Estolad or fled south or east from the power of Dark Lord\nMorgoth, and passed from history until the Third Age. Despite their\nmighty heroes, the Edain were decimated by the hordes of Morgoth, but\none of their numbers, Eärendil of the House of Hador, sailed to Aman and\nobtained from the Valar the aid by which Morgoth was defeated in the\nLast Battle. The remnant of the Edain, now increased in body and mind by\nEönwë, then sailed to Númenor and became known as Númenóreans and later\nthe Dúnedain who came to live in Middle-earth in the Realms in Exile\nafter the Fall of Númenor.\n\n\nThree Houses of Man\n\nThey were divided into three tribes, or “Houses”:\n\n1.) The HOUSE OF BËOR: they were dark-haired and stoutly built, and most\nresembled the Ñoldor of all Elves. They were first discovered by Finrod\nFelagund, Lord of Nargothrond, and under his guidance later made their\nway to the lands of the Ñoldorin lord Amrod, in a place later known as\nEstolad, the Encampment. They remained loyal to the House of Finarfin,\nand later settled in the lands of Dorthonion.\n\n2.) The Second House, later known as the HALADIN or the HOUSE OF HALETH:\nThey were a reclusive folk, dark-haired but smaller in stature than the\nBëorians. They usually kept separate from the other Men, and were later\ngranted permission to settle in the Forest of Brethil, part of Doriath.\nThey mostly kept out of the wars.\n\n3.) The HOUSE OF MARACH, later best known as the HOUSE OF HADOR: They\nwere originally led by Marach but later took the name of Hador in honor\nof him. Tall and golden-haired, they most resembled the Vanyar of the\nelves. They were a very numerous and war-like tribe, and the Green Elves\nof Ossiriand feared them. They first settled in Estolad, then in the\nsouthern parts of Ered Wethrin (Mountains of Shadow), and then later in\nDor-lómin. They were loyal to Fingolfin.\n\n\nCharacteristics\n\nThe Edain were tall, fair, and strong; their spirits were noble, they\nwere fierce in war, and they shunned all dealings with evil. In\nBeleriand the Edain loved the Eldar, from whom they learned much wisdom,\nand they were further ennobled by the two marriages of Elda and Adan:\nBeren and Lúthien and Tuor and Idril. The lifespan of the Edain before\nthey entered Beleriand was probably about 70 years; in Beleriand, it was\nlengthened to 90, but few of the Edain lived to old age in peace.\n\n\nLanguage\n\nThe language of the Edain (at least those of the First and Third Houses)\nwas related to Adûnaic, but in Beleriand, most of the Edain spoke\nSindarin, and so the tongue of the Haladin was alien to them.\n\n\nFate of the Edain\n\nThe House of Bëor was nearly wiped out by Morgoth, and the remainder of\nits people merged with the Hadorians and became the Númenóreans. It\nwould seem that the Haladin of Beleriand were completely wiped out, or\nat least disappeared as a separate people.\n\nWhen they returned as Númenóreans to Middle-earth in the Second Age,\nthey encountered many men who were obviously related to the Atani: they\nclassified these men as _Middle Men_, and established friendly relations\nwith them. Examples are the Rohirrim, the Men of Dale, and the\nBreelanders.\n\nOther men, such as the Dunlendings, were not recognised as Middle Men\nbecause they were related to the Haladin rather than Bëorians or\nMarachians, and they were hostile to Númenor.\n\nA fourth kind of men came with the Second House, and called themselves\n_Drughu_. This name was adopted in Sindarin as _Drúedain_:\n_Drû_+_Edain_. They were a strange people, living with the Haladin in\nthe forest of Brethil, some even apparently made it to Númenor, but they\ndied out or had left before the Akallabêth. In the Third Age, their far\nkin were known as the _Woses_ of the Drúadan Forest. They had dwindled\nto a very small number and were secretive but were renowned for the\nassistance they gave to the Rohirrim in the War of the Ring.\n\n\nEtymology\n\nThe Sindarin word _Edain_, singular _Adan_ (Quenya _Atani_, _Atan_),\nliterally meant _Second People_, and originally referred to all men, but\nlater it only applied to the Men of Beleriand and their descendants. The\nQuenya term _Atani_ kept its old meaning.",
    "pronunciation": "_EH-deyen_",
    "origins": "Men who crossed into Beleriand",
    "gallery": "IMAGES OF EDAIN",
    "languages": "Mannish, Sindarin",
    "locations": "Beleriand, Middle-earth, Númenor",
    "members": "Húrin, Túrin, Tuor, Beren, Barahir, Andreth, Morwen, Bëor"
  },
  {
    "title": "Númenóreans",
    "page_id": "897",
    "text": "NÚMENÓREANS were the scion of the Edain, the most noble race of Men\nduring the First Age. These men were given the island of Numenor at the\nbeginning of the Second Age by the Valar.\n\n\nOrigins\n\nAs mentioned, the Númenóreans were the descendants of the Edain, the\nElf-friends of the First Age. As a reward for their services during the\nWar of Wrath, the Valar gave them an island continent in the western sea\nwhich became Númenor as their abiding place. They also gifted with far\nlonger life (300 years or more average), greater height, and greater\nwisdom.\n\nNúmenor, which had been raised up by Ulmo, was shaped like a star upon\nthe ocean, and was in between Aman and Middle-earth. These Edain reached\nthe island in the year 32 S.A.. Elros, the brother of Elrond, was their\nfirst king.\n\n\nPhysical Characteristics\n\nBeing descendants of the Edain, the men of Númenor were well bred.\nExceptionally strong individuals were legendary.\n\nMost had dark hair, however lighter hairs (blondes) did exist. They were\nalso on average very tall; with Six foot, four inches being the average\namong them. Many far exceeded such height; Elendil himself being\nnicknamed “_ELENDIL THE TALL_” being over seven feet high. One\ncharacteristic that set them apart from typical men was their ages.\nNúmenóreans were not immortal as the Elves or Ainur, however in\ngratitude in their service during the War of the Wrath, they were\nblessed with extended lifespans averaging over 300 years. Bloodlines\nfrom the House of Elros could live for over 400-500. They aged slower\nthan their typical counterparts.\n\n\nHistory\n\nFrom the start, the friendship of the Númenóreans was between the\nDúnedain of the West and the Eldar of Eressëa. The white swan ships of\nthose Eldar brought many gifts to the Númenóreans: birds, trees, herbs,\nand more. Unfortunately, as time progressed, the kings of Numenor began\nto envy the Eldar for their immortality, and a fear of death infected\nthe island. Later on, kings fell dead, decrepit and witless, as they\nhopelessly clung to their lives. Thus faded the bliss of the\nNúmenóreans, if not their power. They had sailed the earth to the East\nin their wooden ships, and even glimpsed from their tall ship prows the\nGates of Morning, in the eastern continent. They founded many colonies\nin Mortal Lands, north and south, and there they ruled. With the gradual\ncreation of a colonial empire, the pride of the Kings grew. The old\ncustoms were for the most part abandoned; those that were kept were kept\nout of fear of the Valar. Most of the Númenóreans distanced themselves\nfrom the Eldar, and towards the end they persecuted any who were in\nfellowship with them. The 25th King, and also the last, Ar-Pharazôn, was\nmade angry by the reemerging Sauron in Mordor. The King sent a vast\narmy, so large and imposing that Sauron found himself deserted by his\nown armies, not a single large battle fought. But what Sauron could not\ncrush with his armies, he would manipulate with cunning mind and\nhoneyed-tongue. He prostrated himself before Pharazôn, and was taken\nprisoner. In less than three years, the Dark Lord had gone from\ntop-priority prisoner to the King's greatest councilor. All save one\n(Lord Amandil of Andúnië) of the Royal Council fawned on Sauron.\n\nAfter many years, the king felt the shadow of death near, and Sauron,\never the opportunist, seized his chance. He told the aging king of “The\nGiver of Freedom and Life” Melkor, behind closed doors. The king,\ndesperate to escape death, turned to the worship of the Dark. At\nSauron's urging, a great temple was built, and the tree Nimloth was cut\ndown, though not before Isildur, Amandil's grandson, escaped with a\nfruit of the tree. In the year 3310 SA, Sauron urged Pharazôn to take\nwhat the king desired for so long, the immortality of Aman. In 9 years,\na vast fleet was made ready, and Pharazôn, almost wavering, boarded his\nflagship, Alcarondas, and set sail. 39 days later, Numenor met with\napocalypse. The king had landed at Aman, and the Valar had ceded\nguardianship of Arda to Eru. Eru tore Aman away from the world, and\nformed the flat disc of Arda into a globe.  Númenor\nwas flooded, and its proud towers and walls crumbled. Sauron was taken\nunawares, and his last fair form was destroyed, and “as a gale” he\nescaped. Not all the Númenóreans were killed, however. Nine ships, led\nby Elendil son of Amandil escaped to the North of Middle-earth, and\nthere founded the kingdoms of Gondor and Arnor. The race of Black\nNúmenórean colonists existed far away in Harad still, as well as the\nrest of the Númenóreans' colonies.",
    "other_names": "Númenóreans",
    "dominions": "Númenor, Eriador, Harad, later Arnor and Gondor",
    "languages": "Adûnaic (native tongue), Quenya, Sindarin",
    "members": "Elros, Aldarion, Ar-Pharazôn, Elendil, Isildur",
    "lifespan": "Númenóreans - 300-350 years\nKings of Númenor - 400-500 years",
    "distinctions": "Increased lifespan, wisdom, and physical abilities",
    "height": "Taller than other men",
    "pronunciation": "_NOO-meh-NOR-ee-ans_",
    "other names": "Men of Westernesse",
    "origins": "Descendants of the Edain",
    "affiliation": "Eldar",
    "rivalries": "Sauron",
    "average height": "Taller than other Men",
    "gallery": "IMAGES OF NÚMENÓREANS",
    "locations": "Númenor, Eriador, Harad, Umbar, Pelargir, later Arnor and Gondor"
  },
  {
    "title": "Black Númenórean",
    "page_id": "893",
    "text": "The BLACK NÚMENÓREANS were a fallen group of Númenóreans who were\ndescended from those loyal to the Númenórean crown but opposed to the\nValar and relations with the Elves. They listened to the words of\nSauron. Soon they were corrupted by him, and would come to worship the\nDarkness and Morgoth.\n\n\nHistory\n\n\n\nSecond Age\n\nOrigins\n\nAs the power and knowledge of the Númenóreans grew throughout the course\nof the Second Age, they became increasingly preoccupied with the limits\nplaced on their contentment in the world - and eventually their power -\nby mortality, the purpose of which they began to question.\n\nAs time went on they began to fear death more and more and ultimately\nwished to escape it. So the Númenóreans became envious of the immortal\nElves (the Eldar), whom they had come to physically resemble as part of\ntheir reward from Ilúvatar for having been their allies. The Eldar\nsought ever to remind the Men of Númenor however, that death was a gift\nfrom Ilúvatar to all Men, and to lose faith in Ilúvatar would be\nheretical.\n\nNevertheless, after SA 2221, when Tar-Ancalimon became King of Númenor.\nThe 'King's Men' therefore became increasingly predisposed to the\ncorruption of Sauron after he came to Númenor.\n\nEventually, in Númenor's last years, its hugely powerful but elderly\nKing Ar-Pharazôn, who had become “frightened of old age” (_Letters_,\nno.156), was persuaded by Sauron that Ilúvatar was a lie invented by the\nValar, and seduced him. Within Númenor, the majority immediately\nfollowed suit, and this worship quickly passed across the ocean when\nthey sailed eastwards from Númenor, to most of Númenor's colonies in\nMiddle-earth where the group started in proper.\n\nThe group thrived in Middle-earth, particularly in Umbar after the\ndestruction of Númenor. They continued to oppose The Faithful, from\nwhich came the Kings of Arnor and Gondor, the Black Númenóreans remained\nloyal towards Sauron.\n\nThree of the Ringwraiths can be considered among the first and most\npowerful Númenóreans who were corrupted by Sauron, 1000 years before the\nDownfall: they served Sauron, being enslaved to his will, having become\nso because of their lust for power or knowledge.\n\nThese sacrilegious 'black arts' and 'follies', which arose as a\nconsequence of their worship of 'The Dark' and Melkor, marked the final,\nirrevocable division between the 'King's Men' and the minority known as\nthe 'Faithful' Númenóreans, or the 'Elendili', who kept to their old\nfaith in Ilúvatar. They were also presumably the earliest culture traits\nof those who became known afterwards as Black Númenóreans.\n\nAfter the Fall of Númenor\n\nFor many centuries after the Downfall, descendants of the 'King's Men'\nheld onto colonies in Middle-earth, what became the most northerly and\nfamous of their Realms in Exile, Umbar.\n\nMost of those few Númenóreans who had never disavowed the Eldar, and had\nalways remained true to their belief in Ilúvatar, also survived the\ndestruction of their homeland, and they established their own Realms in\nExile north of Umbar, in familiar and friendly colonies. The Faithful\nNúmenóreans saw their southern counterparts as renegades. The Black\nNúmenóreans held a similarly low opinion of 'The Faithful' and their\ndescendants.\n\nOnly two Black Númenórean lords are named from the time of the late\nSecond Age: Herumor and Fuinur. Like all Black Númenóreans and 'King's\nMen' before them, Herumor and Fuinur desired power over men of other,\n lesser races, and they “rose to (great)\npower amongst the Haradrim”, the peoples neighbouring Umbar. Their fate\nis unknown, but they were likely defeated along with Sauron at the War\nof the Last Alliance of Elves and Men.\n\nThird Age\n\nThe Black Númenórean style of rule was no doubt tyrannical, but may also\nhave involved a tradition of duumviracy, at least in Umbar, whose lords\nare usually paired when mentioned; Herumor/Fuinur for example, were\nprobably rulers of Umbar, as much later Angamaitë/Sangahyando were.\nWhatever political system was in place, however, the Black Númenóreans\ndid not govern effectively.\n\nThe triumph of the Last Alliance marked the decline of the Black\nNúmenórean race and the end of their racial superiority. Nevertheless,\nthe Black Númenórean elite survived at least in Umbar for over a\nthousand years after Númenor's fall, maintaining much influence in\nHaradwaith. As late as Angamaitë for example, even after being exiled\nfrom their homeland for nearly a century.\n\nBlack Numenoreans in the 3rd age eventually joined The Witch King of\nAngmar in his conquests of Arnor. The fate of the Black Numenoreans of\nAngmar is unknown, but it's most likely they either all died or\ndisbanded after the Battle of Fornost.\n\nThe Black Númenóreans did not use Westron, but probably retained their\nold tongue Adûnaic, speaking a dialect of it. (In The Notion Club\nPapers, part of Sauron Defeated, Arundel Lowdham cited two descendants\nof classical Adûnaic. One of these must have been Westron, the other the\ntongue of the Black Númenóreans (Black Adûnaic?).\n\nThe Black Númenóreans are absent from recorded history after their\ndefeat by Ciryaher in TA 1050, but a  population of sorts must have survived somewhere at least\nuntil the end of the Third Age, as the Mouth of Sauron, who mocked the\narmy of King Elessar in front of the Black Gate was described both as a\nBlack Númenórean and “Renegade”, which is presumably the term used by\nthe Free Peoples of that time to describe all folk of similar ancestry.\n\nIn one of his letters, Tolkien wrote that Queen Berúthiel, wife of\nGondor's King Tarannon Falastur was a Black Númenórean, from a Black\nNúmenórean realm he describes as “the inland city” somewhere south of\nUmbar. This was a loveless union, and was presumably a political\naccommodation: that such arrangements were possible implies the\nexistence at that time of more Gondor-friendly Black Númenóreans than\nthe much later Mouth of Sauron.",
    "other_names": "Black Númenóreans",
    "dominions": "Númenor (at first)\nThen Umbar, Angmar, Harad, & other southern lands",
    "languages": "Adûnaic, Westron, Black Speech",
    "lifespan": "Regular Númenórean lifespan: 300-350 years",
    "origins": "Númenóreans seduced by Sauron",
    "rivalries": "Gondorians",
    "gallery": "IMAGES OF BLACK NÚMENÓREANS",
    "affiliation": "Sauron",
    "locations": "Primarily Umbar, other southern lands",
    "members": "Herumor, Fuinur, Berúthiel, The Mouth of Sauron"
  },
  {
    "title": "Avari",
    "page_id": "905",
    "text": "The AVARI were a branch of the Elves in Middle-earth.\n\n\nHistory\n\n\n\nWhen Oromë found that Elves that awakened in Cuiviénen, he invited them\nto come with him to Valinor. All the Minyar and most of the Tatyar and\nNelyar were persuaded and followed Oromë into the west on the Great\nJourney. The remainder of the Tatyar and Nelyar remained suspicious of\nthe Lords of the west, seeing them only in their wrath, or they simply\nrefused to depart from their own lands, and spread gradually throughout\nthe wide lands of Middle-earth. They were after known in Quenya, the\nlanguage of the Eldar that eventually reached Valinor, by the name\n_Avari_, meaning “the Unwilling”, because they refused the summons.\n\nHaving never come to Valinor, the Avari remained wild folk, dwellers of\nforests. Little is known of them, as they do not appear in any of the\ntales, save some references to Avari creeping in the south of Beleriand\nin the First Age. Some of them merged with the Nandor and Sindar in\nEriador and the Vale of Anduin. Also, it is speculated that the Dark\nElves were the first other sentient race encountered by the race of Men\nduring their infancy. The Dark Elves probably taught them many of the\nbasic crafts of civilization, though the craft of the Eldar surpassed\nthat of the Avari even more than that of the Avari surpassed primitive\nMen.\n\nIn _The War of the Jewels_, names of six tribes of Avari in their own\nlanguages are given, all being cognates of the Quenya word Quendi (_the\nSpeakers_): KINDI, CUIND, HWENTI, WINDAN, KINN-LAI, PENNI. They are the\nonly certain Avarin words ever mentioned in the published Middle-earth\nmaterial. It is speculated however that Dorwinion was an Avarin land,\nwith WINION carrying the meaning of “Wine”.\n\nThe Silmarillion contains a suggestion that orcs may be descended from\nAvarin elves captured and corrupted by Melkor.\n\nEöl was called the 'Dark Elf' for he shuns the daylight, preferring to\nstay within the dark woods of Nan Elmoth and walk under the moon and\nstarlights but he is not of Avari origin for he is a kin of Thingol. His\nroots lies with the Teleri, who did not go to Aman, later called the\nSindarin under the rule of Thingol and Melian the Maia.\n\n\nOther versions of the legendarium\n\nIn older versions of the legendarium, the name _Avari_ was originally\nthat of the later Eldar, then meaning “those that departed”.\n\nIn other, relatively late writings, a brief idea was that the Avari did\nnot come from the three clans, but from two other clans, led by Nurwë\nand Morwë. This idea was later dropped. In the final conception, the\nelves were divided into three tribes.",
    "other names": "Dark-elves, the Unwilling",
    "origins": "Elves who refused to make the Great Journey",
    "members": "Possibly Morwë, Nurwë",
    "languages": "Avarin languages",
    "gallery": "IMAGES OF AVARI",
    "locations": "Cuiviénen, Taur-im-Duinath, Rhûn, Eriador, Vales of Anduin",
    "skin color": "White",
    "lifespan": "Immortal"
  },
  {
    "title": "Dunlendings",
    "page_id": "916",
    "text": "DUNLENDINGS, also known as\nWILDMEN OF DUNLAND, were the people of Dunland. They were known as a\nfierce culture of Men who sought vengeance on the people of Rohan who,\nas Saruman rightly said, drove them into the mountains. In _The Two\nTowers_, Saruman used their anger to manipulate and convince them to\ndestroy the land of Rohan during the War of the Ring. He sends them\nacross Rohan, burning and looting the land.\n\nDunlending Wildmen come from the land of Dunland. When looting Rohan\nearlier in the Third Age, they are led by a Dunlending named Wulf son of\nFreca.\n\n\nHistory\n\n\n\nIn the years of the Second Age before the Númenóreans settled in\nMiddle-earth, the tribal Hill-men inhabited the lands west and south of\nthe Misty Mountains, as far down as the valleys surrounding the White\nMountains.\n\nWary of the men who came out of the west, they came to fear and hate\nthem. They were hunted and persecuted in such numbers that they had\ndwindled by the start of the Third Age. At this time they had come to\ncongregate in the valleys of the White Mountains and the grassy plains\nof Dunland, which lay west of the Misty Mountains between Moria and\nIsengard; a few went north, and became the ancestors of the Men of Bree.\nDunland then became the area most populated by these men, who came to be\ncalled Dunlendings.\n\n\n\nWhen Eorl and his people were granted Calenardhon --- Rohan, as it would\nlater be known --- in TA 2510, they drove the Wild Men from their new\nlands, earning their bitter hatred and enmity. The Wild Men were also\ndriven from the White Mountains by the Men of Gondor. During the next\nfive hundred years these shorter, dark-haired warriors made frequent\nattacks upon the outlying settlements of Rohan, exacting revenge upon\nthe usurpers, whom they called “straw-heads” because of the high number\nof blond warriors among them.\n\nAs a consequence, Rohan maintained patrols and garrisons to the west of\nthe Fords of Isen to try to limit the number of raids, although these\npatrols had virtually disappeared under Wormtongue's stewardship, to the\npoint where Saruman's forces could make incursions almost at will.\n\nYet not everybody took against the Wild Men. At some point near the end\nof the thirtieth century of the Third Age, Saruman made contact with\nthem and swayed them to his side by playing on their resentment and\nhatred of those who had taken what was theirs.\n\nSaruman welcomed to Orthanc a large warband of these Dunlendings.\nSaruman evidently convinced them that they could reclaim what had been\ntaken, and during the early part of TA 3019, a fearsome raiding force\ncomprising Dunlendings, Orcs and Uruk-hai left Isengard and began\nravaging the western settlements of Rohan. Previous attacks by Orcs and\nUruk-hai had killed many Rohirrim at the Fords of Isen, so there were no\nwarriors to defend against the surprise attack.\n\n\n\nMany people of Rohan were killed in these attacks, but the raiders never\nmade it across the country to Edoras; it is fair to assume that they\nencountered one or more Éoreds, companies of mounted warriors, who would\nhave been patrolling the interior. After the defeat of Isengard at the\nBattle of the Hornburg, the Rohirrim spared the surviving Dunlendings\nand used them as workmen to repair the broken walls of the Hornburg.\n\nThe Rohirrim's mercy surprised the Dunlendings, as Saruman had convinced\nthem the Rohirrim would slaughter them all if given the chance. When\nGandalf, Frodo Baggins, Sam Gamgee, Merry Brandybuck, and Pippin Took\nwere traveling through Dunland on their way back towards the the Shire,\nthe Dunlendings in that area hid from them. After the War of the Ring,\nthe Dunlendings sent ambassadors to the court of King Aragorn, thus\nfinally began peace and diplomacy between Gondor and Rohan with the\nDunlending realms.\n\n\n\n\nCulture\n\nThe Dunlendings were hill-folk used to living in harsh conditions, often\nseen in leather garb and fur cloaks. They may have been related to the\nSnowmen of Forochel in the north. They were a tough, hardy people, big\nand powerful with long, unkempt hair and beards. The Dunlendings,\nbecause they lived in the hilly and forested area of Dunland, most\nlikely hunted, foraged, and fished for food, with agriculture being a\nlesser form of food production.\n\nThe Dunlendings, due to their way of life, probably were very skilled\nwith bows. Dunlendings are also described as using cavalry at the Fords\nof Isen. Most Dunlendings probably fought, however, on foot, with long\nspears, axes and other melee weapons (as with most self-arming forces,\nswords were expensive and therefore a rarity).  Armour for most soldiers\nwas light, but well-off warriors and chieftains likely made use of\nchainmail and were clad similarly as their Rohirrim counterparts.\n",
    "other_names": "Dunlenings, Wild Men",
    "dominions": "Dunland",
    "rivalries": "Rohan",
    "languages": "Westron, Dunlendish",
    "notable_members": "Freca, Wulf",
    "lifespan": "Short to average (around 30-50 years) [_citation\\ needed_]",
    "distinctions": "Minimalistic clothes, tanned, barbaric, bitter [_citation\\ needed_]",
    "height": "Generally tall, shorter than Dunadain on average",
    "skin_color": "Tanned ruddy to olive brown, “swarthy” [_citation\\ needed_]",
    "hair_color": "Brownish, dark, black, grayed, auburn, red [_citation\\ needed_]",
    "locations": "Dunland",
    "members": "Squint-eyed Southerner, Freca, Wulf",
    "hair color": "Dark",
    "skin color": "Dark",
    "gallery": "IMAGES OF DUNLENDINGS"
  },
  {
    "title": "Wood-elves",
    "page_id": "933",
    "text": "WOOD-ELVES, or SILVAN ELVES, were a class of Elves that lived near the\nBlue Mountains. They were added to the number of High Elves, and they\nshared the lands with the Dwarves.\n\nThe best known Wood-elves are the Elves of the Woodland Realm in\nNorthern Mirkwood and Lothlórien. In the First Age the elves of\nOssiriand, the Laiquendi, were also referred to as Wood-elves.\n\nSilvan Elves were of Nandorin descent but they were mainly governed by\nSindar and Noldorin rulers. Examples of such rulers were Thranduil, the\nKing of the Woodland Realm in Northern Mirkwood, Amdír and his son,\nAmroth, who ruled over Lothlórien, and Celeborn, who too ruled over\nLothlórien with his wife Galadriel who was a Ñoldor elf.\n\nSilvan Elves were considered to be less wise than other Eldar, but were\nmore wise than men. Some of them were almost indistinguishable from the\nAvari, those who never joined the Great Journey.\n\nMirkwood\n\nThe Silvan Elves of Mirkwood (formerly known as Greenwood the Great)\nwere known to be distrustful of Dwarves but friendly to Men, with whom\nthey trade. Mirkwood had been called Greenwood the Great until around\nthe year TA 1050, when the shadow of the Dark Lord Sauron fell upon it,\nand men began to call it Mirkwood. During his journey to the Lonely\nMountain, Bilbo Baggins had to rescue the Dwarves of Thorin II\nOakenshield's company from these Elves. These Elves were also one of the\narmies in the Battle of the Five Armies.\n\nLegolas of the Fellowship of the Ring, although he lived among them and\npresented himself as one of the Silvan folk, was not one of them. As a\nson of the Elven-king Thranduil, who had originally come from Doriath,\nLegolas was actually at least half of Sindarin heritage on his father's\nside (his mother's identity is unknown, though it is likely she was of\nSilvan background). This was complicated by the fact that a small\nminority of Sindarin Elves ruled the predominantly Silvan Woodland Realm\nof Northern Mirkwood, a minority to which Legolas belonged. The Sindarin\nminority in that realm, who should have been nobler and wiser than the\nSilvan Elves, could be seen as having “gone native” at the end of the\nFirst Age after Morgoth was defeated and all the grand elf kingdoms of\nBeleriand were destroyed.\n\nIn the cartoon version of _The Hobbit_, they have been depicted as\nhaving green skin and brown clothes which were very primitive in\ncomparison to the other elves portrayed in the movie.\n\n\n\nLórien\n\nThe Silvan Elves of Lórien were known as part of the Galadhrim,\nliterally “tree-folk”. However, the Galadhrim of Lorien also included a\nmixture of elves of Nandor, Noldor, and Sindar descent. Galadriel was of\nNoldor descent, being the daughter of Finarfin, while Celeborn was of\nSindarin descent of the Kingdom of Doriath. At the time of the War of\nthe Ring they spoke an accent or dialect of Sindarin which had changed\nso much that Frodo Baggins, who spoke Sindarin, could not understand\nthem. Additionally, few Elves of Lórien could speak Westron, so that\nHaldir, one of the few that could, had to accompany them on their way to\nCaras Galadhon. Haldir has been speculated to be a Sindarin Elf, but\nthere is no absolute evidence to confirm this. The only evidence is that\nhe shares the white blond hair of Thranduil and Legolas, who themselves\nare Sindarin.",
    "other names": "Wood-elves",
    "origins": "Teleri who fell away from the Great Journey",
    "locations": "Belfalas, Lothlórien, Mirkwood, Ithilien",
    "affiliation": "Last Alliance of Elves and Men",
    "rivalries": "Dwarves",
    "languages": "Silvan Elvish, Sindarin, Westron",
    "members": "Nimrodel, Mithrellas, Galion, Haldir, Rúmil, Orophin",
    "lifespan": "Immortal",
    "distinctions": "Secretive, lovers of the forests and animals, less wise than other Eldar",
    "gallery": "IMAGES OF SILVAN ELVES"
  },
  {
    "title": "Nandor",
    "page_id": "906",
    "text": "The NANDOR (Quenya; IPA: ; singular NANDO; ) were Elves of Telerin\ndescent, who left the Great Journey from Cuiviénen to Valinor as the\nElves reached the Misty Mountains.\n\n\nHistory\n\nThe Nandor began under the Teleri Elf Lenwë or _Dan_ in their language,\nwho led a group that turned south along the river Anduin, and\ndisappeared from written history. _Nandor_ eventually became their term\nfor themselves, and meant _people of Dan_ in their own language. Many\nyears later a group of Nandor under Denethor, son of Lenwë, hearing of a\ngreat Elven realm crossed the Blue Mountains into the Ossiriand, which\nwas after named Lindon, or _Land of the singers_, after these elves.\nAfter their settlement, they became known as the Laiquendi, the Green\nElves.\n\nIn later years, the Silvan Elves of Mirkwood and Lothlórien were\ndescended from the Nandor (but most of their lords were not), as were\nthe elves which dwelt at Edhellond near Dol Amroth during the early days\nof Gondor.\n\n\nLanguage\n\nThe original Nandorin language gradually disappeared from Middle-earth\nafter the end of the First Age, when Sindarin Elves merged with the\nSilvan folk and were taken as their lords. Nandorin/Silvan gradually\nbecame extinct, surviving only in placenames such as\n“Laurelindórinan/Lindórinand” (old names for the land of Lórien) and\nproper names such as Amroth. The daily tongue of the Silvan elves became\nSindarin, or Sindarin with some Silvan influences.\n\n\nEtymology\n\nNandor is likely a Quenyan word that meant 'those who turn back'",
    "origins": "Teleri who turned aside from the Great Journey east of the Misty\nMountains",
    "locations": "Vales of Anduin, Ossiriand, Edhellond, Lothlórien, Mirkwood",
    "languages": "Nandorin, Sindarin",
    "members": "Lenwë, Denethor, Nimrodel",
    "lifespan": "Immortal",
    "distinctions": "Secretive, lovers of the forests and animals",
    "average height": "Tall",
    "hair color": "Usually dark",
    "skin color": "White or olive",
    "gallery": "IMAGES OF NANDOR"
  },
  {
    "title": "Silvan Elves",
    "page_id": "932",
    "text": "SILVAN ELVES (also known as '''Woodland Elves ''') are a subgroup of\nthe Nandor, and are thus ultimately of Telerin origin. As Úmanyar, they,\nlike the Sindar, began the Great Journey but did not complete it. In the\nThird Age, most remaining Silvan Elves lived either in Lothlórien or the\nWoodland Realm.\n\n\nHistory\n\nOrigin\n\nThe Silvan Elves were of Nandorin background, descended from the\nfollowers of Lenwë, who were fascinated by the landscape East of the\nMisty Mountains and afraid to attempt to cross them. They thus abandoned\nthe Great Journey, choosing instead to remain in those wide forests,\nwhere they became a scattered people.\n\nLittle is known of the wanderings of the Nandor, save that they spread\nthroughout the Vales of Anduin over a period of many centuries, some\nfollowing the Great River southward, eventually settling at the Mouths\nof Anduin or instead turning north again into Eriador, where eventually\nDenethor gathered as many as he could and crossed the Blue Mountains\ninto Beleriand. These were later known as the Green-Elves of Ossiriand,\nand were welcomed by Thingol as long lost kin.\n\nSome of the Nandor however stayed in the forested Vales, and these would\nbecome the Silvan Elves - hidden away in their woodland fastnesses and\nwere to their estranged kin hardly distinguishable from the Avari, and\nindeed sometimes living in friendship with them. Their language had\ndiverged to such an extent that it was barely intelligible to the Sindar\nand Noldor when these met the Silvan Elves again in the Second Age,\nthough the languages were found to be obviously related. It was not\nuntil this renewed contact between the kindreds and the guidance of the\nSindar and Noldor that the Silvan Elves again became an organised people\nand increased in wisdom. This however also led to the Silvan tongue\nbeing largely forgotten, Sindarin instead becoming the primary spoken\nlanguage by the end of the Third Age, with the Silvan dialects only\nsurviving in several names of places and persons. \n\nThe renewed contact was caused by the destruction of Beleriand after the\nWar of Wrath, for when the Second Age was young, the Silvan Elves\nwelcomed those survivors of the calamity who rather than crossing the\nSea rejoined their kindred east of the Misty Mountains. Indeed soon\nmany of the Silvan Elves came to be ruled by these Sindar refugees,\nprimarily in Lothlórien and the Woodland Realm.\n\nThe Woodland Realm\n\nThe primarily Silvan Elves of Mirkwood were known to be distrustful of\nDwarves but friendly to Men, with whom they traded. Mirkwood had been\ncalled Greenwood the Great until around the year TA 1050, when the\nshadow of the Dark Lord Sauron fell upon it, and men began to call it\nMirkwood. During his journey to the Lonely Mountain, Bilbo Baggins had\nto rescue the Dwarves of Thorin II Oakenshield's company from these\nElves. These Elves sent hosts to both the War of the Last Alliance\nand the Battle of the Five Armies.\n\nLegolas of the Fellowship of the Ring, although he lived among them was\nnot truly one of the Silvan folk. As a son of the Elven-king Thranduil,\nwhose father Oropher had originally come from Doriath, Legolas was\nlikely actually at least half of Sindarin heritage on his father's side\n(his mother's identity being unknown).\n\nIt is important to note that while by the end of the Third Age, Sindarin\nhad become the primary language of the Woodland Realm, Silvan being\nalmost completely forgotten, that in the early years of the Sindarin\nrule over the Silvan Elves here, the Sindar for a time “deliberately”\nadopted the language and customs of the Silvan Elves, as “they wished to\nreturn to the simple life natural to the elves before the invitation of\nthe Valar had disturbed it”. \n\nLórien\n\nThe Silvan Elves of Lórien were the larger part of the Galadhrim or the\nTree-people, who were a mixture of elves of Nandor, Noldor, and Sindar\ndescent. Most of the Sindar that came to Lórien were refugees from\nBeleriand, arriving early in the Second Age, and the Sinda Amdír became\nthe King of Lórien. After Amdír was killed in the Battle of Dagorlad,\nhis son Amroth became King.\n\nAfter the destruction of Eregion, they were joined by many Sindarin\nspeaking Noldor, led by Galadriel and Celeborn, who fled to Lórien\nthrough Moria. Galadriel was of Noldor descent, being the daughter of\nFinarfin, while Celeborn was of Sindarin descent of the Kingdom of\nDoriath. When Amroth was lost in the Third Age, Galadriel and Celeborn\nbecame known as the Lady and Lord of Lórien, but neither of them took\nthe vacant Kingship.\n\nAt the time of the War of the Ring they spoke an accent or dialect of\nSindarin which had changed so much that Frodo Baggins, who spoke some\nSindarin, could not understand them. Additionally, few elves of Lórien\ncould speak Westron, so that Haldir, one of the few that could, had to\naccompany them on their way to Caras Galadhon.\n",
    "other names": "Wood-elves",
    "origins": "Teleri who fell away from the Great Journey",
    "locations": "Belfalas, Lothlórien, Mirkwood, Ithilien",
    "affiliation": "Last Alliance of Elves and Men",
    "rivalries": "Dwarves",
    "languages": "Silvan Elvish, Sindarin, Westron",
    "members": "Nimrodel, Mithrellas, Galion, Haldir, Rúmil, Orophin",
    "lifespan": "Immortal",
    "distinctions": "Secretive, lovers of the forests and animals, less wise than other Eldar",
    "gallery": "IMAGES OF SILVAN ELVES"
  },
  {
    "title": "Haradrim",
    "page_id": "979",
    "text": "The_' Haradrim, KNOWN IN WESTRON AS THE Southrons_' and once as the\n“SWERTINGS” by Hobbits, were a race of Men from Harad in the region of\nMiddle-earth directly south of Gondor. A part of the histories of the\nWestlands is given to the fierce people who in the Second and the Third\nAge of the Sun, came from the hot deserts and forests of sunlands, which\nlay in the South of Middle-earth. These people were ruled by many and\nlords, until in time Sauron the Maia corrupted them and called them to\nwar.\n\n\nHistory\n\nDuring the Second Age the Men of Númenor built a great city in the firth\nof Umbar, a vast natural harbour on the southern shores of the Bay of\nBelfalas, eventually turning the city into a fortified citadel from\nwhose gates the Men of Númenor could levy great tributes upon many of\nthe tribes of Harad.\n\nFor many years, the Haradrim were the greatest enemy of Gondor. Several\ntimes, they invaded the north. Finally, the Men of Gondor were able to\ncapture Harad, though it was later freed. During the War of the Ring the\nHaradrim were allied with Sauron. A Haradrim warrior wounded Faramir. At\nthe Battle of the Pelennor Fields, the 18,000 Haradrim were a great\nthreat to the Rohirrim that had come to aid the people of Minas Tirith.\nDuring the onslaught a Haradrim chieftain, who bore the standard of a\nblack serpent on a scarlet field, led the Haradrim cavalry. King Théoden\nof Rohan slew him in single combat.\n\nOnce Sauron was destroyed, the Haradrim, Variags, and Easterlings\ndisbanded from the Black Gates and out of Mordor, and became dispersed.\n\n\nEtymology\n\nThe name _HARADRIM_ means “South-people”, from the Sindarin _harad_\n(“south”) and _rim_ (“host, group”).\n\nOther names were SOUTHERNS, SOUTHRONS.\n\n\nTraits and culture\n\nThe Haradrim were bold and grim men, fierce in despair. They were tall\nand dark-skinned with black hair and dark eyes, and for that they were\ncalled SWERTINGS or SWARTHY MEN. The men of Near Harad were\nbrown-skinned, with black hair and dark eyes, while the race known as\n“half-trolls” out of Far Harad had black skin.\n\nMany Haradrim warriors were seen in bright clothing, such as scarlet\nrobes, and were decorated with golden ornaments, such as collars,\nearrings, corsets of overlapping brazen plates; they braided their hair\nwith gold. Some tribes painted their bodies. Scarlet and red was also\nthe color of their banners, tips of their spears, and body paint. Their\nshields were yellow and black with spikes. It is also mentioned that\nat the end of the Second Age some of the Men in the south had weapons of\niron. At the Battle of the Pelennor Fields, the Haradrim bore\nscimitars that glittered like stars.\n\nThe Haradrim had tamed the massive _Mûmakil_ beasts and used them in\nwarfare and, like their masters, were decorated with scarlet and gold.\nThey even strapped towers on their backs, used by Haradrim archers and\nspearmen.\n\nHarad's tribes included into those of Near and Far Harad, although there\nwere many tribes of the Haradrim, often mutually hostile. Some of the\npeoples of Far Harad were organized into kingdoms.\n\nLanguage\n\nTo the Gondorians their voices sounded harsh, like shouts of beasts.\n\nThe only word which is stated to come from a southron language is\n“Mûmak”, the name of the great war-oliphaunts of Harad.\n\nGandalf states that his name in “the south” is “Incánus” thought\n_Inkā-nūsh_ (or possibly _Inkā-nūs_), meaning “North-spy”.\n\nDespite having a meaning in Quenya (“fate”), the name Umbar is said to\nbe adapted from the natives' language and not from Elvish or Adûnaic.\n\n\nEnvironment\n\n\n\nThe lands of the Haradrim lie to the south of Gondor past the river\nPoros. In the land south of Gondor, the sun beat down unrelentingly,\ncooking much of Haradwaith into desert.\n\n\nMilitary Tactics\n\n\n\nThe Haradrim are said to be skilled horsemen, though not near the\nprowess of the Rohirrim. They are known to have mounted champions and\narchers, as well as infantry. Horses fear the Mumakil, and so the\nSouthron forces often rally around them when faced with mounted foes.\n\n\nFuture of Harad\n\nMuch of Harad's impressive army was wiped out on the expanses of\nPelennor Fields, during the Battle of the Pelennor Fields. With Sauron\ndefeated, many Harad peoples sent emissaries to the court of King\nAragorn, and peace talks began; however, many other Haradrim tribes\ncontinued hostility with Gondor.\n",
    "name": "Haradrim, Southrons, Swertings",
    "dominions": "Harad, including Umbar, Near Harad and Far Harad",
    "lifespan": "Shorter than Númenórean",
    "skin_color": "Dark",
    "hair_color": "Dark",
    "pronunciation": "_ha-RAD-rim_",
    "other names": "Southrons",
    "locations": "Harad, including Umbar, Near Harad and Far Harad",
    "affiliation": "Sauron",
    "rivalries": "Gondorians",
    "languages": "presumably numerous; different from Common Speech",
    "members": "Black Serpent",
    "average height": "Tall",
    "hair color": "Dark",
    "skin color": "Dark",
    "weaponry": "Oliphaunts",
    "gallery": "IMAGES OF HARADRIM"
  },
  {
    "title": "Ainur",
    "page_id": "2352",
    "text": "The AINUR, also known as the HOLY ONES, are beings encompassing both the\nValar and the Maiar. They were the first and mightiest beings created by\nEru Ilúvatar in the depths of time before the beginning of the World.\n\nThey were primordial spirits who existed with Ilúvatar, and with him\ncreated the world through the '''Ainulindalë, '''the MUSIC OF THE AINUR.\nAfter the creation of Arda, many of the Ainur descended into it to guide\nand order its growth; of these there were fifteen more powerful than the\nrest. Fourteen of these great Ainur became known as the Valar, or Powers\nof Arda. The fifteenth, Melkor, turned aside from that path and became\nthe first Dark Lord. The many lesser Ainur that accompanied the Valar\ninto Arda are known as Maiar.\n\n\nHistory\n\nOrigin\n\nThe Ainur were the 'offspring of Ilúvatar's thought' and each was given\nunderstanding only of that part of the mind of Ilúvatar from which he or\nshe came. The exception to this was Melkor, a brother in spirit to\nManwë, who later became The Lord of the Valar and he was given some of\nthe parts from which the others had come, but for all his gifts he did\nnot know the full mind of Eru. Melkor and Manwë were the most powerful\nof the Ainur.\n\nThe Ainur were 'kindled with the Flame Imperishable', which can be taken\nto mean that they were granted free will by their Creator. Ilúvatar\ninstructed them in the arts of music, until he brought them together to\nmake the Music of the Ainur: the great song that created the Vision of\nIlúvatar and ultimately the real world. In the beginning of the Music,\nthe Ainur were all in harmony with Eru and one another, but Melkor\nturned instead to his own pride, seeking power for himself and bringing\ndiscord to the Great Music. He later led many of the Maiar astray as\nwell.\n\n\nThe Ainur and the World\n\nThrough the Music of the Ainur, Ilúvatar created a Vision of the World;\nhe showed it to the Ainur, and explained much of its nature and destiny\nto them - the Ainur therefore have much knowledge of the World, but are\nnot themselves omniscient. Ilúvatar then granted the World true being by\ndeclaring “Eä”, causing these visions to come into being. Melkor and\nmany of the other mighty Ainur desired to descend into it and form it in\nreadiness for the coming of the Children of Ilúvatar (that is, Elves and\nMen).  Upon descending into the World, the Ainur became known as the\nValar and the Maiar.\n\nThose Ainur who entered the World and chose to live in it at its\nbeginning remain bound to it until its end. Though Melkor was eventually\nthrown into the Void by the others, he is prophesied to return before\nthe end in the DAGOR DAGORATH, the final battle. Little is known of the\nultimate future of the Ainur, even by themselves, but it is said that\nafter the great battle at the end of the World, they will make a Second,\neven greater Music with the Children of Ilúvatar.\n\n\nThe Line of Melian\n\nAmong the many Ainur who entered the World long ago, there was one of\nthe order of the Maiar named Melian. Alone of all the Ainur, she wedded\none of the Children of Ilúvatar, King Elu Thingol of Doriath, and wove\nthe Girdle of Melian that protected Doriath for many centuries. Through\nher, an essence of the Ainur entered the bloodlines of the Elves and\nMen, passed down through generation after generation, and was still\npresent at the time of the War of the Ring. Elrond was Melian's\ngreat-great-grandson, and Aragorn, too, was her descendant, though\nthrough many more generations than Elrond.\n\n\nEtymology\n\nAINUR is a Quenyan word originating from Valarin and means “Holy ones”.\nIt appears to come from the word AINA, meaning 'holy'. Although the\norigin of the second element '''ur '''is less clear, it is possible\nthere is a link between the word 'Ainur' and the word 'Eru' as the first\nelement 'er' means 'one', though this may not be true as there is no\nfurther elaboration on this.\n\nThe singular form of Ainur is AINU, simply meaning “Holy one”.\n",
    "name": "Ainur",
    "dominions": "All of Arda, then later Valinor and Aman",
    "languages": "Westron, Sindarin, Quenya, Valarin",
    "notable_members": "Manwë, Ulmo, Aulë, Oromë, Námo, Irmo, Tulkas, Varda, Yavanna, Nienna,\nEstë, Vairë, Vána, Nessa, Melkor, Maiar",
    "lifespan": "Immortal",
    "distinctions": "Large, holy, strong, powerful, cunning",
    "height": "Varies",
    "skin_color": "Varies",
    "hair_color": "Varies",
    "origins": "Created from Ilúvatar's thought",
    "locations": "Timeless Halls, Arda, Almaren, Aman",
    "people": "Valar, Maiar",
    "members": "Melkor, Manwë, Ulmo, Varda, Aulë, Yavanna, Mandos, Sauron, Gothmog,\nGandalf, Saruman",
    "gallery": "IMAGES OF AINUR"
  },
  {
    "title": "Vanyar",
    "page_id": "2356",
    "text": "The '''Vanyar '''(Quenya; IPA: ; singular VANYA; adjectival VANYARIN; ),\nalso called the FAIR ELVES, '''Light-elves ''', and 'SPEAR-ELVES'\n, were the first and smallest of the Kindreds of the Eldar. Under the\nleadership of Ingwë, the Vanyar were the first to set forth on the Great\nJourney and the first to reach the shores of Belegaer; they sailed to\nAman on the first voyage of Tol Eressëa and remained there permanently.\n\n\n\nThe Vanyar are the fairest of all the elves hence their name: the FAIR\nELVES. Unlike the others who were attracted to the sea or the building\nand forging of things, the Vanyar culture seemed to revolve about Valar\nand Valinor. This is probably the reason why they choose to stay in\nValinor proper centered around Taniquetil, the seat of the rulers of\nArda, and loved the light of Valinor best of all the other places in\nAman and the wisdom of the Valar, and why they were favored by Manwë and\nVarda and always distrusted Melkor. They are known to have had the\ngreatest skill in poetry of all the Elves, likened to Manwë who loves\nthem for it. Their hair colour was golden and their banners white.\n\nIngwë was their king.\n\n\nHistory\n\nVanyar are descendants of Imin, the first Elf to awake at Cuiviénen, his\nwife Iminyë, and six other pairs of Elves who were awoken by them.\nImin's companions, Tata and Enel, later awoke groups of nine and twelve\npairs respectively, and Imin decided that since his group was now the\nsmallest and each group that he and his companions discovered was larger\nthan the last, he would now choose third rather than first in order to\nmake up the numbers. However, only a further two groups were discovered,\nleaving Imin's group of fourteen by far the smallest of the three Elven\nclans.\n\nWhen the Elves were discovered by Oromë, each clan chose an ambassador\nto return with him to Valinor to verify his claims of its greatness. The\nMinyar (Imin's companions) sent Ingwë. Upon his return, his people were\nswayed by his testimony and adopted him as their king (appropriate, as\nthe name Ingwë means chieftain in Quenya), and he led them with Oromë to\nAman. Ingwë has since been reckoned the High King of all Elves, and\nbecame known as Ingwë Ingweron, the “Chief of Chieftains”, and his\npeople were known by the rest of the Eldar as the Vanyar. In Aman the\nVanyar first dwelt in Tirion. Later, they came to love the full light of\nthe Trees and wandered into Valinor or settled on Taniquetil. He dwells\nwith them on the slopes of Taniquetil, beneath the halls of Manwë.\n\nAfter arriving in Aman, the Vanyar were rarely seen even by other Elves.\nVery few individual Vanyar are named besides Imin, Ingwë, his sister (or\npossibly niece) Indis, and Amarië, who was in love with Finrod Felagund.\n\n☀, Indis, the second wife of Finwë, the High King of the Ñoldor and the\nmother of both Fingolfin and Finarfin, the latter of which founded the\nonly house of Noldorin Elves to sport golden Vanyarin hair. After her\nhusband was killed by Melkor in his attack on Formenos to attain the\nSilmarils , she returned to her people with her daughter Findis.\n\nUnlike the Noldor, the Vanyar loved the light of Valinor so much that\nthey never choose to return to Middle-earth save when many of the Vanyar\nmarched in the War of Wrath with the Host of Valinor. Though they\npreferred the peaceful light of Valinor, the Vanyar were skilled in the\narts of war and were known for their fashioning of spears, thus they\nno doubt fielded a formidable army in the war. Ingwë's son led an armed\nhost of his people from Valinor to fight in the War of Wrath. They\nreturned to Aman, along with most of the Eldar living in the now largely\ndestroyed Beleriand, at the end of the First Age.\n\n\nRelations\n\nGaladriel was the granddaughter of Indis. It is to her Vanyarin blood\nthat Galadriel owes her famous silver-gold hair.\n\n\nEtymology\n\nThe name _Vanyar_ means 'Fair-ones' in Quenya , referring to their\ngolden hair. The Vanyar often called themselves MINYAR; IPA: ; “Firsts”;\nsingular MINYA; adjectival MINYARIN; ), their ancient name. This ancient\nname does not still refer to any of the Avari who remained in\nMiddle-earth, since all of the Vanyar heeded the call of the Valar to\ncome to Valinor.\n\n\nOther Versions of the Legendarium\n\nIn the earliest versions of Tolkien's mythology (see: _The History of\nMiddle-earth_), they were called INGWI, as they were the people of\nIngwë, the High King of the Elves.\n\n\nGallery\n\nImage:Indis the Fair by vigshane.jpg|Indis the Fair, the wife of Finwë,\nthe first High King of the Ñoldor and Queen of the Ñoldor, by Filat\nImage:Amarie of the vanyar by Filat.jpg|Amarie, the love of Finrod, by\nFilat",
    "other names": "_Minyar_, Light-elves, Fair-elves",
    "locations": "Oiolossë; Valmar",
    "languages": "Vanyarin Quenya",
    "members": "Imin, Iminyë, Ingwë, Indis, Elemmírë, Amarië, and others",
    "lifespan": "Immortal",
    "distinctions": "Most revered of the Elven kindreds, loved by Manwë",
    "average height": "Tall",
    "hair color": "Golden",
    "skin color": "Pale",
    "gallery": "IMAGES OF VANYAR"
  },
  {
    "title": "Wainriders",
    "page_id": "2483",
    "text": "The WAINRIDERS were a confederation of Easterling tribes who were united\nby their hatred of Gondor, and stirred-up by the Dark Lord Sauron to\nattack Gondor.\n\n\nHistory\n\nFollowing the Great Plague they started their attacks in TA 1856,\ndefeating the army of Gondor and killing King Narmacil II. They rode in\ngreat wagons and chariots (which gave them their name), and raided the\nlands of Rhovanion, destroying or enslaving its people. Gondor gradually\nlost all of its possessions east of the river Anduin to them. The\nthirtieth King of Gondor, Calimehtar son of Narmacil, defeated the\nWainriders at the Field of Celebrant, buying some rest for his land.\nHowever the Wainriders struck back in 1944, allying themselves with the\nHaradrim of Near Harad and the Variags of Khand. They managed to slay\nking Ondoher and all his heirs, but instead of riding on to Minas Anor\nand taking the city, they paused to celebrate. Meanwhile, general Eärnil\nof Gondor's southern army had defeated the Haradrim and rode north to\ndefend his king. He came too late to rescue Ondoher, but managed to\ntotally defeat the Wainriders. Eärnil was crowned king. After this\ndefeat the might of the Wainriders was broken, and they retreated east.\nThey still held Rhovanion, but never troubled Gondor again. It later\nturned out that their attacks had been staged by Sauron to allow him to\nreclaim Mordor while Gondor's watch was diverted.",
    "origins": "Easterlings",
    "locations": "lands east of and around Rhûn; Rhovanion",
    "languages": "various Easterling tongues",
    "rivalries": "Gondorians"
  },
  {
    "title": "Drúedain",
    "page_id": "2780",
    "text": "The DRÚEDAIN, also known as DRÛGS, DRUGHU, RÓGIN, WOSES, WILD MEN OF THE\nWOODS and PÚKEL-MEN, were a strange race of Men that lived in the\nDrúadan Forest by the Third Age. They were counted amongst the Edain.\n\n\nHistory\n\nThe Drúedain developed a close relationship with the Folk of Haleth, the\nEdain that inhabited that forest region. The Drúedain lived among the\nSecond House of Men, the Haladin, in the First Age in the forest of\nBrethil. There were also a number of the Drúedain present in Númenor,\nthough they had left or died out before the Akallabêth, as had the\nPúkel-men of Dunharrow. At the end of the Third Age, the Drûg still\nlived in the Drúadan Forest of the White Mountains, and on the long cape\nof Andrast west of Gondor. The region north of Andrast was still known\nas Drúwaith Iaur, or “Old Drûg land”.\n\nThe Woses of Ghân-buri-Ghân held off Orcs with poisoned arrows and were\nvital in securing the aid of the Rohirrim in the Battle of the Pelennor\nFields. After the War of the Ring, King Aragorn II Elessar granted the\nDrúadan Forest “forever” to them in the Fourth Age, promising that no\nman would enter their forests without the leave of the Drúedain.\n\n\nPhysical characteristics\n\n\n\nThey were an alien folk to the other Men: a bit like Dwarves in stature\nand endurance, stumpy, clumsy-limbed (with short, thick legs, and fat,\n“gnarled” arms), had broad chests, fat bellies, and heavy buttocks.\nAccording to the Elves and other Men, they had “unlovely faces”: wide,\nflat, and expressionless with deep-set black eyes that glowed red when\nangered. They had “horny” brows, flat noses, wide mouths, and sparse,\nlanky hair. They had no hair lower than the eyebrows, except for a few\nmen who had a tail of black hair on the chin. They were short lived and\nhad a deep hatred of Orcs. Their characteristics may have originated in\nthe First Age. People who didn't know them very well may have thought\nthat Morgoth may have captured some men as they did with the elves and\nbred Orcs from their stock leading to the conclusion that the Drúedain\ncould have possibly been Men that escaped, but were more deformed but\nnot very Orc-like. Evidence for this is that both they and Orcs consider\neach other renegades. They were known to have certain magical powers and\nto be still in meditation for long periods of time.\n\n\nEtymology\n\nOther names\n\n-   DRÛG/DRUGHU: (singular and plural) is the name the Drúedain give to\n    themselves in their own language and the name used for a race known\n    to the Elves as the Drúedain, and to Men.\n-   DRÚATH: (plural) was an earlier Sindarin name for them in ancient\n    times.\n-   RÓG/RÓGIN: (singular and plural) is the name that the Rohirrim have\n    for them in their own language.\n-   RÚ/RÚATANI: (singular and plural) is their name in Quenya.\n-   WOSE/WOSES: (singular and plural) was a word Tolkien took from an\n    Old English word, which was meant to be a translation of the\n    Rohhirric 'Róg'.\n-   OGHOR-HAI: (singular and plural) is the name the Orcs gave to\n    them.\n\nOrigin\n\nTolkien got this term from the legendary Woodwoses of European myths.",
    "name": "Drúedain",
    "dominions": "Númenor\n\nBrethil\nDrúadan Forest\nDrúwaith Iaur",
    "notable_members": "Ghân-buri-Ghân, Aghan",
    "lifespan": "Short-lived for Men",
    "height": "Short",
    "skin_color": "Dark",
    "hair_color": "Dark",
    "pronunciation": "_DROO-eh-deyen_",
    "other names": "Woses, Wild Men",
    "locations": "Brethil, Númenor, Drúwaith Iaur, Drúadan Forest",
    "distinctions": "Good stoneworkers, mysterious powers, glowing red eyes",
    "languages": "Drúadan language",
    "average height": "Short",
    "hair color": "Dark",
    "members": "Aghan, Ghân, Ghân-buri-Ghân",
    "gallery": "IMAGES OF DRÚEDAIN"
  },
  {
    "title": "Men of Gondor",
    "page_id": "2834",
    "text": "'''Men of Gondor '''were the Edain descended from the Númenórean\ncolonists (and from their noble kin who escaped the destruction of\nNúmenór in SA 3319) who settled in the southern land of Gondor\nthroughout most of the Second Age\n\nThe DÚNEDAIN OF GONDOR were the descendants of the Exiles of Númenor who\nsettled in the southern lands of Middle-earth, and founded the southern\nkingdom of Gondor. Their first independent King was Meneldil, the nephew\nof Isildur, whose line ruled over Gondor for more than two thousand\nyears. Unlike their cousins in the North, the Dúnedain of the South\nmaintained their realm even after the loss of its Kings, and it survived\nunder the rule of the Stewards until the time of the War of the Ring,\nwhen the Kingship was restored.\n\n\nDescription and Historical accounts\n\nBeing mostly of Númenórean stock and ruled by exiled Númenórean\noverlords, the Men of Gondor continued most of the customs and\ntraditions of Númenór. However, over the centuries, they mixed more and\nmore with the men of Middle-earth. One of these peoples was the Northmen\nwho lived in Rhovanion, and Gondor, ever needing allies, began\nacquainting themselves with these men by the mid Third Age. Brave and\nvaliant, but by the standards of the Dúnedain shorter lived, the\nNorthmen gradually had more and more to do with Gondor, and one of its\nheirs to the throne, Valacar, who lived and worked with them in their\nown land as an ambassador, married one of their noble ladies, setting\nthe stages for the Kin-strife. \n\nOver the next few hundred years afterward, war, rebellion, and plague\nseverally weakened the blood of the Dúnedain in Gondor. Their rulers\nthough survived and retained many of the ancient customs. As the\ncenturies rolled on into the late Third Age, the Men of Gondor\naccustomed to war and invasion became a hardy and stern people more\nlikened to Middle-earth. They became summed up in the phrase, “when\nheads are at a loss, bodies must serve.”\n\nBy the time of just before War of the Ring, the Men of Gondor grappled\nconstantly with the forces of Mordor giving and regaining ground to the\nDark Lord's armies. Their leader Denethor II could foresee nothing but a\nvictory in single combat on the battlefield against him or total doom,\nso when it became clear that Sauron's lost Ring of Power had been found,\nhe and people like his son and others wanted the Ring to be taken by\nGondor and be used against the enemy as a weapon. The Men of Gondor were\nspared the folly of this choice when Denethor's youngest son Faramir let\nFrodo and Sam continue to Mount Doom to destroy the One Ring.\n\nAfter the war was won and Aragorn II Elessar was crowned, the Men of\nGondor were rekindled with the ancient tradition of the Dúnedain of old\nwhen Elendil founded the Two Kingdoms with his two sons: Isildur and\nAnárion. They thrived and prospered as part of the Reunited Kingdom into\nFourth Age and beyond.\n\n\nNotable Men of Gondor\n\nImage:Seanbean boromir.jpg|Boromir Image:Faramir3.jpg|Faramir\nImage:Denethor.jpg|Denethor II",
    "other_names": "Men of Gondor",
    "dominions": "Gondor",
    "languages": "Gondor Sindarin\nWestron",
    "members": "Denethor\nBoromir\nFaramir",
    "lifespan": "80-110 years",
    "height": "Average"
  },
  {
    "title": "Fallohides",
    "page_id": "2850",
    "text": "The FALLOHIDES are one of the three races of Hobbits.\n\n\nHistory\n\nThe Fallohides were the least common of Hobbits, and in their earliest\nknown history they lived in the forested region where later was the\nEagles Eyrie near the High Pass to the north, in the Vale of Anduin. To\ntheir south lived the far more numerous Harfoots, and far south in the\nGladden Fields lived the Stoors.\n\nThe Fallohides were fair of skin and hair, and none of them ever grew a\nbeard. They were great lovers of the trees and forests, and skilled\nhunters. Many of them were friends with the Elves, and because of this\nthey were more learned than the other Hobbits. They were the first to\nlater learn Westron, and the only ones to preserve some of their old\nhistory. They learned Westron from the Men of Arnor, and it was they who\nfirst learned writing.\n\nAfter the Harfoots had migrated westward in the years following TA 1050,\nthe Fallohides followed them around TA 1150. Unlike the Harfoots they\ncrossed far north of Rivendell, and from there later met up with the\nHarfoots. The Fallohides were more bold and adventurous than the\nHarfoots, and many of them became leaders of the Harfoot villages. It\nwas probably under Fallohide rule that the Harfoots migrated westward\nbeyond Weathertop and reached Bree. In TA 1601 two Fallohide brothers,\nMarcho and Blanco, by permission of Argeleb II, the King in Fornost\ncrossed the Brandywine River and colonized the Shire.\n\nAfter this, the Fallohides mixed more and more with the Harfoots and\nlater the Stoors, until the three Hobbit races became one. The\ninfluential Took clan had distinct Fallohide traces both in appearance\nand character, as did the _Oldbuck_ and later Brandybuck clan. Both\nBilbo Baggins and Frodo Baggins were part Fallohide, due to their Took\nand Brandybuck mothers respectively. Other famous Fallohides included\nBandobras Bullroarer Took, who slew an Orc leader, and Peregrin Took as\nson of the Thain was a Fallohide.",
    "locations": "Upper Anduin, Bree, The Shire",
    "languages": "Hobbitish, Westron",
    "members": "Marcho, Blanco, the Bolgers, the Tooks, the Brandybucks",
    "lifespan": "c. 96 years",
    "distinctions": "Least numerous of the three branches of hobbits",
    "average height": "Taller than the other hobbits",
    "hair color": "Fair",
    "skin color": "Fair"
  },
  {
    "title": "Harfoots",
    "page_id": "2853",
    "text": "The HARFOOTS are one of the three races of Hobbits.\n\nHarfoots were the most common type of Hobbits, and in their earliest\nknown history they lived in the lower foothills of the Misty Mountains,\nin the Vale of Anduin, in an area roughly bounded by the Gladden River\nin the south and the small forested region where later was the Eagles\nEyrie near the High Pass to the north.\n\nThey were browner of skin than the other Hobbits, had no beards, and did\nnot wear any footwear. They lived in holes they called _Smials_, a habit\nwhich they long preserved, and were on very friendly terms with the\nDwarves, who travelled through the High Pass on the Great Road.\n\nThe Harfoots were the first to migrate westward into Arnor, and it was\nto them that the name _Periannath_ or _Halflings_ was first applied by\nthe Dúnedain when they were first recorded in Arnorian records around TA\n1050 of the Third Age. They tended to settle down for long times, and\nfounded numerous villages as far as Weathertop.\n\nBy the 1300s of the Third Age they had reached Bree, which long was the\nmost western village of any Hobbits.\n\nThe Harfoots were joined between TA 1150 and TA 1300 by the Fallohides\nand some Stoors. The Harfoots took Fallohides, a bolder race, as their\nleaders.\n\nWhen The Shire was colonized in TA 1601 most of its people were\nHarfoots.\n\nit:Pelopiedi nl:Bruivels pl:Harfootowie ru:Мохноноги",
    "origins": "A group of Hobbits",
    "locations": "Vales of Anduin, Bree, The Shire",
    "languages": "Hobbitish",
    "lifespan": "c. 96 years",
    "average height": "Shorter than the other Hobbits",
    "hair color": "No beards",
    "skin color": "Browner skin",
    "clothing": "No footwear"
  },
  {
    "title": "Stoor",
    "page_id": "2852",
    "text": "The STOORS are one of the three races of Hobbits, they mostly inhabited\nswampy areas.\n\nIn their earliest recorded history the Stoors, like the other Hobbits,\nlived in the Vales of Anduin. They were a riverside people that dwelt in\nthe Gladden Fields, and were fishermen.\n\nOne of the most infamous Stoors was Smeagol, who would later become a\ncreature known as the Gollum.\n\n\nCharacteristics\n\nThey were heavier and broader in build than the other Hobbits, and had\nlarge hands and feet. Among the Hobbits, the Stoors most resembled Men\nand were most friendly to them. Stoors were the only Hobbits who\nnormally grew facial hair.\n\nA habit which set them apart from the Harfoots who lived in the mountain\nfoothills, and the Fallohides who lived in forests far to the north, was\nthat Stoors preferred flat lands and riversides. Only Stoors used boats,\nfished, and could swim. They also wore boots in muddy weather.\n\nStoorish characteristics and appearances remained amongst the Hobbits of\nthe Eastfarthing, Buckland (such as the Brandybucks) and the\nBree-hobbits\n\nThe Stoors also had their own dialect of Hobbitish, owing to the fact\nthat they spent some time in Dunland and adopted many strange words and\nnames which they took to the Shire, and retained even until the late\nThird Age.\n\n\nHistory\n\nThe Stoors are believed to live in the southern vales of Anduin. During\nthe Hobbit Wandering Days, after the Harfoots had migrated westward in\nThird Age 1050, and the Fallohides followed them about a century later,\nthe Stoors long remained back in the vale of Anduin, but between T.A.\n1150 and 1300 they, too migrated west.\n\nUnlike the other Hobbit-kinds they took the Redhorn Pass and followed a\nsouthern route, where many Stoors branched off and moved south to the\nAngle of Eriador, south of Rivendell and mingled with the Harfoots and\nFallohides that lived there; but most went to Dunland (Swanfleet near\nTharbad) which most resembled their old lands. There they came into\ncontact with the Dunlendings. This contact altered their speech\nslightly, mostly by picking up a few Dunlending words.\n\nA hundred years later Angmar began to threaten Eriador and many Stoors\nof the Angle fled south to their kin in Dunland where they became a\nwoodland people; others returned to Rhovanion and settled the Gladden\nFields, becoming riverland people Déagol and Sméagol belonged to (c.\nT.A. 2430). There they had a matriarchal society. What became of\nthose Stoors and whether they rejoined their folk in Eriador, no history\ntells.\n\nThe Stoors of Dunland moved back north to join the other Hobbits in\ncolonizing the Shire about T.A. 1630 and settled mostly in the\nEastfarthing and Southfarthing. The result was that places that were\nsettled by Stoors have some slight linguistic oddities due to their time\nof separation and contact with the Dunlendings. The three original\nHobbit-kinds merged and blended in the centuries since the settlement of\nthe Shire, but regional variations remained.\n\nSome of these villages might have survived until the War of the Ring,\nwhen they were sought out by the Ringwraiths.\n\nHowever, most Stoors fled to the north and west, ending up in the newly\nfounded Shire around 1630. There they mingled with the Harfoots and\nFallohides, becoming the Shire-folk however they predominantly stayed in\nEastfarthing and then migrated to Buckland.\n\n\nEtymology\n\nStoor is supposed to be a special Hobbitish word that did not exist in\nWestron during the War of the Ring.\n\nEarly English stor, stoor means “large, strong”, referring to the fact\nthat these Hobbits were of heavier build",
    "origins": "A group of Hobbits",
    "locations": "Vales of Anduin, Gladden Fields, Dunland, The Shire",
    "languages": "numerous; eventually Hobbitish",
    "members": "Gollum, Déagol",
    "lifespan": "c. 96 years",
    "distinctions": "Heavier and broader than the other Hobbits; large hands and feet; only\nHobbits who normally grew facial hair; used boats, fished, and could\nswim"
  },
  {
    "title": "Longbeards",
    "page_id": "3038",
    "text": "Durin's Folk (Longbeards of the 2nd and 3rd age, one of the seven\n    houses of the Dwarves)\n\n&nbsp;\n-   Indravangs (Indrafangs) (Long Beards of Belegost during the 1st Age,\n    sometimes associated with the Wicked dwarves and Nauglath)",
    "other names": "Longbeards",
    "origins": "Descendants of Durin the Deathless",
    "affiliation": "Last Alliance of Elves and Men",
    "rivalries": "Elves",
    "languages": "Khuzdul, Westron, Sindarin",
    "lifespan": "c. 250 years",
    "members": "DURIN, Thorin, Balin, Dáin Ironfoot, Gimli",
    "distinctions": "Oldest of the Dwarven clans",
    "locations": "Mount Gundabad, Khazad-dûm, Erebor, Grey Mountains, Iron Hills, Blue\nMountains, Thorin's Halls, Glittering Caves"
  },
  {
    "title": "Falmari",
    "page_id": "3226",
    "text": "The FALMARI, also known as the SEA-ELVES, were those of the Teleri who\ndeparted from Middle-earth, migrating into the West where they remained.\n\n\nHistory\n\nOrigins\n\nDuring the Great Journey of the Elves of Cuiviénen, the Teleri had two\nlords: Elwë Singollo and his brother Olwë. While crossing Beleriand,\nhowever, Elwë became lost in the forests, and thus many of the Teleri\nrefused to continue into the West.\n\nWhen Ulmo came to them with an island, the Teleri had come to love the\nsea. The island was brought towards the Bay of Eldamar. They settled on\nTol Eressëa (the former island ferry) and later in Alqualondë, which\nthey built on the shores of Aman between the Calacirya and Araman.\n\n\n\nThe High King of the Falmari was Olwë, and the Princess of the Falmari\nwas Eärwen, Olwë's daughter.\n\nRebellion of the Ñoldor\n\nDuring rebellion of the Ñoldor led by Fëanor, the Sea-elves refused to\njoin the rebellion and to yield their swanships. This led to the\nKinslaying at Alqualondë.\n\n\nEtymology\n\nThe term _Falmari_ means “Wave-folk”, from the Quenya root _fala_\n(“foam”) and the word _falma_ (“wave as it breaks”).",
    "origins": "Teleri who reached Aman",
    "locations": "Alqualondë, Tol Eressëa",
    "languages": "Telerin",
    "members": "Olwë, Eärwen, Teleporno",
    "lifespan": "Immortal",
    "distinctions": "Singers, mariners",
    "hair color": "Dark, sometimes silver",
    "gallery": "IMAGES OF FALMARI"
  },
  {
    "title": "Men of Dale",
    "page_id": "3202",
    "text": "The MEN OF DALE were the inhabitants of the city state of Dale. They\ncame from the area around the Lonely Mountain.\n\n\n\n\nHistory\n\nThe Men of Dale were descendants of the Northmen who populated Rhovanion\nthroughout the many ages. Their capital was the city state of Dale and\nlater remnants fled to Laketown. The Men of Dale were allied with the\nDwarves in TA 2456 when Orcs from Mordor attacked.\n\nIn TA 2770, Smaug descended upon both Lonely Mountain and Dale probably\nfrom somewhere in Grey Mountains. He attacked and burned much of their\ntown. Over two-hundred years after the destruction of Dale in TA 2941,\none particular man named Bard the Bowman shot Smaug through a gap in his\nscaly armor with his Black Arrow with information from a Thrush that had\ncontact with Thorin and Company. Thereafter, the Men of Dale's symbol\nwas a Black Arrow so honoring the famous bowman. In TA 3019 during the\nWar of the Ring, they aided the Dwarves in defending the Lonely Mountain\nfrom the Easterling Empire.\n\nIn addition to many of them being competent in Westron, they also spoke\ntheir own language, generally termed “Dalish” and resembling the North\nGermanic languages.\n\n\nNames\n\nThe Men of Dale are named after their home city of DALE, which is\nderived from the English word meaning “valley”, in turn derived from\nProto-Germanic _*dalan_, with cognates in Old Norse (_dalr_), Gothic and\nDutch (_dal_), and German (_Thal_). Another common name for them\ntowards the end of the Third Age was BARDINGS, meaning “followers of\nBard”, _-ing_ being a patrynomic suffix and Bard meaning Bard the\nBowman, the first restored king of Dale and the slayer of Smaug.\n",
    "affiliation": "Dwarves of Erebor",
    "locations": "Dale, Esgaroth, Kingdom of Dale",
    "gallery": "IMAGES OF MEN OF DALE",
    "origins": "Northmen",
    "languages": "Westron, Dalish",
    "members": "Girion, Bardings (Bard, Brand)"
  },
  {
    "title": "Falathrim",
    "page_id": "3248",
    "text": "The FALATHRIM were the Elves living on coasts of the western Beleriand\nduring the First Age of the Sun in Middle-earth. They are called the\n'Coast People', 'Elves of the Falas' or 'Elves of the Havens'.\n\n\nHistory\n\nThe Falathrim were Sindarin Elves living in the Falas of Beleriand were\nrelated to the Teleri who were persuaded to stay in Middle-earth by\nOssë, but in the course of the Battles of the Beleriand their ranks were\nswelled by Sindar and Ñoldor fleeing the armies of Morgoth. They were\nthe first mariners and shipwrights of Middle-earth. Under their lord,\nCírdan, they prospered for many years, although the Falas was invaded by\nOrcs of Morgoth between the first and second battles of the Beleriand,\nand the Falathrim were forced to withdraw to their walled havens.\nThroughout the First Age, the Falathrim built all the ships sailed by\nMen or Elves of Beleriand. They sent a force to fight with the Union of\nMaedhros.\n\nWhen the Falas was overrun in FA 474 after the lost of the Nírnaeth\nArnoediad, the surviving Falathrim removed to the Isle of Balar, where\nthey continued to build ships and aid the Elves and Men of Arvernien.\nWhen the Beleriand was destroyed after the War of Wrath, the remnant of\ntheir people and culture survived into the Second Age and Third Ages\nsettling in Lindon and the Grey Havens.\n\n\nLord\n\n-   Círdan the Shipwright\n\n\nRealms\n\nFirst Age\n\n-   Falas- overrun in the First Age.\n    -   Haven of Eglarest\n    -   Haven of Brithombar\n-   Isle of Balar\n-   Havens of Sirion (in the land Arvernien) - destroyed by the Sons of\n    Fëanor\n\nSecond Age and Third Age\n\n-   Lindon\n    -   Forlindon\n    -   Harlindon\n    -   Grey Havens",
    "members": "Círdan, Voronwë",
    "lifespan": "Immortal",
    "locations": "Falas, Grey Havens",
    "languages": "Falathrin"
  },
  {
    "title": "Petty-Dwarves",
    "page_id": "3435",
    "text": "The PETTY-DWARVES (named in Sindarin NOEGYTH NIBIN or NIBIN-NOEG, part\nof an older and longer word BAR-EN-NIBIN-NOEG) were a diminutive race of\ndwarves that lived in the Beleriand in Middle-earth during the First\nAge. They differed from normal dwarves in various ways: they were\nsmaller, far more unsociable, and they freely gave away their names;\nother dwarves kept their Khuzdul names and language a secret.\n\n\nHistory\n\n The Petty-dwarves were dwarves of\nseveral houses, which had been exiled for reasons unknown in very\nancient times during the Peace of Arda. They were the first to cross the\nBlue Mountains (Ered Luin) in the First Age, and established strongholds\nin Beleriand before the building of Nogrod and Belegost in the Blue\nMountains, and before the elves arrived. They delved the very ancient\nsettlements of Nulukkizdin (Nargothrond) and Amon Rûdh but they dwindled\nbefore the Ñoldor returned to Middle-earth.\n\nThe Sindar, not yet acquainted with dwarves, thought the Petty-dwarves\nwere animals, and hunted them. Not until the dwarves of the Ered Luin\nestablished contact with the Sindar did the latter realize what the\nPetty-dwarves were. Afterwards they were mostly left alone, but not\nbefore the Petty-dwarves came to hate all elves with a passion.\n\nBy the time of the War of the Jewels, after the Return of the Ñoldor,\nthe Petty-dwarves had nearly died out. By the fifth Century of the First\nAge, the last remnant of their people were Mîm and his two sons, who\nlived at Amon Rûdh. Túrin and his men shot at the dwarves, mistaking\nthem for animals or orcs. Mim survived, but an arrow had killed one of\nhis sons, Khîm. Mim's other son had been killed by orcs, leaving Mim the\nlast of his kind. Mîm was killed by Húrin after the latter's release\nfrom Angband, and the Petty-dwarves were no more.\n\n\nOrigin in Tolkien's writings\n\nThe Petty-dwarves were created from remnant ideas based on the Nauglath\nin Tolkien's earliest writings in the _The Book of Lost Tales_. They\nwere more or less created to explain the difference between the dwarves\nlater writings such as The Hobbit in comparison to the wicked dwarves\nfrom his earlier stories which he hadn't yet completely abandoned.\nHowever, some of the ideas of the Nauglath were reincorporated into the\nNaugrim (Dwarves) by J.R.R. Tolkien or his son in the published\nSilmarillion and separate from the Petty-dwarves (such as the history of\nBelegost and Nogrod, and the Sack of Doriath events).\n\n''_'Niwennog_ '''was their first ascribed name (preceding the change to\n_Nibin-noeg_), as told of in the index of _The War of the Jewels._\n\nes:Bar-en-Nibin-noeg it:Nanerottoli pl:Bar-en-Nibin-noeg ru:Малые гномы",
    "other_names": "Petty-dwarves",
    "dominions": "Nulukkizdîn\nAmon Rûdh",
    "languages": "Khuzdul\nSindarin",
    "members": "Mîm\nIbun\nKhîm",
    "lifespan": "Shorter than other Dwarves",
    "distinctions": "Exiled Dwarves of several Houses; they were smaller, far more\nunsociable, and they freely gave away their names",
    "height": "Shorter than the other Dwarves"
  },
  {
    "title": "Olog-hai",
    "page_id": "4463",
    "text": "The OLOG-HAI were a more advanced breed of troll that appeared in the\nlast days of the War of the Ring in Sauron's service in Middle-earth.\n\n\nHistory\n\n\n\nThe Olog-hai are not mentioned by name in _The Lord of the Rings_; the\nterm appears only in the appendices. They were bred by Sauron in the\nlate Third Age, possibly for the same reason Saruman bred the Uruk-hai,\nfor improvement and less vulnerability to sunlight. They lived primarily\nin Mordor and in southern Mirkwood. However, they are described as being\nin the Battle of the Black Gate, where Pippin saves his friend Beregond\nfrom one. It is possible that some Olog-hai were also present at the\nBattle of the Pelennor Fields.\n\nThe Olog-hai are described as being taller than a Man, covered in spiky\nscales, carrying war hammers, large swords, or spiked maces, and\nbucklers, and having claws and, on occasion, tusks. It is mentioned that\nafter the War of the Ring, all Olog-hai were killed.\n\n\nEtymology\n\n_Olog-hai_ was a Black Speech word that meant simply 'troll-folk'. They\nseldom spoke and never in any language other than the Black Tongue of\nMordor. 'Olog' meant 'troll' in Black speech and 'hai' meant 'folk.\nUruk-hai meant 'orc-folk', and we can recognize the word 'hai' in both\nnames because they both have the same word in English (folk).\n\n\nBehavior\n\nOlog-hai lacked typical troll vulnerabilities: they were very\nintelligent and able to move under the Sun, unlike their other\ncounterparts. For this reason they were seen by some to be Orcs like the\nUruk-hai, but of troll-stock.\n",
    "name": "Olog-hai",
    "dominions": "Mordor, Dol Guldur (films only), Mount Gundabad (films only)",
    "languages": "Black Speech",
    "distinctions": "Tall, muscular, powerful, intelligent, destructive",
    "height": "Taller than a Man (books)\nAbout 10 - 15 feet or 3.5 - 5 meters tall (Lord of the Rings films)\nAbout 25 - 30 feet or 7 - 10 meters tall (The Hobbit films)",
    "skin_color": "Varying shades of grey and tan"
  },
  {
    "title": "Firebeards",
    "page_id": "6439",
    "text": "The FIREBEARDS were a tribe of Dwarves who came from the Blue Mountains.\nThey were paired in habitat with the Broadbeams,  but each tribe had\nits own mansion. Tolkien, however never specified if the Firebeards\nlived in Nogrod or Belegost.\n\nAfter the host of dwarves from Nogrod was defeated by the elves of\nOssiriand and the Ents led by Beren there is no more mention of Nogrod\nand Belegost in the Silmarillion but in Appendix A of Return of the King\nit is stated their people fled with the dwarves of Belegost to\nKhazad-dum and swelled its ranks. At the start of the War of the Dwarves\nand Orcs, the houses of the other Fathers of the Dwarves were called\nupon by Durin's Folk. Since they had been joined with Durin's folk after\nthe ruin of Beleriand and Thrain II Durin's Heir made his home in the\nremains of the ancient halls of the Firebeards in the Blue Mountains\nthey were among the first to heed the summons. When Gandalf goes to the\nhalls of Thorin Oakenshield they are in the ruins of Nogrod and\nBelegost.",
    "affiliation": "Broadbeams",
    "members": "Either Azaghâl or Telchar and Gamil Zirak",
    "languages": "Khuzdul, Sindarin",
    "locations": "Mount Dolmed, either Belegost or Nogrod or both, Khazad-dûm[1], Blue\nMountains"
  },
  {
    "title": "Broadbeams",
    "page_id": "6606",
    "text": "The BROADBEAMS were a tribe of Dwarves who came from the Blue Mountains.\nThey were paired with the Firebeards, but each tribe had its own\nmansion. Tolkien, however, never specified if the Broadbeams lived in\nNogrod or Belegost. At the start of the War of the Dwarves and Orcs, the\nhouses of the other Fathers of the Dwarves were called upon by Durin's\nFolk. It is probable that Broadbeams were one of the houses summoned.",
    "languages": "Khuzdul, Sindarin",
    "members": "Either Azaghâl or Telchar and Gamil Zirak",
    "affiliation": "Firebeards",
    "locations": "Mount Dolmed, either Belegost or Nogrod or both, Khazad-dûm[1], Blue\nMountains"
  },
  {
    "title": "Galadhrim",
    "page_id": "7556",
    "text": "The GALADHRIM, or\nthe TREE-PEOPLE, were elves of mixed descent (Sindar, Silvan, and\nÑoldor) living in the forest of Lórien that was ruled by Galadriel and\nCeleborn.\n\n\nHistory\n\nThe Galadhrim had gone undisturbed since the founding of Lórien in the\nSecond Age until TA 1980, when the Balrog in Khazad-Dûm was freed. Upon\nthis event, many of them fled south to Dol Amroth, while many other\nGaladhrim sailed over the sea. The Galadhrim that remained lived happily\nin Lórien until the end of the Third Age. With the departure of\nGaladriel to the Undying Lands, Lórien was deserted. The remaining\nGaladhrim went with Celeborn to East Lórien. \n\nTheir language was a dialect of Sindarin.\n\n_Galadhrim_ was also the name of the royal Lothlórien army.",
    "pronunciation": "_gal-ATH-rim_",
    "other names": "Elves of Lórien, Elves of Lórinand, Tree-people",
    "origins": "Silvan Elves of Lothlórien",
    "lifespan": "Immortal",
    "languages": "Silvan Elvish, Sindarin, Westron",
    "locations": "Lothlórien",
    "members": "Haldir, Rúmil, Orophin, Amdír, Amroth, Nimrodel, Mithrellas, Celeborn,\nGaladriel"
  },
  {
    "title": "Men of the West",
    "page_id": "8299",
    "text": "The term MEN OF THE WEST is a general term that refers to the Edain or\nAtani, the men who were friends with the Elves Lullaby in the First and\nSecond Age of Middle-earth.\n\n\nHistory\n\nIn the Third and Fourth Age, this term refers to several groups of Men,\nincluding men of Rohan and Gondor. Other Men included in this general\ndesignation include the men of Bree-land, the Men of Dale and may also\nbe applicable to Hobbits, as Hobbits are considered a race of Men.\nDuring the War of the Ring, this term was used to refer to the Edain who\nventured forth to challenge the armies of Mordor.\n\nMore specifically, MEN OF THE WEST may also refer to men who are\ndescended from the survivors of Númenor. But overall, any person who is\ndescended from the houses of Haleth, Bëor or Hador may claim this title.\n\nAssorted lands of the Edain\n\n-   Gondor\n-   Arnor\n-   Rohan\n-   Dale\n-   Lake-town\n-   The Shire\n-   Drúadan Forest\n-   Bree-land\n-   Dunland",
    "origins": "Descendants of the Númenóreans",
    "locations": "Eriador, Arnor, Gondor",
    "rivalries": "Sauron",
    "average height": "Taller than other Men",
    "languages": "Quenya, Westron, Sindarin, Gondor Sindarin",
    "lifespan": "Three times the life of a regular man but later diminished (not so much\nin Arnor however)[1]",
    "gallery": "IMAGES OF DÚNEDAIN",
    "hair color": "Dark",
    "distinctions": "Superior to the other men of Middle-earth in nobility of spirit and body",
    "members": "Amandil, Tar-Palantir, Argeleb I, Aragorn II"
  },
  {
    "title": "Gondolindrim",
    "page_id": "10573",
    "text": "The GONDOLINDRIM, sometimes called the HIDDEN PEOPLE, were the Elves of\nGondolin, the people of Turgon.\n\nThey were made up of both Noldorin exiles from Valinor and Sindarin\nElves. They were strong in mind, body, and spirit and became highly\nskilled in the arts and crafts and were well cultured.\n\n\nHistory\n\nFor nearly five hundred years, they lived in peace and prosperity\ntrusting in the secrecy of their hidden city and refusing to take part\nin the affairs and Battles of the Beleriand, save for the Nirnaeth\nArnoediad where fortunately for them, the secret of Gondolin was\npreserved thanks to the bravery of the Men of Dor-lómin. However, their\nsecret would not remain a secret for long as others such as Húrin were\nused in finding its location, and then later from a threat from\nwithin.\n\nIt was Maeglin, son of Eöl who bitterly resented the fact that he could\nnot win the affection of the woman he desired and jealous of the one\nwho did, betrayed the people of Gondolin after being captured by\nMorgoth. This led to the Fall of Gondolin and the near destruction of\nits people; however, a group of them were saved by Tuor and Idril and\nthe bravery of Glorfindel.\n\nThe remaining Gondolindrim fled to the Havens of Sirion where they\nmourned greatly for the loss of their great city. There they lived in\npeace under the lordship of Tuor and Idril and later their son Eärendil\nuntil the deadly attack on the refuge by the Sons of Fëanor who were\nseeking the recovery of the Silmaril. Most all the Gondolindrim were\nslain and if any did survive they probably went over the Great Sea to\nthe Undying Lands.\n\n\nEtymology\n\n_GONDOLINDRIM_ was a Sindarin word that meant “Gondolin-people”.",
    "origins": "Descendants of Noldor",
    "locations": "Gondolin",
    "languages": "Quenya, Sindarin",
    "pronunciation": "_gon-do-LIN-drim_",
    "members": "Turgon, Idril, Tuor, Maeglin, Ecthelion, Glorfindel",
    "lifespan": "Immortal",
    "gallery": "IMAGES OF GONDOLINDRIM"
  },
  {
    "title": "Stonefoots",
    "page_id": "11440",
    "text": "The STONEFOOTS were one of Houses of the seven Fathers of the Dwarves\nthat dwelt in the mountains of the East. They were originally paired\nwith the Blacklocks.\n\nIt is possible that the Stonefoots were among the “Houses of other\nFathers” who sent troops to help Durin's folk in the War of the Dwarves\nand Orcs.",
    "other_names": "Stonefoots",
    "dominions": "Mountains of the East",
    "languages": "Khuzdul"
  },
  {
    "title": "Blacklocks",
    "page_id": "11439",
    "text": "The BLACKLOCKS were a relatively unmentioned clan of dwarves in\nTolkien's writings. They presumably had black hair (hence their name)\nand might have had relations with other Dwarven clans. They most likely\noriginated in the southern part of the Orocarni, being the only far\neastern mountain range. The Blacklocks were among the “_Houses of other\nFathers_” who sent troops to help Durin's Folk in the War of the Dwarves\nand Orcs.",
    "other_names": "Blacklocks",
    "dominions": "Mountains of the East",
    "languages": "Khuzdul"
  },
  {
    "title": "Ironfists",
    "page_id": "11438",
    "text": "The IRONFISTS were one of the Houses of the seven Fathers of the Dwarves\nin Middle-earth. Presumably, as they do not appear in any of the tales,\nthey lived far to the east in the northern range of the\nOrocarni mountains where they were paired with the Stiffbeards. The\nIronfists sent troops to fight in the War of the Dwarves and Orcs during\nthe Third Age. For it is said that Durin's Folk called for aid from\nhouses of other fathers of the Dwarves.",
    "other_names": "Ironfists",
    "dominions": "Mountains of the East",
    "languages": "Khuzdul"
  },
  {
    "title": "Stiffbeards",
    "page_id": "12340",
    "text": "The STIFFBEARDS were among the Houses of the seven Fathers of the\nDwarves in Middle-earth that dwelt in the mountains of the East, near\nOrocarni. They were originally paired with the Ironfists. It is\npossible that the Stiffbeards were among the “_Houses of other Fathers_”\nwho sent troops to help Durin's Folk in the War of the Dwarves and Orcs.",
    "other_names": "Stiffbeards",
    "dominions": "Mountains of the East",
    "languages": "Khuzdul"
  },
  {
    "title": "Gundabad Orcs",
    "page_id": "15910",
    "text": "The_' Gundabad Orcs _' were the Orcs inhabiting Mount Gundabad. They had\nattacked the mountain and took it from the Dwarves of Durin dwelling\nthere. They were the servants of the Witch-king of Angmar before they\nhad seized Gundabad.\n\n\nHistory\n\nSome time during the Second Age, the orcs that had survived the\ndestruction of Angband were forced to wander the Northern Waste and find\na new home. This was when they attacked the mountain and took it from\nthe Dwarves. In the Third Age, the Orcs of Angmar officially stated\nGundabad as their capital, which angered the Dwarves greatly. \nGundabad remained an Orc stronghold, until it was cleared of orcs in TA\n2799, after the War of the Dwarves and Orcs. However, small groups of\norcs must have returned and fortified it anew during the events of _The\nHobbit_, menacing Wilderland once again. It was from here that the\nGoblins present at the Battle of Five Armies came from in their marching\nnumbers. Their leader, Bolg, son of Azog, was the supreme commander of\nthe orcs from Mount Gundabad and presumably the northern Misty\nMountains, and was killed by Beorn, the skin-changer. It is unknown what\nbecame of the orcs after that or who their leader was, but they\neventually became a threat again. In battle, they were armed with orcish\nscitimars, spears and axes.\n",
    "name": "Gundabad Orcs",
    "dominions": "Misty Mountains, Mount Gundabad",
    "languages": "Orkish, Westron",
    "height": "Between 4-5'",
    "skin_color": "Swarthy"
  },
  {
    "title": "Black Uruks",
    "page_id": "19161",
    "text": "The BLACK URUKS or “MORDOR URUK-HAI” were an elite breed of Orc that\nmade up part of Sauron's vast, ground-bred army, and thus _Black Uruk_\nis the term used to refer to any Uruk of Mordor.\n\n\nHistory\n\nBlack Uruks were the first Orc-kind of Middle-earth to be named _uruk_,\nfor they originated before the Great Years, and first appeared in\nassaults upon Ithilien that took place in the year 2475 of the Third\nAge. (It was almost a millennium later that Saruman in Isengard bred the\nmore familiar _Uruk-hai_.)\n\n\n\n\nNotable Uruks of Mordor\n\n-   Shagrat, Captain of the tower of Cirith Ungol\n-   Gorbag, Captain of the tower of Cirith Ungol\n",
    "name": "Black Uruks",
    "dominions": "Mordor",
    "languages": "Native dialects, Black Speech, Westron",
    "notable_members": "Shagrat",
    "distinctions": "Uruk-hai",
    "skin_color": "Dark"
  },
  {
    "title": "Moria Orcs",
    "page_id": "27877",
    "text": "“MORIA ORCS” refers to the orcs who in TA 2480  came to inhabit the\nDwarven realm of Khazad-dum, at the time Sauron populated “Moria with\nhis creatures”, long after the Dwarves had fled there in 1981.\n\nThree centuries later, Azog was their leader. When Thror came to reclaim\nMoria with Nar, Azog slew Thror, and this initiated The War of Dwarves\nand Orcs. The Dwarves hunted down Azog until he was killed by Dain II\nIronfoot at the Battle of Azanulbizar. (After Azog's death, his son Bolg\nwould lead an army of Orcs to Erebor, where they lost terribly, and Bolg\nwas killed.)\n\nWhen the Dwarves, led by Balin, returned to Moria in TA 2989, they came\nupon bands of orcs who eventually invaded and overtook Khazad-dum, and\nBalin was slain. These orcs were not large in number or well-armed,\nbut sufficient to keep out any enemies.\n\nThe Fellowship of the Ring came upon a large group of Moria Orcs, led by\nan unknown large orc chieftain, who ambushed them in Balin's Tomb. After\nthe Fellowship left the chamber they came upon other orcs and\nCave-trolls who attempted to kill them as they neared the Bridge of\nKhazad-dûm. The Moria Orcs stopped due to the arrival of Durin's Bane,\nthe ancient Balrog of the old kingdom. After the Balrog's defeat, Moria\nOrcs continued their hunt for the Fellowship to Lothlórien where they\nwere killed by the Elves living there.\n\nWhile most Moria Orcs served Sauron, some of them fell under the\ninfluence of the wizard Saruman or acted on their own behalf. Several of\nthe Moria Orcs in the service of Saruman along fellow Mordor Orcs and\nUruk-hai were sent by the old Istari to capture Frodo Baggins and get\nthe One Ring. The orcs however took Meriadoc Brandybuck and Peregrin\nTook in place of Baggins and began their journey back to Isengard. At\nsome point during this journey, the orcs of the Black Pit grew hungry\nand began arguing with Uglúk about eating the two hobbits. Uglúk had to\nprevent any riot so he killed several of the traitorous orcs and warned\nthe others. The surviving Moria Orcs were killed either on the road by\nthe Riders of Rohan or at night near Fangorn Forest by Eomer's Rohirrim\ngroup.\n\nAfter the destruction of Isengard, these orcs were driven out of Moria\nand the Dwarves reclaimed it.\n",
    "name": "Moria Orcs, Moria Goblins",
    "dominions": "Moria, Misty Mountains",
    "languages": "Black speech",
    "height": "Between 3-5",
    "skin_color": "Swarthy, black"
  },
  {
    "title": "Lesser Dúnedain",
    "page_id": "41849",
    "text": "LESSER DÚNEDAIN, also known as the Southern Dunedain, were the Dunedain\nwho intermarried with “Middle Men”.\n\n\nHistory\n\nThe DÚNEDAIN OF THE SOUTH were the Sindarin speaking descendants of the\noriginal Númenórean settlers who had founded the Kingdom of\nGondor.Though the lower urban classed quickly intermixed with the rural\nindigenous population and were considered Gondorian commoners or Tarkils\nthe high nobility and royal house long preserved a relatively pure\nnúmenórean lineage They were also known as “lesser Dúnedain”. Most\nGondorians and Arnorians would be considered Tergil. They settled mainly\nin Arnor and Gondor, but during the Third Age only in the Gondor-region.\nThese were the TERGIL (Sgl.“Targil” Q.“Tarkil”) or TORFIRIATH were the\ndescendants of Dúnedain\n\n\nDescription and Historical accounts\n\nBeing mostly of Númenórean stock and ruled by exiled Númenórean\noverlords, the people continued most of the customs and traditions of\nNúmenór. However, over the centuries, they mixed more and more with the\nmen of Middle-earth. One of these peoples was the Northmen who lived in\nRhovanion, and Gondor, ever needing allies as well as friends, began\nacquainting themselves with these men by the mid Third Age. Brave and\nvaliant but by the standards of the Dúnedain shorter-lived, the Northmen\ngradually had more and more to do with Gondor, and one of its heirs to\nthe throne Valacar, who lived and worked with them in their own land as\nan ambassador, married one of their noble ladies setting the stages for\nthe Kin-strife.",
    "name": "Lesser Dúnedain",
    "dominions": "Colonies of Númenor (early); Gondor and Arnor (later)",
    "languages": "Westron, Sindarin",
    "notable_members": "Men of Gondor",
    "lifespan": "Normal human lifespan",
    "distinctions": "Mortality",
    "skin_color": "Fair, brown, dark",
    "hair_color": "Black, brown, blonde, grey, or white (in later years)"
  },
  {
    "title": "Men of Númenor",
    "page_id": "42597",
    "text": "NÚMENÓREANS were the Men of Númenor, descendants of the Edain of the\nFirst Age, who were granted the island of Elenna as a dwelling place.\nThey turned against the Valar, and their island home was destroyed in\nthe last years of the Second Age.\n\n\nHistory\n\nThe NÚMENÓREANS (Ad._Adûnai_) were the men of Númenór, those descendants\nof the three houses of the Edain who had settled the Island Realm of\nNúmenór in the second Age.Those Númenóreans of the Elendili who settled\nthe coasts of the Westlands and founded the kingdoms of Arnor and Gondor\nwere also known as the Dúnedain and they continued to speak Sindarin as\ntheir formal speech of etiquette although they used Adûnaic as their\nlingua franca, and later its descendant Westron.The King's Men or\nAruwanai who settled the coastlands south of Umbar were called Black\nNúmenóreans by their northern brethren\n\n\nAppearance\n\nThe Adûnai regarded the pale skin of the Eldar as prestigious, however\nmany among the hard working rural population and the sun-tanned mariners\nhad ruddy or darker skin, so pale skin became the ideal of the upper\nclasses. In later times it was was seen as a symbol of pure-blooded\nnúmenórean descend, as the former free working classes rose to the\nstatus of urban citizens and the lower classes were replaced by unfree\nslaves imported from all over Middle-Earth and a mixed-blooded class of\nunfree and semi-unfree freedmen evolved. The original Adûnai were a tall\nfolk, 6 feet, 4 inches being not uncommon among them, although their\nlater descendants used to be smaller in statue. Most common Adûnai were\nblack or brown haired, being largely descendants of the Beorians and\nHalethrim, but in the royal line there also were some flaxen or\ngolden-haired families, offspring of the house of Hador. Adûnai were\nusually grey-eyed, though brown or blue eyes were not uncommon.\n\n\nReligion\n\nThe Adûnai revered the One-god Êru and his subject-spirits the Avalôi or\nÊru-bêni, especially Gimilnitîr or Avradî and Amân or Adûnakhôr, but\nalso Abâr, Agân, Azâr and Magân.Later under Zigurûn's tutelage they\nlargely abolished the reverence of Êru and made the cult of Alkar or\nMulkhêr their imperial religion, the few remaining faithful or Elendili\nmostly left Númenór for the colonies of the northwest.\n\n\nCulture\n\nThe Adûnai were the greatest Seamen and Scholars among the mortals and\ncertainly also the most skilled artificians and warriors.However with\nthe drowning of Númenór much of the Adûnai's knowledge was lost forever\nand their Dúnadan and Aruwanai descendants only inherited a shadow of\ntheir forefathers' former glory.\n\n\nLifespan\n\nWhile the early half-elven royal line of the númenórean Kings lived up\nto 400 years and even the lesser Númenoreans often lived up to 200\nyears, their Elendili and Aruwanai descendants of the late third age\nonly came to live for no longer than 100 years, 150 years being a sign\nof royal descent, with the notable exception of Elessar I who died at\nthe age of 210.",
    "dominions": "Númenór(early) Eriador, Harad, Umbar, Pelargir, later Arnor and Gondor",
    "languages": "Adûnaic, Western and Sindarin",
    "notable_members": "Elros, Aldarion, Ar-Pharazôn, Elendil, Isildur",
    "lifespan": "150-180 years of average except Kings of the Dúnadan live longer",
    "distinctions": "Mortality",
    "height": "Nine and seven feet tall",
    "skin_color": "Fair, brown, dark",
    "hair_color": "Black, brown, blonde, grey or white (in later years)"
  },
  {
    "title": "Men of Arnor",
    "page_id": "42611",
    "text": "MEN OF ARNOR, or ARNORNIANS, describes the Men of Arnor. They were the\npeoples of the Kingdom of Arnor.  They were descended from the\nNúmenórean colonists who settled there throughout most of the Second Age\nand their noble kin who escaped the destruction of Númenór in SA 3319.\nBeing mostly of Númenórean stock and ruled by exiled Númenórean\noverlords, the people continued most of the customs and traditions of\nNúmenór.\n\n\nHistory\n\nBefore the foundation of Arnor there was already a sizable Númenórean\npopulation living in Eriador, a result of the slow emigration of\nNúmenóreans which had started under Tar-Meneldur and Tar-Aldarion. The\nregion was home to Middle Men of Edainstock, and the early colonists\nsoon interbred with the indigenous population.\n\nThe people of Arnor, the North-kingdom founded by Elendilin Middle-earth\nafter the Downfall of Númenor. Elendil was its first King, and was held\nas High King over both the North- and South-kingdoms (hence the name\n_Arnor_, which means 'Land of the King').\n\nThe Men of Arnor were severely depleted by the War of the Last Alliance,\nin which many of them fell. Nonetheless, the land of Arnor survived for\nnearly a thousand years under ten different Kings. The eldest son,\nAmlaith, claimed Kingship over all Arnor but was reduced to only ruling\nthe region of Arthedainas his kingdom, while the other sons founded the\nkingdoms of Cardolanand Rhudaur. The largest part of the populace were\nEriadorian Commoners, who were ruled by an upper class of Northern\nDúnedain, though there was a broad mixed-blooded middle-class,\nespecially in the urban centers and the lesser Nobility or Gentry.\n\nTheir realms were lost during the Third Age, and for the millennium\nbefore the War of the Ring, they were a wandering people. Their leader,\nwho took the title 'Chieftain', was the descendant of the ancient King,\nIsildur.\n\nAfter the War of the Ring, Aragornwas crowned the King of Gondor, and he\nwas also crowned as the King of Arnor, and thus, he became the first\nHigh King of the Reunited Kingdom of Arnor and Gondor.\n\n\nGalleries\n\nUntitled2.png\n\nUntitled3.png Untitled4.png Untitled5.png Untitled6.png Untitled7.png\nHalbarad.jpg\n\nElendil11.jpg|Elendil the Tall Arador card.jpg Arathorn\nlo-rez.jpg|Arathorn in _Born of Hope_ King Aragorn.PNG|Aragone, the\nfirst High King of the Reunited Kingdom Eldarion.jpg",
    "name": "High Men\n\nDúnadan( Faithful Númenóreans)",
    "dominions": "Arnor",
    "languages": "Westron, Sindarin, Adûnaic",
    "notable_members": "Elgarain, King Aragorn II Elessar",
    "lifespan": "150-180 years of average except Kings of the Dúnadan live longer",
    "distinctions": "Mortality",
    "skin_color": "Fair, brown, dark"
  },
  {
    "title": "Mordor Orcs",
    "page_id": "45713",
    "text": "MORDOR ORCS were the Orcs bred by the Dark Lord Sauron in the Land of\nthe Shadow. They formed Sauron's main host during the Second Age and\nThird Age.\n\nDuring the War of the Ring, Sauron and his ally Saruman sent a band of\nUruk-hai, Mordor Orcs and Moria Orcs. The Mordor Orcs were led by\nGrishnákh, an orc captain tasked with taking the hobbits back to Mordor.\nThe orcs managed to kill the Gondorian warrior Boromir and to capture\nMerry and Pippin who they had mistaken for Frodo and Sam. However, as\nthey left Amon Hen the orcs began to quarrel over where to take the two\nhobbits. The Mordor Orcs had received orders to take them to their\nmaster Sauron while the Uruk-hai wanted to take them to Saruman in\nIsengard. Since the orcs of Isengard were more numerous than the ones\nfrom Mordor, Grishnákh's band was forced to follow the Uruks. The orc\ncaptain secretly planned his next move and left the group to call\nreinforcements. At night near Fangorn Forest, the orcs were all killed\nby the Riders of Rohan.\n\nOther orcs were led by the Witch-king against the forces of Gondor at\nthe battle near Pelennor Fields. The rest of the Mordor Orcs perished at\nthe Battle of the Black Gate or during the destruction of the Dark\nTower.\n",
    "name": "Mordor Orcs",
    "dominions": "Mordor",
    "languages": "Black Speech, Orkish, Westron",
    "notable_members": "Grishnakh, Snaga (Grishnákh's band), Snaga, Radbug",
    "lifespan": "Unknown"
  },
  {
    "title": "Dwarves of the Iron Hills",
    "page_id": "45926",
    "text": "The DWARVES OF THE IRON HILLS were Dwarves belonging to the house of the\nLongbeards, otherwise known as Durin's Folk, who lived in the Iron\nHills.\n\n\nHistory\n\nEarly history\n\nThe Longbeard Dwarves of Khazad-dûm colonized the Iron Hills in the\nFirst Age. The Hills were their primary source of iron-ore. The\nDwarf-road of Mirkwood ran north-east from Khazad-dûm to the Hills for\nuse by dwarf-traders and merchants.\n\nAfter Sauron destroyed Eregion in the Second Age, the Longbeards sealed\nKhazad-dûm and Orcs took control of the northern Misty Mountains and the\nGrey Mountains. This ended communication between the Iron Hills and\nKhazad-dûm for some time.\n\nThird Age\n\nFounding of Grór's Realm\n\nIn the Third Age, many Longboard Dwarves lived in the Grey Mountains,\nbut they were greatly troubled by Dragons in that region. After King\nDáin I was slain by one of these dragons, his surviving sons led an\nexodus into the east. Dáin's elder son Thrór recreated the Kingdom under\nthe Mountain at Erebor, while his younger brother Grór led a part of the\npeople further into the east to join their kindred living in the Iron\nHills.\n\nGrór settled in the Iron Hills in the year TA 2590 and became Lord of\nthe Iron Hills. During his reign, the realm became the strongest in the\nNorth, being the only realm standing between Sauron and his plans to\ndestroy Rivendell and taking back the lands of Angmar. Also, following\nthe Sack of Erebor many of Durin's folk fleeing from Smaug and those\nwandering in exile, except for Thrór and his small company of family and\nfollowers, came to the Iron Hills, bolstering their numbers.\n\nWar of the Dwarves and Orcs\n\nDuring the War of the Dwarves and Orcs, many Dwarves from the Iron Hills\nfought several battles, but they are mostly remembered from the Battle\nof Azanulbizar in the year TA 2799. Naín and his army came to the battle\nin the most crucial moment when the main Dwarven army was being\ndecimated by the great host of Orcs. With these fresh reinforcements,\nthe Dwarves were able to route and destroy their opponents, fighting\ntheir way all up to the steps of the East-gate of Moria. There, Nain\ndueled with Azog, the Orc commander, resulting in his death. Later in\nthe battle, Dáin II Ironfoot killed Azog out of vengeance for his\nfather, achieving recognition because he was very young by dwarven\nstandards. After this battle, Dain led his Dwarves back to Grór's Halls.\n\nDáin's Reign\n\nGrór ruled the Dwarves of the Iron Hills for 215 years, and he died in\nTA 2805 at 241 years of age. Dáin Ironfoot became the next Lord of the\nIron Hills. During his reign, the Iron Hills evolved to the mightiest\nDwarf-realm of its time.\n\nYears later, Dáin's cousin Thorin attempted to restore the kingdom at\nErebor, but he was trapped by the Elves of Mirkwood and Northmen of\nEsgaroth and sent to the Iron Hills for aid. Dáin arrived with over 500\narmored Dwarves and as events developed, the Dwarves of the Iron Hills\nproved crucial in winning the ensuing Battle of Five Armies against the\nOrcs of the Misty Mountains. Thorin died in that battle, and with him\nthe royal line of Thrór. Through his ancestor Grór, the Kingship of\nDurin's Folk then fell on Dáin. Dáin II Ironfoot removed from the Iron\nHills and re-established a kingdom under the Lonely Mountain. It is\npossible that both Iron Hills and Erebor were ruled by him and later by\nhis son Thorin III Stonehelm.\n\nThe Dwarves of the Iron Hills fought alongside the Dwarves of Erebor in\nthe Battle of Dale against the Easterlings during the War of the Ring.\n\n\nOther information\n\nThey became well-known for making a metal mesh that could be used for\nmaking flexible items like leg-coverings.\n\nThese Dwarves of Durin's folk were known for being some of the most\nfierce and elite of all Dwarf armies capable of matching Sauron's army\non equal footing. Their main weapon of choice seemed to have been the\nmattocks, though they also carried a short broad sword with a round\nshield.\n\nNot much is said on whom were enemies of these dwarves, but it seems\nlikely that the Easterlings were one of them since their empire was near\nand around the Iron Hills, and possibly the Dragons that lived nearby in\nthe northern wastes.",
    "other_names": "Dwarves of the Iron Hills",
    "dominions": "Iron Hills",
    "languages": "Khuzdul, Westron",
    "members": "Dáin II Ironfoot, Grór, Náin",
    "lifespan": "c. 250 years",
    "distinctions": "Among the fiercest warriors in Middle-earth",
    "height": "Five feet or less"
  },
  {
    "title": "Dwarves of Erebor",
    "page_id": "46057",
    "text": "The DWARVES OF EREBOR or DWARVES OF THE LONELY MOUNTAIN were those\nDwarves who who dwelt in the halls of Erebor, beneath the Lonely\nMountain.\n\n\nHistory\n\nKingdom\n\nThráin I established the Kingdom under the Mountain fleeing from Moria.\nDuring his time the Arkenstone was discovered, the most prized\npossession of the Kingdom. His son, Thorin I, later became King under\nthe Mountain but after seeing the wealth of the Dwarves of the Grey\nMountains, he abandoned Erebor.\n\nWhen the Cold-drakes invaded the Grey Mountains, they drove most of the\nDwarves out. Thrór, a descendant of Thorin I, took some of his people\nand flew the Grey Mountains for Erebor. His brother Grór continued east\nwith a great following of Durin's folk to the Iron Hills while himself\nrefounded the kingdom of Erebor in TA 2590.\n\nSecond Kingdom\n\nThe Dwarves gained the friendship of the Northmen along the Celduin and\nhad much trade of goods, beautiful trinkets, and weapons with the town\nof Dale. The Dwarves of Erebor also had much traffic of ores with their\nkinsmen in the Iron Hills and the region had peace and prosperity for\nmany years.\n\nThe Dwarves were properous, and made great wealth for themselves until\nthey were dispossessed of their immense wealth by Smaug the Dragon, who\nflew south from the Ered Mithrin and sacked their kingdom in TA 2770.\n\nThe Dwarves reclaimed their inheritance many years later under the\nleadership of Thorin II. But it was the descendants of Dáin II Ironfoot\nthat ruled there ever after.\n\nThird Kingdom\n\nAfter the restoration thanks to Thorin and Company, the Dwarves became\nagain rich and prosperous under Dáin's rule, as the Dwarves exceeded\ntheir ancestors in masonry and mining. Dale was rebuilt as a kingdom and\nthey had a close friendship with the Elves of Mirkwood.\n\nBalin and other Dwarves set out to reclaim Moria in TA 2989. Dáin did\nnot give his blessing when Balin, but could not dissuade them. It was\nonly later learned the colony was destroyed after five years.\n\nWar of the Ring\n\nIn TA 3018, a messenger came from Mordor, enquiring about “Baggins” from\n“Shire”, promising the last three Dwarf-rings to Dáin. The King asked\ntime to think and he sent Glóin and his son Gimli to Elrond for council,\nand to warn Bilbo.\n\nThe War of the Ring reached the North; King Brand fighting the\nEasterlings retreated from the River Carnen and was given aid by Dwarves\nin the Battle of Dale. After three days of fighting Dwarves and Men were\ndriven back, and Brand was slain, followed by Dáin. Several days\nlater the Easterlings learned that the War was lost. When the new King\nThorin III Stonehelm, son of Dáin, and Brand's Bard II saw this they\ncame out of the mountain and routed their enemies.\n\nLittle is known of the reign of Thorin III, other than the Dwarves\nhelped rebuild the cities of Minas Tirith and the fortress of Helm's\nDeep. Some of the Dwarves colonized the Glittering Caves.\n\n\nLanguage and writing\n\nThe Dwarves of Erebor spoke Khuzdul but used the Language of Dale for\ntheir public names.\n\nComing from Moria, the Dwarves brought with them the Angerthas Moria,\nwhich however was modified further. For some reason some runes of\nAngerthas Moria were reverted back to their Elvish values in Angerthas.\nThe resulting variation was known as Angerthas Erebor.\n\n\nMembers\n\nNoted Dwarves from Erebor were:\n\n-   THRÁIN I\n-   THORIN I\n-   THRÓR\n-   Thráin II\n-   Thorin\n-   Balin, Dwalin\n-   Dori, Nori, Ori\n-   Óin, Glóin\n-   Bifur, Bofur, Bombur\n-   Kíli and Fíli\n-   Gimli\n-   Dáin II Ironfoot\n-   Thorin III Stonehelm\n-   Floi, Loni, Nali, Frár\n-   Dís\n-   Frerin\n-   Fundin\n",
    "other_names": "Dwarves of Erebor",
    "dominions": "Lonely Mountain\nMoria\nGlittering Caves",
    "languages": "Khuzdul\nWestron",
    "members": "Gimli\nThorin II Oakenshield",
    "lifespan": "c. 250 - 350 years",
    "height": "Five feet or less"
  },
  {
    "title": "Dwarves of Nogrod",
    "page_id": "46046",
    "text": "The DWARVES OF NOGROD were the Dwarven House who dwelled at Nogrod in\nthe First Age.\n\n\nHistory\n\nDuring the Years of the Trees the western Fathers of the Dwarves awoke\nfrom beneath Mount Dolmed creating the lines of the Broadbeams and the\nFirebeards. These two houses built the great Dwarven cities of Nogrod\nand Belegost in the Blue Mountains. It is not clear whether they\nshared the two cities or whether each house dwelt in its own.\n\nThey were initially friendly to the Elves of Beleriand, renowned as\ncraftsmen and jewelers, such as Gamil Zirak whose works were to be found\nin the treasuries of King Thingol of Doriath, and Telchar known for\nthe forging of weapons. Dwarves from the Blue Mountains, perhaps also\nthose of Nogrod, aided the Noldor in the building of Nargothrond.\n\nDwarves of Nogrod, as well as their kinsmen of Belegost, participated in\nthe Union of Maedhros supplying them with soldiers and weapons.\n\nSome craftsmen from Nogrod stayed in Menegroth and were asked by King\nThingol of Doriath to set the Silmaril in the Nauglamir. But they\ncoveted the Nauglamir they made and killed Thingol in his treasury, and\nfled, only to be slaughtered by the avenging Elves who killed all but\ntwo. The survivors returned to Nogrod, and lied to their kinsmen saying\nthat Thingol refused to pay the craftsmen and for their work and killed\nthem.\n\nAlthough the Dwarves of Belegost refused to aid them, they formed a\ngreat host which passed over Sarn Athrad intimidating the Sindar who\nfled before them. In the sack the Menegroth they ravaged the Caves and\nThingol's treasures. But on their return home they were hunted down by\nBeren Erchamion and killed by his army of Green-elves and a group of\nEnts at the Battle of Sarn Athrad as they were crossing the river.\n\nNogrod was ruined due to the War of Wrath by the Valar which marked the\nend of the First Age. Most of the Dwarves of Nogrod would later go to\nKhazad-dûm.\n"
  },
  {
    "title": "Laiquendi",
    "page_id": "931",
    "text": "The LAIQUENDI (Quenya; IPA: ; singular LAIQUENDË; ) also known as the\nGREEN-ELVES were a group of Nandor under Denethor, son of Lenwë. These\nelves passed westward into the Beleriand over the Blue Mountains and\ncame to reside in Ossiriand, the _Land of Seven Rivers,_ and were quite\nsecretive there.\n\n\nCulture\n\nThe Laiquendi had vast knowledge of nature and preferred living in\nforests besides waterfalls and streams, probably living off of simple\nhunting and gathering. They made no weapons of steel, had only bows and\narrows - which they were experts at handling. They dressed in\nforest-like green attire during the spring and summer months, therefore\nbecoming known as the Green-elves. They were also fond of singing during\nthe daylight hours. Their culture remained unique and distinct for many\nhundreds of years as they were for the most part a simple, peaceful, and\nreclusive people.\n\n\nHistory\n\nThe Laiquendi can be traced to the Telerin Elves of the host of Olwë,\nwho coming upon the Great River Anduin and seeing the seemingly\nimpassable peaks of the Misty Mountains, forsook the westward journey\nand became a separated people. These Elves followed Lenwë down the banks\nof the Anduin and once again became separated. The fate of many of these\nelves is uncertain; what is certain though is that some wandered into\nEriador making contact with the Dwarves, probably learning from them\nabout the great Sindarin King Thingol ruling peaceful territories in the\nrich lands of the Beleriand, prompting them to cross the Blue Mountains.\nFollowing their King Denethor, they made permanent settlement in the\nOssiriand, which was after named Lindon, or _Land of the singers_ after\nthese elves. They quickly made friends with Thingol, who recognized them\nas long lost kin of old.\n\nMorgoth, returning to Middle-earth with the Silmarils before his\npursuers the Ñoldor, quickly occupied his strongholds of old in the far\nnorth and resumed his plans for conquest. He invaded the Beleriand.\nSeeking aid, Thingol called on the Laiquendi and Denethor answered\nleading an army against their enemy’s eastern host, but were driven off\nand surrounded at Amon Ereb before they could be rescued by Thingol's\narmy. Their simplistic weapons were little to no match for the servants\nand beasts of Morgoth, thus they suffered heavy losses and Denethor was\nslain. Afterwards they became a secretive people never again naming a\nlord or a king and played no further part in the Battles of the\nBeleriand again, until the latter days of Beren and Lúthien.\n\nWhen Menhad begun migrating west looking for new lands, the Laiquendi\nfeared them greatly and hid themselves away threatening to attack them\nif Finrod didn’t lead them away from the Ossiriand. They are not\nmentioned again in the First Age until the later days of Beren and\nLúthien who lived in their lands on Tol Galen between the river Adurant.\nThey had a great respect for them and their friendship with Beren led\nthem to take up arms for one last time when they helped him and his son\nambush the Dwarves who sacked Menegroth. After the destruction of the\nBeleriand, the surviving Laiquendi merged with the Elves of Lindon and\nthe peoples of the Elven realms of Lothlórien and Mirkwood over the next\nfew ages.\n\n\nEtymology\n\n_LAIQUENDI_ is a Quenyan word that meant “Green-elves”. The Sindarin\nform was LAEGRIM.",
    "other names": "_Laiquendi_",
    "origins": "Nandor who crossed into Beleriand",
    "locations": "Ossiriand, Lindon",
    "members": "Denethor",
    "lifespan": "Immortal"
  },
  {
    "title": "Variags",
    "page_id": "2482",
    "text": "The VARIAGS were Men from the land of Khand.\n\nLittle about the Variags is known about apart from the fact that they\nfought for Sauron in the War of the Ring. They first appeared in TA 1944\nin the Northeast of Middle-earth, fighting alongside the Easterling\ntribe known as the Wainriders. On March 14 - 15 (Third Age: 3019) the\nVariags fought in Sauron's army at the Battle of the Pelennor Fields.\n\nTolkien never described the Variags, and most information about them is\nspeculative. It has been speculated that they were axe-wielding\nberserkers, based on the real world Varangians.\n",
    "locations": "Khand",
    "affiliation": "Sauron",
    "rivalries": "Gondorians",
    "lifespan": "shorter than Númenórean",
    "average height": "shorter than Númenóreans",
    "gallery": "IMAGES OF VARIAGS"
  },
  {
    "title": "Woodmen",
    "page_id": "9990",
    "text": "WOODMEN,_' KNOWN ALSO THE WOODMEN OF MIRKWOOD,_' were a race of Men\ndistantly related to the Edain who, by the Third Age, inhabited the\nwestern portion of Mirkwood forest. Not much is known of the group\nother than their inhabitance, that they were excellent huntsmen, and\nthat they were probably led by a Chieftain.\n\n\nHistory\n\nDuring the early and mid parts of the First Age when men began spreading\nthroughout Middle-earth, these people dwelled in the vast forested\nplaces in Middle-earth, particularly in Brethil. Surviving the tumults\nand wars over the ages, the descendants of these men came to live in\nMirkwood along with a mysterious race of men called the Beornings.\n\nThe Woodmen and the Beornings probably had close ties since they lived\nnear to each other braving the many dangers of the forest. The Woodmen\nalso probably had an alliance with the Elves that inhabited Mirkwood.\n\nAfter the War of the Ring and the cleansing of Mirkwood, the Woodmen and\nthe Beornings were given a large portion of the forest between\nThranduil's kingdom, Lorien, and East Lórien to dwell in.",
    "origins": "Northmen",
    "locations": "Mirkwood",
    "lifespan": "shorter than Númenórean",
    "gallery": "IMAGES OF WOODMEN"
  },
  {
    "title": "Hill-men",
    "page_id": "10402",
    "text": "HILL-MEN were a race of men who lived in small tribes in various places\nin Middle-earth.\n\n\nHistory\n\nThe tribes of the Hill-men were located in the Misty Mountains, the\nEttenmoors, Northern Eriador, the Withered Heath, and Dunland. The\nDunlendings were a tribe of Hill-men that chose to live in the fields of\nDunland. Those of the Withered Heath, known as Mountain men, were all\nkilled when the Dragons came from Angband in the north. Most of the\nHill-men of Middle-earth were there before the Númenóreans came from\nover the sea.\n\nOthers were Númenórean outcasts or criminals who joined the hill-men and\nallied themselves with the Witch-king of Angmar. The Hill-men learned to\nhate the Númenóreans as they killed many Hill-men during their search\nfor lands to settle. They helped conquer and occupy all the kingdoms of\nthe former Arnor (Rhudaur, Cardolan and Arthedain). Most of the Hill-men\nwere wiped out by the allied forces at the Battle of Fornost that\nbrought down the evil realm of Angmar.\n\n\nWeapons and Equipment\n\nHill-men were lightly armed and mainly fought with spears or hunting\nbows, but chieftains were better equipped with mail, bigger shields and\nswords.\n\n\nTribes\n\n-   Mountain men\n-   Ettenmoorians\n-   Men of Dunharrow\n-   Dunlendings\n-   Men of Bree",
    "locations": "Rhudaur",
    "affiliation": "Witch-king",
    "rivalries": "Dúnedain of Arnor",
    "lifespan": "shorter than Númenórean",
    "gallery": "IMAGES OF HILL-MEN"
  },
  {
    "title": "The Fellowship of the Ring (group)",
    "page_id": "23",
    "text": "The FELLOWSHIP OF THE RING was formed as a brotherhood among members of\nthe various Free Peoples of Middle-earth. Its purpose was to take the\nOne Ring to Mordor that it might be cast into the fires of Mount Doom,\nthe mountain in which it was forged, so that it would be destroyed and\nultimately kill the Dark Lord Sauron.\n\nThe '''Fellowship '''was also known as the COMPANY OF THE RING, the NINE\nWALKERS, or more simply the COMPANY. Each of the members of the Company\nwere representatives of their respective races, with Legolas and Gimli\nbeing the only Elf and Dwarf chosen.\n\n\nHistory\n\nFormation\n\nFormed after the Council of Elrond, the Fellowship consisted of nine\nmembers: four Hobbits, two Men, one Elf, one Dwarf, and one Wizard. It\nis the only known organisation/group ever formed in the history of\nMiddle-earth, to hold members of each of these races within it (and with\nthe departure of the Elves and the Wizards from Middle-earth, there\nwould never be another like it), who largely lived and acted\nindependently of one another (or in the case of Elves and Dwarves, felt\nactive animosity toward each other). This number was chosen to match the\nnumber of Ring Wraiths, also known as Black Riders, the Nazgúl or the\nNine Riders. Merry and Pippin were never intended to be a part of the\nFellowship, with Elrond considering two Elf-lords from his own house. He\nwished to send the two younger hobbits back to the Shire as messengers\nto warn other Hobbits of the growing evil. However, the Halflings\npersevere: Merry is chosen and Gandalf convinces Elrond of the loyalty\nof Pippin.\n\n\n\nThe Fellowship of the Ring was formed by Elrond after the Council of\nElrond. The Fellowship, being led mainly by Gandalf, headed down the\npath to Mordor.\n\nAfter a long and difficult journey south from Rivendell, and a\nnear-catastrophic attempt to cross over the Misty Mountains, the\nFellowship descended into Moria. In the former Dwarf-kingdom, they found\nevidence that Orcs had slain Gimli's kinsman Balin and other Dwarves who\nhad returned there. They were soon confronted by the Balrog known as\n_Durin's Bane_, who had many Orc and Troll minions under his control.\nGandalf fell facing this menace, and the Company was forced to go on\nwithout him.\n\nOnce they escaped Moria, the Fellowship headed to the Elven forest of\nLothlórien where they spoke with the Elven Lord Celeborn and Galadriel,\nLady of Light. Galadriel supplied them each with special Elven Gifts\nfrom Lothlórien, boats and supplies so that they could travel down the\nriver Anduin. This route was quicker than an overland march, but the\ngroup was attacked by Orc archers and shadowed by Gollum, who had begun\nfollowing them in Moria.\n\nForced to portage their boats around the waterfall called Rauros, the\nFellowship soon ran into difficulties. Boromir finally succumbed to\ntemptation, and attempted to seize the Ring from Frodo. This led to\nFrodo using the Ring to escape and he and Sam leaving to spare the\nothers the lure of it. The repentant Boromir died trying to defend Merry\nand Pippin against a large force of Uruks from Isengard.\n\nThe Fellowship was dissolved on the banks of the Anduin that day. Frodo\nand Sam carried on towards Mordor; Boromir was given funerary rites and\nsent floating over the falls, and Aragorn, Legolas and Gimli departed on\ntheir way to save Merry and Pippin.\n\nBreaking of the Fellowship\n\nAfter Boromir died the Fellowship split into three paths. From there\nAragorn, Legolas and Gimli chased after the Uruk-hai who took Merry and\nPippin. Their plan was to take the hobbits to Saruman in Isengard. Along\nthe way the trio crossed through the Gap of Rohan and came across Éomer\nwho led the banished Riders of Rohan across the land. After questioning\nÉomer, they found out that the riders had already slain the Uruk-hai\nthey were meant to track, the night before in a bloody massacre. So upon\narriving to site of battle, Aragorn discovers that the hobbits fled deep\ninto Fangorn Forest.\n\nGandalf, though thought to be dead when he fell at the Bridge of Khazad\nDum in Moria, came back to Middle-earth, reincarnated as Gandalf the\nWhite. He encountered Aragorn, Legolas and Gimli in Fangorn, and they,\nmistaking Gandalf for Saruman, attempted to kill him. Gandalf assured\nthem that Merry and Pippin were safe (knowing they were in the hands of\nTreebeard). From there they rode out to Edoras, capital of Rohan. It was\nthere they saw King Theoden in ill-condition, poisoned by Saruman's\nservant Grima Wormtongue.\n\nFrodo and Sam continued their journey, getting closer to Mordor. Gollum\nhad tailed them. While attempting to take “the precious” in their sleep,\nFrodo and Sam awoke and captured him. Frodo realizing who he was decided\nGollum could be used as guide into Mordor.\n\nThe Second Fellowship\n\nIn the book, Aragorn continues to call the company he leads (Legolas and\nGimli, occasionally joined by Gandalf, Merry, and Pippin) the Fellowship\nof the Ring even after the original Fellowship breaks up following\nBoromir's death. The fellowship is reunited again after the War of The\nRing up until Rohan, where the fellowship ends.\n\n  Name      Age\n  --------- ----------------------\n  Frodo     50\n  Samwise   38\n  Merry     36\n  Pippin    28\n  Aragorn   87\n  Boromir   40\n  Legolas   2000+\n  Gimli     139\n  Gandalf   2000+ (Middle-Earth)\n\n  : AGES OF THE MEMBERS (TA 3018)\n\n\nMembers",
    "members": "Gandalf, Frodo, Sam, Aragorn, Legolas, Gimli, Pippin, Merry, and\nBoromir.",
    "purpose": "To take the One Ring to Mordor, where it is to be \"cast into the fiery\nchasm from whence it came,\" in order for it to be destroyed and Sauron's\npower to come to an end.",
    "formed": "25 October, T.A. 3018",
    "dissolved": "26 February, T.A. 3019"
  },
  {
    "title": "Knights of Dol Amroth",
    "page_id": "8390",
    "text": "The KNIGHTS OF DOL AMROTH or the SWAN KNIGHTS were a group\nof soldiers who served Prince Imrahil during the Third Age of Middle\nEarth. On March 9, 3019, Prince Imrahil led a company of Swan Knights to\nMinas Tirith to help defend the City. Prince Imrahil led the sortie that\nrode to the aid of Faramir and the rear-guard who were retreating from\nOsgiliath when the forces of Sauron overran the Pelennor Fields on March\n13. Notable actions of the Knights during this battle included rescuing\nFaramir from the Southrons, and riding to the aid of the Rohirrim,\nfighting long and hard until the arrival of Aragorn."
  },
  {
    "title": "Minas Morgul Cavalry",
    "page_id": "21651",
    "text": "THE'' MINAS MORGUL CAVALRY'' is a descriptive term (not used by Tolkien)\nto describe the mounted troops that rode out with the Witch-king of\nAngmar from Minas Morgul to lead Sauron's armies to war. Tolkien\nreferred only to “a great cavalry of horsemen.”\n\n\nHistory\n\nIn _The Lord of The Rings,_ “The Two Towers”, a great cavalry of\nhorsemen rode out from Minas Morgul with The Witch-King himself ahead of\nthem, while Frodo watched. It's unknown whether they were mounted orcs,\nmen, or both, or whether (if men) they were Easterlings, Southrons, or\nmen originally quartered at Minas Morgul itself.\n\nIn _The Lord of The Rings,_ “The Return of The King”, when Faramir led a\nretreat to Minas Tirith after the Battle of Osgiliath, “horsemen of the\nEnemy” (perhaps the horsemen from Minas Morgul) charged toward them,\nwith orcs following them. But Haradrim were also present, and among them\nwas a “mounted champion”, so the horsemen may have been a Southron\ncavalry, with possible Orc-horse riders, or there may have been more\nthan two groups of horsemen present: one from Minas Morgul, and another\nfrom Harad.\n\nIt may also be possible that who ever they were, that they were also\npresent during The Battle of the Pelennor Fields particularly among the\nlegions of Minas Morgul against the walls of Minas Tirith and that\nlikely they like the rest of the enemy were all but killed off by the\nforces of Gondor since Aragorn II Elessar arrived.\n"
  },
  {
    "title": "Éothéod",
    "page_id": "892",
    "text": "The Éothéod (“horse-people”; also “horse-land”) were a race of Northmen,\nand the ancestors of the Rohirrim.\n\n\nHistory\n\nDuring the Third Age, the Éothéod are first mentioned when they migrated\nunder their King Frumgar to the confined area between the rivers\nLangwell and Greylin, sources of the Great River Anduin, near where the\nGrey Mountains met the Misty Mountains. They went that way after the\nfall of Angmar, away from the ravages of the Easterlings and Orcs.\n\nSome time later their king Fram, son of Frumgar, slew the dragon Scatha.\nThe Éothéod capital was named _Framsburg_ in his honour. Fram's son Léod\nwas killed trying to tame the horse Felaróf, first of the Mearas of\nRohan. His son Eorl the Young tamed the horse, taking it into service as\ncompensation for his father's life.\n\nDuring the rule of the ruling Steward of Gondor Cirion, Gondor faced an\nattack by a new Easterling threat, the Balchoth, and Cirion sent\nmessengers to the Éothéod capital. King Eorl answered the call for help,\nand rode out with most of the Éothéod to help their allies of old,\nleaving only a few warriors behind to protect his people. The Riders\narrived just in time to help the army of Gondor at the Field of\nCelebrant, and after defeating the enemy Cirion asked the Éothéod to\nwatch over the depopulated province of Calenardhon.\n\nThree months later Cirion gave Calenardhon as a gift to Eorl and his\npeople, and Eorl swore his Oath of eternal friendship. Messengers were\nsent north, and the Éothéod completely removed to the plains of\nCalenardhon.\n\nThe Éothéod renamed themselves _Eorlingas_ or “followers of Eorl”, but\nin Sindarin they became known as the Rohirrim, or _Horse-lords_, and\ntheir country became known as Rohan, the Riddermark.\n\n\nEtymology\n\nThe name _ÉOTHÉOD_ is a translation into Anglo-Saxon of the original\nRohirric LOHTÛR, Rohirric “loho-” or “lô-” corresponding to the\nAnglo-Saxon “éo-”, meaning “horse”.",
    "origins": "Northmen",
    "locations": "near the Vales of Anduin; northern Anduin (Framsburg)",
    "members": "Marhwini, Forthwini, Frumgar, Fram",
    "rivalries": "Dwarves of the Grey Mountains"
  },
  {
    "title": "Thorin and Company",
    "page_id": "9906",
    "text": "THORIN AND COMPANY were a group of thirteen Dwarves, the Wizard Gandalf,\nand the Hobbit Bilbo Baggins, led by Thorin Oakenshield in TA 2941.\nTheir main purpose was to regain the lost Dwarven kingdom of the Lonely\nMountain from the Dragon Smaug.\n\n\nBackground\n\n\n\nThe formation of the group grew out of a meeting Gandalf had with Thorin\nin Bree which kindled Thorin's interest in recapturing his long lost\nfamily inheritance. Remembering that he had once known an adventurous\nHobbit on his travels in The Shire, Gandalf decided to add Bilbo to\ntheir company because he knew that stealth and cunning were preferable\nto force. Gandalf also believed that someone like Bilbo could keep the\nsometimes prideful and stubborn Dwarves from rash action. The\nsuperstitious Dwarves also considered thirteen to be an unlucky number,\nand as Gandalf had planned to leave on other business, welcomed a\nfourteenth to fill in to their party.\n\n\nHistory\n\n\n\nFormation of Thorin and Company\n\nOn the April 26, 2941, Gandalf and the Dwarves arrived at Bag End. After\nbig tea and supper with Bilbo, they explained themselves and their\nintentions. Bilbo was at first reluctant to join the group but Gandalf\nrushed him out of the door.\n\nTravels and Encounters\n\nAfter traveling for some time and crossing the river Hoarwell, the\ncompany were caught and nearly killed and eaten by three hungry trolls.\nGandalf returned in time to keep the monsters occupied until dawn, when\nthe light of the Sun turned them to stone. Recovering themselves, the\nDwarves found that these Trolls had a cave nearby filled with stolen\nweapons, food, and a small treasure. Amongst the many weapons were Sting\n(which Bilbo armed himself with, and which he named after a battle with\na giant spider), Orcrist (claimed by Thorin), and Glamdring (taken by\nGandalf). Strangely, all were ancient Elvish blades that had been forged\nseveral millennia earlier, in the First Age, in Gondolin.\n\n\n\nReaching Rivendell in June, the company held talks with Elrond and\nlearned about the secret Moon-letters on Thorin’s old map of the Lonely\nMountain. Elrond also read the runes on Orcrist and Glamdring, thus\nidentifying them. After spending a short time there, the group resumed\ntheir journey through the Misty Mountains.\n\nOn their way through the High Pass, the company (minus Gandalf) were\ncaptured by goblins. Taken before the Great Goblin, they were in mortal\ndanger. Gandalf suddenly appeared and killed the Great Goblin, creating\nenough disarray for them to escape. Unfortunately, Bilbo fell down a\nhole and was left behind during their hasty retreat. Wandering lost and\nalone in the depths of the mountain, he found the One Ring and met\nGollum, described in _The Hobbit_ as “a small slimy creature … as dark\nas darkness, except for two big round pale eyes in his thin face.”\n\nAfter a hazardous game of Riddles with the creature, Bilbo fortuitously\ndiscovered the ring he had found could make him invisible. Wearing the\nring, Bilbo escaped Gollum and a group of goblins guarding the eastern\ndoor out of the caverns, and soon reunited with his companions.\nCollecting themselves, the company made their way down the mountainside,\nwhere they were attacked by Wargs and forced to seek refuge in the\ntrees. Goblins soon arrived and tried to kill the company by getting\nthem down on the ground by tampering down the trees. With all hope\nnearly gone, the hapless company were rescued by a group of giant\nEagles.\n\nAfter thanking the Eagles, Thorin and Company made for Beorn's house\nwhere they managed to impress the wary shape-changer. Fully stocked and\nprepared the Company, they left Beorn's home and made for Mirkwood. When\nthey reached the edge of the perilous wood, Gandalf announced that he\nhad pressing business elsewhere and would not be coming with them\nthrough the forest. Grumbling, they went on ahead, taking the Forest\nPath into the darkness of Mirkwood. After a few days they reached a dark\nstream which Beorn had warned them not to drink or bathe in, for it was\nenchanted and caused great drowsiness and forgetfulness. They were able\nto cross it, but Bombur fell in. By the time they fished him out he was\nalready asleep and had to be carried by the rest of the company.\n\nEventually they reached a point where they were practically out of food\nand tried to beg from a group of feasting Wood-elves. Thorin was\ncaptured by these Elves, while the remaining company, with the exception\nof Bilbo, were snared by Giant Spiders. Bilbo rescued them with the help\nof his magic ring, but they were soon captured by the angry Elves and\nimprisoned by their king.\n\nWith the aid of the ring, Bilbo eluded the Dwarves' captors. Weeks\nlater, he found a way to free them. Hiding in empty wine barrels, the\ncompany made their way down the river to Lake-town. There they were fed\nand clothed with the hope that they would defeat Smaug and regain\nprosperity for the region.\n\nThey reached the mountain after a few days and tried to locate the\nSecret door described on the map. They found it with the help of a\nThrush. Thorin decided to have Bilbo enter the mountain and “burgle”\nsomething. This the hobbit did, and even had a conversation with the\nmighty Smaug (while wearing the Ring, so that he could not be seen). But\nthe enraged Dragon soon emerged and attacked Lake-town, leaving Thorin\nand Company free to enter the mountain. Meanwhile the dragon was slain\nby Bard of Lake-town, but the town suffered great loss and destruction.\nThe Dwarves remained inside the mountain until an army of Lake-men, and\nlater Wood-elves, led by the Elven-king, arrived seeking a share of the\ntreasure to compensate them for their losses. Thorin refused, and the\nDwarves were besieged within the mountain. They called for aid from\ntheir kin in the Iron Hills (a range to the east of The Lonely\nMountain).\n\nThe Battle of Five Armies and the Dissolving of the Company\n\n\n\nJust before they were about to fight the Elves, the company were joined\nby an army of Dwarves from the Iron Hills. Then Gandalf arrived, just in\ntime to inform them that an army of goblins and Wargs were coming to\nattack. The battle began and Thorin and Company went to war. Bilbo\nstayed out of the battle with the aid of the Ring. The enemy had the\nupper hand until the arrival of the eagles and Beorn. The company and\ntheir allies won but Fíli and Kíli had been killed and Thorin was\nmortally wounded. Bilbo bade farewell to Thorin as he lay dying, and\nthen left with Gandalf and a modest share of the treasure.\n\nLegacy\n\nThe deeds of Thorin and Company led to the restoration of the Dwarven\nKingdom of the Lonely Mountain and the Dwarven dynasty in the Lonely\nMountain, the Kingdom of Dale, the rebuilding of Lake-town, and\nrestoration of peace and prosperity in the immediate area for many\nyears. In the long term, the journey of Thorin and Company and the\nsituations it created led to the Council of Elrond and the formation of\nthe Fellowship of the Ring many years later and played a major part in\nthe starting of The War of the Ring.\n\nIt also depleted the forces of evil so that later Sauron would have less\nto call upon during the War of the Ring. Gloin's son, Gimli, would later\nbe a member of the Fellowship as well, contributing his axe to their\nultimate victory. Additionally, Bilbo's finding of the ring would bring\nit into the care of Frodo, who would one day bring it to its\ndestruction.\n\n\nMembers\n\n-   Thorin II Oakenshield (leader) \n-   Fíli\n-   Kíli\n-   Óin\n-   Glóin\n-   Balin\n-   Dwalin\n-   Ori\n-   Dori\n-   Nori\n-   Bifur\n-   Bofur\n-   Bombur\n-   Bilbo Baggins\n-   Gandalf\n\n  Name      Age (TA 2941)\n  --------- ------------------------\n  Thorin    195\n  Fili      82\n  Kili      77\n  Oín       167\n  Glóin     158\n  Balin     178 (book) 216 (movie)\n  Dwalin    169\n  Ori       76 (movie)\n  Dori      114\n  Nori      104\n  Bifur     127\n  Bofur     98\n  Bombur    107\n  Bilbo     50\n  Gandalf   5000+\n\n  : Age of the Members of the Company",
    "members": "Thorin Oakenshield, Bilbo Baggins, Gandalf, Dwalin, Balin, Bombur, Ori,\nNori, Bofur, Gloin, et al.",
    "purpose": "To take back Erebor and the treasure within from the dragon Smaug",
    "formed": "TA 2941",
    "dissolved": "TA 2942",
    "date founded": "T.A. 2941",
    "founder": "Thorin",
    "disbanded": "T.A. 2941",
    "gallery": "IMAGES OF THORIN AND COMPANY",
    "notable for": "Re-establishment of the Kingdom under the Mountain, bringing about the\ndeath of Smaug",
    "notable members": "Thorin, Balin, Dwalin, Fíli, Kíli, Dori, Nori, Ori, Óin, Glóin, Bifur,\nBofur, Bombur and Bilbo Baggins"
  },
  {
    "title": "White Council",
    "page_id": "2337",
    "text": "The WHITE COUNCIL, or COUNCIL OF THE\nWISE, was a group of Elves and Wizards of Middle-earth, formed in TA\n2463 to counterbalance the growing power of Dol Guldur at the request of\nLady Galadriel.\n\n\nHistory\n\nDuring the Second Age\n\nThere was also a Council of the Wise held in the mid-Second Age to\ndiscuss the growing power of Sauron in Mordor; this was also known as\nthe First White Council and was led by Gil-galad. Several members of\nthis council would also become prominent members of the Council in the\nThird Age.\n\nDuring the Third Age\n\n The White Council's head\nwas the Wizard Saruman the White, (although Lady Galadriel wished for\nGandalf the Grey to be made the leader of the group). Other members of\nthe Council included the Bearers of the Three Rings of the Elves\n(Gandalf, Galadriel, and Elrond Half-elven), Círdan the Shipwright (who\nhad borne Narya, the Ring of Fire, before handing it on to Gandalf),\nLord Glorfindel, and Radagast the Brown. It is assumed that others of\nthe wise were also members of the White Council.\n\n The White Council was formed in TA\n2463 shortly after the end of the Watchful Peace. In TA 2851 the\nWhite Council met to decide on whether to act on Gandalf's discovery\nthat the Necromancer was actually Sauron and was at Dol Guldur, but\nSaruman dissuaded the others from taking action, claiming that the Dark\nLord was defeated and could not regain his full strength. During this\nmeeting Gandalf suspected Saruman of desiring to have the One Ring, and\nthere was much tension between the two. However, in TA 2939, Saruman\ndiscovered that Sauron's servants were searching the Anduin near Gladden\nFields, and that Sauron therefore had learned where Isildur had died and\nwhere the One Ring might be. Saruman did not inform the Council of this,\nbut when they met again in TA 2941 Saruman finally agreed to an attack\non Dol Guldur because he wanted to prevent Sauron from finding the Ring.\nSauron was driven out of Dol Guldur, only to re-appear in Mordor in\n2951, where he declared himself openly and began gathering power. The\nCouncil last met in TA 2953; at this meeting Saruman falsely claimed\nthat the One Ring has been swept out into the sea. Afterward Saruman\nwithdrew to Isengard, and fortified it.\n",
    "other names": "The Council of the Wise[1]",
    "date founded": "T.A. 2463[2]",
    "founder": "Galadriel[3]",
    "purpose": "To co-ordinate the resistance to Sauron",
    "disbanded": "T.A. 2953[2]",
    "notable for": "Attack on Dol Guldur",
    "notable members": "Saruman[1]\nGandalf[1]\nGaladriel[1]\nElrond[1]\nCírdan[1]"
  },
  {
    "title": "Aratar",
    "page_id": "3742",
    "text": "The ARATAR (Sindarin for 'exalted') or the HIGH ONES OF ARDA were the\neight greatest of the Valar.\n\nIn descending order of power the Aratar were Manwë, Varda, Ulmo,\nYavanna, Aulë, Mandos, Nienna, and Oromë. Melkor had been the most\npowerful of all, but was removed from the order upon his rebellion.\nAlthough Tulkas was a Vala who lived in Valinor, he was not one of the\nAratar.\n\n\nOther names\n\nThe Aratar were also referred to as THE EIGHT, the '''Holy Ones of Arda,\n'''and the MÁHANI."
  },
  {
    "title": "Brandybucks",
    "page_id": "4933",
    "text": "The BRANDYBUCK CLAN was a powerful Hobbit family. They were mostly of\nStoorish blood, but with a Fallohide strain.\n\n\nHistory\n\nThe family began as the OLDBUCK clan, who named themselves such\napparently after a _Bucca of the Marish_, who became the first Thain of\nthe Shire. Ten Oldbuck Thains followed, until _Gordenhad Oldbuck_, the\neleventh Thain, crossed into Buckland over the river Brandywine, passing\nthe Thainship to the Took clan.\n\nGordenhad renamed himself BRANDYBUCK, and began delving the great smials\nof Brandy Hall. Around the hill was built the village of _Bucklebury_.\n\nThe Brandybucks formed a powerful dynasty, which became mostly\nindependent of the Shire, although Buckland remained nominally a part of\nit. They were seen as 'odd folk' by the other Hobbits of the Shire\nbecause they locked their doors at night (because of the exposure to the\nOld Forest). It should also be noted that the Brandybucks were not only\nthe most wary hobbit clan, but also one of the most organized in matters\nof militia. After the Ringwraiths invaded Frodo's house in Buckland, the\nmilitia was roused with the call of “Fear, Fire, Foes, Awake!” the\nmilitia of Buckland arrived, though the Ringwraiths escaped by riding\nthrough the front barricades of Buckland. This proves that the\nBrandybucks were not idle in matters of defense, perhaps due to their\nproximity to the Old Forest, and the attack of the White Wolves over the\nfrozen Brandywine River. Two instances in which the Brandybucks were\ncapable of fending off the rare (Though Minor) dangers that threatened\nthe shire.\n\n\nMasters of Buckland\n\nThe head of the family was the _Master of Buckland_, one of the\nofficials of the Shire. Gordenhad Brandybuck founded this office. Like\nthe Thain and Warden of Westmarch, the Master had only nominal\nauthority. The authority of the Master also extended across the\nBrandywine into the Marish of the Eastfarthing, due to the close\nproximity and the amount of business between the two areas.\n\n\n“Brandybuck” as a translation\n\nIt should be noted that the name _Brandybuck_ is only a translation of\nthe original Westron BRANDAGAMBA, _Marchbuck_. In keeping with the\nconcept that _The Lord of the Rings_ was derived from the translated Red\nBook of Westmarch, Tolkien translated all its Westron words into English\n— including the names of characters. See Westron for more information.\n\nde:Brandybock it:Famiglia Brandibuck pl:Brandybuckowie"
  },
  {
    "title": "Wardens of Lorien",
    "page_id": "5500",
    "text": "The WARDENS OF LORIEN were elven patrols that operated in small groups.\nThey defended the borders of the Golden Wood against the forces of Moria\nand Dol Guldur. They also had the role of scouts in Lorien. They wore\ngrey hooded cloaks.\n\nHaldir of Lórien and his company encountered the The Fellowship of the\nRing when the latter entered Lothlórien. After talking with the\nFellowship about the conditions for entering the realm; they led them\nblindfolded to the Lord and Lady of Lothlórien."
  },
  {
    "title": "The Host of Valinor",
    "page_id": "9618",
    "text": "THE HOST OF VALINOR also known as the HOST OF THE WEST was the great\nforce of Aman that defeated Morgoth at the end of the First Age.\n\n\nHistory\n\nMoved by the words of Eärendil, the Valar agreed once again to move\nagainst Morgoth. They assembled a great force led by Eönwë that\nconsisted of presumably all the Valar, Maiar and all the Elves of\nValinor except for the Teleri, who agreed only to sail the ships to the\nshores of the Beleriand. The great army was quickly joined by the Edain.\nThey met the forces sent by Morgoth in Anfauglith and easily defeated\nthem, but as they approached the Gates of Angband, they were driven back\nby the great winged Dragons led by Ancalagon The Black. Eärendil came\nforth, and was joined by the Eagles led by Thorondor; they reinforced\nthe Host of the Valar and defeated the forces of Morgoth. Ancalagon\nhimself was slain. Finally, the host routed all the remaining forces of\nthe pits of Angband and captured Morgoth, effectively ending his evil\nreign in Middle-earth.\n\nThe Host, however, will be reassembled to fight the forces of Morgoth\nthat will fight in Dagor Dagorath, it is believed in this battle the\ndark powers will be more powerful than ever before and will be able to\nstand against the host."
  },
  {
    "title": "Galadhrim Warriors",
    "page_id": "17762",
    "text": "The GALADHRIM WARRIORS served as the defence forces of Lothlórien. They\nwere elite elven troops armed with swords and longbows. They protected\nthe capital city of Caras Galadhon. They had weapons of a better quality\nthan those of the outer guards. This group may have been established by\nGaladriel and Celeborn.\n"
  },
  {
    "title": "Uruk-hai Pikeman",
    "page_id": "16512",
    "text": "URUK-HAI PIKEMEN formed the core of the ten thousand strong army that\nSaruman the White sent to attack the Rohirrim's fortress of Helm's Deep.\nUruk-hai Pikemen were equipped with large pikes around 12 feet in length\nin order to counter the cavalry that were the main strength of Rohan's\narmy. Their armor was similar to the rest of Saruman's Uruk-hai\nconsisting of a steel segmented breastplate, greaves, a helmet and\ngauntlets which often varied in appearance and quality due to being\nproduced by crude orc smiths. Nevertheless they were one of the most\nheavily armed and armored soldiers that fought on Sauron's side during\nthe War of the Ring.\n\n\nUsage\n\nWhen Saruman first began breeding the Uruk-hai Scouts, light and heavy\nsword wielding infantrymen were the only thing on his mind. When his\nthoughts turned to Rohan, it became apparent that however heavy the\ninfantry were, there was no standing against the legendary cavalry of\nthe Rohirrim. So were born the Uruk-hai Pikemen, for the best thing\nagainst a horse powered charge, is a long, sharp stick.\n\n\nBattle of Helms Deep\n\n\n\nDuring the Battle of Helms Deep most of the Uruk-hai Pikemen present\nwere unable to take an active part in the fighting until the Deepening\nWall was breached and the main gate had been battered down. Once the\nwall was breached the Pikemen were among the first units to become\ninvolved in hand to hand fighting taking a charge from Aragorn and the\nGaladrim elves, skewering many of them in their initial charge. The\nPikemen along with the rest of the Uruk-hai then pushed the remaining\ndefenders toward the keep. \n\n\n\nWhen Lord Eomer's forces arrived the next day to relieve the defenders\nthey were met with a bristling wall of pikes, that was fortunately\nbroken by the sun rising over the hill.\n\nWhat remained of the Uruk-hai was killed by Huorns as they attempted to\nretreat back to Isengard."
  },
  {
    "title": "Colony of Balin",
    "page_id": "15940",
    "text": "The “COLONY OF BALIN” refers to the settling of the group of Dwarves led\nby Balin in TA 2989 to recapture Khazad-dûm from the Orcs that had\ninhabited the ancient city. They succeeded at first, but in 2994 Balin\nwas killed by an orc archer - the colony then tried to escape, but the\ncombined prevention and terror of the Watcher in the Water and of\nDurin's Bane (the Balrog) stopped them, and all members were\nslaughtered.\n\nTheir story was found in the Book of Mazarbul when the Fellowship of the\nRing passed through Moria in January, 3019."
  },
  {
    "title": "Host of Turgon",
    "page_id": "15686",
    "text": "The HOST OF TURGON was an army assembled by Turgon, the King of Gondolin\nfor the fifth greatest battle against Morgoth, and the only time\nGondolin ever participated in any of the great battles of the First Age.\n\n\nHistory\n\nWhen Turgon had heard of a great mustering against the Dark Lord, he\nbrought forth an army of ten thousand Gondolindrim. Until the main part\nof the battle started, the host guarded the Pass of Sirion before\nmarching forth at the start of the battle and for the most part, the\nking was able to restrain most of his people from the rash onslaught\nstarted by Gwindor. Then the host of Turgon threw itself into the battle\njoining the ranks of the western host coming to the aid of Fingon, and\ntogether they battled the enemy on the wastes of Anfauglith.\n\nHowever, the enemy proved too powerful and the host was cast aside and\nthe battle lost. The host survived with help of the Men of the House of\nHador led by Húrin and Huor, and they were able to kept the enemy from\nbreaking through the Pass Sirion. Then Turgon, listening to the council\nof Húrin and Huor was persuaded to return to Gondolin. Battling its way\nsouth and covered by the valiant rearguard of the Hador, the host\nescaped back to Gondolin through the Encircling Mountains at the expense\nof the Hador who all perished in the Fen of Serech save for Húrin.\n"
  },
  {
    "title": "Guild of Venturers",
    "page_id": "15850",
    "text": "The GUILD OF VENTURERS was formed in Númenor by Prince Anardil (later\nknown as King Tar-Aldarion, the Great Captain). The guild was formed by\nAnardil for the purpose of exploring Middle-earth. Its guildhouse was\nlocated aboard Anardil's great ship _Eämbar_, which was moored on the\nsmall island of Tol Uinen, which was named after the sea Maia, Uinen.\nTol Uinen was located in the Bay of Rómenna.\n\n\nHistory\n\nIn Númenor, the guild was called the ''Uinendili. Uinendili ''meant\n“Lovers of Uinen”. The members of the guild were strong devotees of\nUinen, the Lady of the Seas, whom they believed favored their journeys.\nMembers of the guild were considered the most adventurous men of\nNúmenor. The guild made journeys across Middle-earth. They would travel\nfrom the Northern Darkness to the far south all the way down to the\nNether Darkness. They traveled the inland seas of the east towards the\nWalls of the Sun, which was as far as they would dare to venture. The\nonly land the guild did not travel to was the Undying Lands of Valinor,\nwhich they were not permitted to enter. The Guild of Venturers gave the\nNúmenóreans the title of Kings of the Sea."
  },
  {
    "title": "Mountain-trolls",
    "page_id": "9666",
    "text": "MOUNTAIN-TROLLS were a large type of Troll that were closely related to\nCave-trolls and Hill-trolls. They were allies of Orcs.\n\n\nHistory\n\nLike all Trolls, Mountain-trolls originated from Morgoth's twisting and\ncrossbreeding of other creatures of the world, and later became minions\nof Sauron.\n\nMountain trolls could be found in the mountains of Middle-earth. Their\ntype helped move the great battering ram Grond into place during the\nBattle of the Pelennor Fields, which they wielded and shattered the\nlarge gates of Minas Tirith with. Members of the species also were seen\nopening the gates of the Black Gate.\n\n\nPhysical appearance\n\nMountain-trolls were very large, larger than Hill-trolls, and had\nbrownish skin.\n\nBehaviour\n\nThe Mountain-trolls make dangerous opponents in battle. These trolls are\nsmarter than Cave-trolls, and their power to lift massive objects to use\nas weapons makes them deadly. They are assumed to be strong enough for\nother heavy tasks as well. They are stronger than cave trolls due to\ntheir harsh environment."
  },
  {
    "title": "Entwives",
    "page_id": "9794",
    "text": "ENTWIVES were female Ents.\n\nThey were put upon the earth by Yavanna to protect her trees along with\ntheir husbands the Ents. According to Treebeard, Fimbrethil was the most\nbeautiful of the Entwives. However, prior to the Third Age, the Entwives\nabandoned the Ents in order to start a garden east of Fangorn in what\nbecame the Brown Lands; following the end of the Second Age, they\ndisappeared. When Treebeard went searching for them, he could not find\nthem.\n\n\nDescription\n\nThe Entwives are described by Treebeard as having “hair parched by the\nsun to the hue of ripe corn and their cheeks like red apples. Yet their\neyes were still the eyes of our own people,” yet little else is known of\ntheir appearance. Like the males they looked after the growing things of\nMiddle-earth, but Entwives preferred smaller plant life such as: small\ntrees, grasses, fruit trees, flowers, and vegetables, while males tended\nthe larger trees.\n\n\nHistory\n\nLike all Ents they tended their lands in the vast primordial forests of\nMiddle-earth throughout the Elder Days, but sometime in the distant\npast, possibly starting in the Second Age, they became estranged from\ntheir husbands. They moved further East crossing the Great River Anduin\nand began living in what became the Brown Lands, tending lush gardens;\nHowever with the rise of Sauron throughout the Second Age these lands\nwere destroyed. After that they disappeared and everything about them\nwas the subject of rumor and conjecture, being remembered only in the\nsongs of Men and Elves. In the _The Lord of the Rings_, Sam Gamgee the\nHobbit mentions that his father Hamfast Gamgee claimed he saw a walking\ntree , but that was more likely a Huorn.\n\nWhat actually happened to the Entwives was something Tolkien wanted to\nkeep a mystery, even to himself, but in one of his letters he said, “I\nthink that in fact the Entwives have disappeared for good, being\ndestroyed with their gardens in the War of the Last Alliance.”\n"
  },
  {
    "title": "River Folk",
    "page_id": "10138",
    "text": "The RIVER FOLK were mainly Stoorish Hobbits who dwelt along the Anduin\nRiver in the Gladden Fields. The most famous of all River Folk was\nSméagol, who later, after his acquisition of the ring by killing his\ncousin Déagol after he found it at the bottom of the river, became the\ncreature Gollum. The River Folk were not warlike, and instead focused\ntheir craftsmanship on making fine boats and fishing rods. Sometime\nwithin the Third Age the River Folk disappeared, and the reason for\nthis, as well as their location, is unknown. They may have joined their\nkinsmen in the newly-settled Shire."
  },
  {
    "title": "Mountain men",
    "page_id": "10406",
    "text": "Mountain men included tribes of Men who lived in the Misty Mountains.\nThose of the Withered Heath were all slain when the Dragons came out of\nAngband in the north. They forged many crude weapons and armor such as\narrowheads, spearheads, swords, and circular shields. Their weapons and\narmor were generally of lower quality than that of soldiers from Gondor\nor Rohan. Mountain men may have had communites living in the White\nMountains, such as the people who allied with Isildur to fight Sauron,\nbut broke their oath."
  },
  {
    "title": "Men of Bree",
    "page_id": "11483",
    "text": "The MEN OF BREE, also known as BREE-FOLK, are the Men who lived in the\nvillage of Bree. The people who lived in the surrounding villages of\nCombe, Staddle, and Archet could also be referred to as Men of Bree\n(though some who lived there were hobbits). They are hardy folk who even\nbeat off an attack of Saruman's ruffians towards the end of the War of\nthe Ring.\n\n\nDescription & Historical accounts\n\nThe Men of Bree were mostly of Dunlendish stock who were probably in the\narea from as far back as the Second Age by those escaping the influence\nof Sauron. The early Third Age seems to be when the village was properly\nfounded and the townfolk became more civilised, unlike their wild\nkin-folk living in Dunland.\n\nWhen the Dúnedain exiled from Númenor came to Middle-earth in the\nlatter-half of the Second Age, the Men of Bree became part of Arnor, and\nafter it became divided, the Kings of Cardolan claimed it; however, from\nthe early 15th century onward it retained a certain degree of\nindependence.\n\nThe Men of Bree also lived with Hobbits (the only Men-folk to do so) who\nfled from the threat of Angmar that began arriving in TA 1300.\n\nThe Men of Bree lived mostly in houses on Bree-hill and usually met\nand socialised at the Inn of the Prancing Pony. They were not keen on\ntravelling, but were generally welcoming to strangers and\nvisitors.\n\n\nFamily names\n\n-   Appledore\n-   Ferny (see: Bill Ferny)\n-   Goatleaf (see: Harry Goatleaf)\n-   Heathertoes\n-   Rushlight\n-   Thistlewool"
  },
  {
    "title": "Thrall-Ñoldorin",
    "page_id": "11773",
    "text": "The THRALL-NOLDORIN are those Elves of the Noldor who have become slaves\nof Morgoth.\n\nIn the earlier conceptions of what would become _The Silmarillion_, all\nElven realms of Beleriand were destroyed much earlier than in the final\nwork, and virtually all the Noldor were enslaved by Morgoth as his\nthralls, working in the mines of Angband doing Morgoth's work. The only\nfree Noldor were escaped thralls or lucky refugees, who were mistrusted\nby the Sindar.\n\nMorgoth's power in these early works is perceived as great: he is able\nto dominate the minds of the Elves wherever they go, by instilling his\nfear in them. Even the escaped thralls are thus not truly free. It is\nnot inconceivable that in this early conception Thrall-Noldorin were\nused to breed the orcs.\n\nIn the later material the published _Silmarillion_ was based on, there\nare relatively few references to Morgoth's thralls. There are no clear\nmentions of what happens to the Elves Morgoth captures, except for\nGwindor, an elf-lord escapee who travelled with Túrin (exactly where\nFinduilas and the other women of Nargothrond were intended to be taken\nto is never said), but the idea is still present in the end of the\n_Quenta Silmarillion_, which mentions that the Valar freed Morgoth's\nslaves."
  },
  {
    "title": "Barahir's Outlaws",
    "page_id": "12241",
    "text": "BARAHIR'S OUTLAWS were a band of Men led by Barahir that roamed\nDorthonion after the Dagor Bragollach in FA 455, defying the will of\nboth Morgoth and Sauron.\n\n\nHistory\n\nAfter saving the life of Finrod Felagund at the Dagor Bragollach,\nBarahir refused to surrender or submit to the forces of the enemy and\nreturned to Dorthonion. There, from a camp set up near the hidden lake\nof Tarn Aeluin he and his men lived as outlaws, Barahir and his twelve\noutlaw-men harried those who would seek to undo all that was good in\nDorthonion. The outlaw band consisted of Barahir, his son _Beren the\nOne-handed_ , his nephews Baragund the elder and Belegund the younger,\nand nine other outlaw members.\n\nHowever, after many years of hardship, the number of the outlaw members\nbegan to dwindle; some grew disillusioned with their precarious\nsituation, among them Gorlim _the Unhappy_. For Gorlim longed for his\nwife Eilinel, who was found to be missing after his return from the\nDagor Bragollach war. Taken captive after a raid by the enemy, Gorlim's\nnerve failed and he revealed the location of the outlaw band to Sauron\nin exchange for the return of his wife. Thus, the location of the\nhideout was revealed to the enemy and all were slain, save for Beren,\nBarahir's son.\n\n\nMembers\n\n-   Arthad\n-   Baragund\n-   Belegund\n-   Beren\n-   Dagnir\n-   Dairuin\n-   Gildor\n-   Gorlim the Unhappy\n-   Hathaldir the Young\n-   Radhruin\n-   Ragnor\n-   Urthel"
  },
  {
    "title": "Ruffians",
    "page_id": "12371",
    "text": "The RUFFIANS or SHARKEY'S MEN were a band of about\n150 Dunlendings, Half-orcs, and Hobbits who invaded the Shire from the\nSouth under the hire of Sharkey.\n\n\nHistory\n\nAt first, they enforced Lotho's new laws and plans regarding the Shire\nand persecuted and imprisoned those who would not go along with them,\nbut after his murder they followed Sharkey's commands alone. Being\nrather unintelligent and not very numerous, after a couple of skirmishes\nwith hobbit country-folk they were defeated at the Battle of Bywater at\nthe end of the War of the Ring and buried in a place known as the Battle\nPit.\n\n\nNotes\n\nIn “The Scouring of the Shire” some of these men are indeed said to be\nHalf-orc. Aragorn also suggests that they were as well in the Two\nTowers."
  },
  {
    "title": "Lakemen",
    "page_id": "12825",
    "text": "The LAKEMEN were a people living in Laketown or Esgaroth from the race\nof men, and allies of Thror and the Dwarves that lived in the Lonely\nMountain.\n\n\nHistory\n\nLaketown was a settlement of men on Long Lake, and was built entirely\nout of docks that could be separated if necessary. This design made it\neasy for the Lakemen to catch trade goods that were sent down the River\nRunning by the Elves of Mirkwood.\n\nThe Lakemens' main appearance in Tolkien's works comes in _The Hobbit_,\nwhen Thorin and Company escaped from Mirkwood by stowing away in barrels\nand floating down the river. The Dwarves entered the town and were\nwelcomed generously. The Dwarves stayed in Laketown for a few days, and\nthen made their way towards the mountain. After Bilbo Baggins\naccidentally caused Smaug to assume that he was a Lakeman, the dragon\nbecame full of rage and flew off to destroy Laketown. The dragon\nattacked Laketown and proceeded to burn it until he was killed by a\nBlack Arrow shot from Bard the captain of the guard, who held his ground\nwith a few loyal men while everyone else, including the town leader\nfled.\n\n\n\nOnce the Thorin's Thorin and Company realized that the dragon wasn't\ncoming back, they moved into the mountain and held it. Meanwhile, the\nelves of Mirkwood had been building up an army to go and claim some of\nthe hoard left by Smaug; also the goblins of the Misty Mountains also\nhad built an army to avenge the death of the Great Goblin. The Dwarves\nof the Iron Hills led by Dain also built an army to save Thorin and\nregain the Lonely Mountain for the Dwarves. The Lakemen gathered what\ntroops they had left and joined the elves in front of the gate, hoping\nto get some of the treasure in order to rebuild the town. The Dwarves,\nelves, and armies of men met and were about to do battle when Gandalf\narrived and alerted them of the host of goblins. The three races, along\nwith the help of the great eagles, united to combat the massive goblin\narmy. When the battle was over, the coalition had won the day and the\nDwarves had regained the Lonely Mountain, the elves received some of the\ntreasure as well as the men, who rebuilt the town of Dale in front of\nthe gates of Lonely Mountain.\n"
  },
  {
    "title": "Helmingas",
    "page_id": "13422",
    "text": "The HELMINGAS, named in honour of the powerful Rohan king Helm\nHammerhand, were the traditional guardians of Helm's Deep, the most\nimportant fortress in Rohan.\n\n\nHistory\n\nAfter Calenardhon became Rohan, the two outposts that guarded the Gap of\nRohan, Isengard to the north and the Hornburg to the south, were still\noperated by descendants of Gondor. Eventually, Dunlendings took over the\noperation of Isengard, having mingled over the centuries with the\ntraditional wardens of Gondor and their families. A similar situation\noccurred in the Hornburg, but instead of mingling with the traditional\nwardens of Helm's Deep, the newly settled Rohirrim were formally given\nthe ownership of the outpost. The result was the Helmingas; those\nRohirrim dedicated to garrison and maintain the Hornburg, and perhaps\nthe only full-time soldiers in Rohan.\n"
  },
  {
    "title": "Dwarven Phalanx",
    "page_id": "13598",
    "text": "Most monstrous Dwarven foes are all best dealt with at a distance, and\nthe pike is the best solution for delivering strength beyond arm's\nreach. Aragorn finds one such Dwarven pike near Balin's tomb and, with\nit, is able to fend off a cave troll for a few moments on his own. The\nDwarves Pikeman is seldom this foolhardy, so he typically is part of a\nclose rank-and-file formation known as a PHALANX. A Phalanx is able to\nwithstand direct charge by cavalry and can bring down giant brutes with\na minimum of casualties. Much like other pikemen, Dwarven pikemen are\nemployed to counter cavalry units, large combat animals such as dragons,\ntrolls, giants and also to perform creeping operations to remove dens\nacross the battlefield."
  },
  {
    "title": "Royal Guard of Rohan",
    "page_id": "13797",
    "text": "ROYAL GUARD OF ROHAN or the KING'S GUARD OF ROHAN were a group of\nhand-picked men who guarded the King and Golden Hall of Meduseld in\nEdoras.\n\nThey were the most promising warriors of the kingdom. During times of\npeace, they served primarily in Edoras guarding the doors to the Golden\nHall. When the shadow of war was upon Rohan as such with the War of the\nRing, the Royal Guard was summoned by the king and accompanies him to\nbattle either by foot or horse. Its leaders were ranked as captains and\nduty titles included Doorwards.\n\nHama was their captain during the latter part of the Third Age and the\nWar of the Ring."
  },
  {
    "title": "Éoherë",
    "page_id": "14764",
    "text": "An ÉOHERË is the full Muster of Rohan at any given time. It is made up\nof one hundred Éored - units of 120 trained riders plus their captain. A\nmember of the Éoherë can serve a term or on a permanent basis.\n\n\nHistory\n\nDuring the first three hundred-plus years of Rohan's existence, the term\n“Éored” was used widely to describe any significant number of Riders.\nUnder Folcwine King son of Folca, fourteenth King of the Mark, the\nmilitary of Rohan was reordered. Under Folcwine, one Éored was made up\nof 120 riders including their captain. Each Éored was also supposed to\ncomprise one one-hundredth of the whole Muster of Rohan, not including\nthe household of the King.\n\nAn Éored was a group of trained warriors who rode as a unit. Under the\nmilitary reorganization in the time of King Folcwine, the size of a full\nÉored was determined to be at least 120 men. One Éored was one hundredth\nof the Éoherë - the full muster of Rohan. The Riders of an Éored could\nserve for a term or on a permanent basis. A Captain led each Éored. In\ntimes of war or unrest, the Marshals of the Mark each had a battle-ready\nÉored as part of his household, which he could command at his\ndiscretion.\n\nThe changes made by Folcwine lasted through the time of the War of the\nRing. While the Éoherë commanded by Théoden King son of Thengel at the\nBattle of the Pelennor Fields did not number much more than half of the\n12,000 riders supossed to be a full muster of Rohan, it was possibly the\nlargest riding of the Rohirrim in history. Éowyn (disguised as a Rider\nnamed Dernhelm) and Merry Brandybuck rode with the Éored commanded by\nElfhelm to the Battle of the Pelennor Fields on March 15. When the\nRohirrim charged onto the battlefield, Éomer led the first Éored in the\ncenter while Elfhelm's Éored was on the right flank and Grimbold's was\non the left flank and the other companies followed behind. King Théoden\nrode before them all.\n\n\nEtymology\n\nThe word ÉOHERË comes from the Anglo-Saxon Old English (which the tongue\nof Rohan was modelled after); it is made up of the words EOH meaning\n“horse” and HERË meaning “army.” Likewise Éored contains the words 'eoh'\nand 'rád' (horse, riding or rode)."
  },
  {
    "title": "Men of Brethil",
    "page_id": "14444",
    "text": "The MEN OF BRETHIL were the somewhat dogmatic Folk of Haleth's kin who\ndwelt in the Forest of Brethil on the western borders of Doriath,\ndescended from the Three Houses of Men in the First Age.\n\n\nHistory\n\nHaleth the Hunter, of the House Haladin, led a vast group of men over\nthe Blue Mountains (the second group to do so) to settle in Thargelion,\nthe land of the Elf-lord Caranthir. They never pledged any kind of\nallegiance to the Elf King, however, and lived in his realm as free men.\nHaleth became the leader of the House after her father and brother were\nslain in an Orc raid. Upon assuming control, she led her men to survive\na brutal Orc raid on their camp. On the seventh day of the raid,\nCaranthir arrived with reinforcements and helped fend off the rest of\nthe Orcs. Impressed by their victory, he offered the Men of Brethil a\nfiefdom in his kingdom, and in turn, the protection of his soldiers.\nHaleth refused this, however, for she was a proud person, and likely\nwished to retain freedom for her people.\n\nThe Men of Brethil were then led by Haleth to the Forest of Brethil in\nKing Finrod Felagund's land. They defended the Crossing of the Teiglin\nRiver from an enemy attack, and in return, King Finrod awarded them the\nfreedom to settle and be a separate people within his realm.\n\nOnce Haleth died, Haldad assumed the role of the leader of the Haladin\nHouse."
  },
  {
    "title": "High Elves",
    "page_id": "12253",
    "text": "The HIGH ELVES were those kindreds of Calaquendi who answered the\nsummons and traveled to Aman and settled there or descended from them\nwere also referred to as High Elves, or TARELDAR. It tended to be a term\nused by mortals, such as Men and Hobbits to distinguish the Ñoldorin\nexiles and other folk who left the Undying Lands and returned to\nMiddle-earth from lesser Elves who had never been to Valinor.\n\nHigh Elves tended to have considerable power, such as the ability to see\nRingwraiths and other shadow creatures, and to combat such entities.\nThose of the Ñoldor race were often skilled craftsmen as well. However,\nthe High Elves always longed to return to the Undying Lands, and most\nhad sailed from the Grey Havens by the time of _The Lord of the Rings._"
  },
  {
    "title": "White Company",
    "page_id": "10623",
    "text": "The WHITE COMPANY was the Prince of Ithilien's personal bodyguard.\n\nThe Company was formed after the War of the Ring by King Aragorn II\nElessar to guard Prince Faramir, the first Prince of Ithilien. Beregond\nserved as its first captain, as he had been dismissed from Minas\nTirith's Guard of the Citadel for his deeds during the war."
  },
  {
    "title": "Captains of the West",
    "page_id": "6313",
    "text": "The CAPTAINS OF THE WEST were the leaders of the men who went to battle\nbefore the Black Gate of Mordor.\n\n\nHistory\n\nThey included Aragorn, Éomer, Gandalf, and in the book, Prince Imrahil\nof Dol Amroth and the sons of Elrond, Elrohir and Elladan. With them\nrode Legolas, Gimli, Peregrin Took, and in _The Return of the King_\nMeriadoc Brandybuck, thus giving each of the Free Peoples of\nMiddle-earth a representative in the upcoming fight.\n\nAragorn led two thousand men (from the ones he led to Minas Tirith in\nthe ships of the Corsairs); Éomer led five hundred Rohirrim who didn't\nhave horses and another five hundred of his best riders on horse,\nImrahil led three and a half thousand men on foot; a final unit\nconsisted of the knights of Dol Amroth, the sons of Elrond, and the\nDúnedain Rangers, making up five hundred more horsemen.\n\nBy the time the Captains of the West reached Mordor's Black Gate, they\nhad already sent many men off to retake Cair Andros and to hold the\nCrossroads, leaving them with less than six thousand men."
  },
  {
    "title": "Grey Company",
    "page_id": "6308",
    "text": "The GREY COMPANY was a group of thirty-one Dúnedain Rangers of the North\nduring the late Third Age.\n\n\nHistory\n\nThe Grey Company was led by Halbarad and the twin sons of Elrond,\nElladan and Elrohir. They traveled from the North seeking Aragorn at\nGaladriel's request. They bring advice from Elrond, and a banner made by\nArwen. Their horses were strong and proud but rough-haired. As their\nname implies, they wear cloaks or mantles of grey colour and carry no\nsymbols save for a white star on each of their brooches.\n\nThey accompanied Aragorn, Legolas, and Gimli through the Paths of the\nDead and go with them to fight at Pelargir and in the Battle of the\nPelennor Fields. It was at this battle that Halbarad fell after slaying\nmany servants of Sauron. Later on, the Grey Company presumably\naccompanies Aragorn and an army to the Battle at the Black Gate,\nalthough few of them are said to have survived the battle.\n"
  },
  {
    "title": "King's Riders",
    "page_id": "3325",
    "text": "The KING'S RIDERS were specifically the Riders who formed the\nbodyguard of the King of Rohan. They were highly honored by the King.\nMany nobles of Rohan served in the King's Riders. The most famous of\nthem was Erkenbrand, Lord of the Westfold. They were not expected to go\nwar if the King stayed in Edoras.\n\nThese units were highly ranked and honored among all Rohirrim."
  }
]