[
  {
    "title": "House of Marach",
    "lotr_page_id": "3263",
    "text": "The House of Marach or HOUSE OF HADOR was the Third House of the Edain\nof the First Age.\n\n\nHistory\n\nThe House of Marach was named after their first leader Marach or more\ncommonly after his descendant Hador Lórindol, the House was the greatest\nof the Three Houses of the Edain, and most heroes of the First Age were\nmembers of it.\n\nMalach Aradan, Hador Lórindol, Adanel, Húrin Thalion, Túrin Turambar,\nHuor and Tuor were all descended from this House, as were Eärendil the\nMariner and his sons Elrond and Elros. Thus all the Kings and Queens of\nNumenor are descended from the House of Marach.\n\nUnder Marach they were a war-like tribe, united in speech and manners to\nthe First House of the Edain, the House of Bëor, and they settled in\nEstolad not long after the Bëorians and the Second House, the Haladin\nhad settled there.\n\nThey were the largest in number, and remained longest there, until they\nwere given the land of Dor-lómin as a fief under Hador Lórindol.\nAfterwards the House was referred to as the House of Hador.\n\nMost surviving Edain after the War of Wrath were members of this House,\nand as such they made up most of the people of Númenor.\n\n\nPhysical traits\n\nThe Men of the House of Hador typically had blonde hair and blue eyes,\nand were some of the tallest folk in Beleriand, save for the Noldor and\nmany of the Sindar who were Elves.\n\nde:Haus Hador it:Casa di Hador ru:Дом Хадора"
  },
  {
    "title": "House of Húrin",
    "lotr_page_id": "3262",
    "text": "The HOUSE OF HÚRIN were the hereditary Stewards of Gondor and was\nfounded by Húrin of Emyn Arnen, Steward to King Minardil, the\ntwenty-fifth King of Gondor. They were of high Númenórean blood, not\nfrom the ruling line of Elendil, but instead a female line from King\nEldacar. Due to the large percentage of pure Dúnedain ancestry the\nentire House of Húrin possessed, the majority of the Stewards lived\nrelatively long lives. Pelendur, a descendant of Húrin of Emyn Arnen,\nwas the first Steward of Gondor.\n\nAlthough they originated as servants of the king, the Stewards rose in\nprominence until they ruled the kingdom whenever the king was unable.\nAfter the last King of Gondor died without an heir, the House of Húrin\nruled Gondor for 969 years until the Heir of Isildur from the House of\nElendil, Aragorn, again reclaimed the throne after the War of the Ring."
  },
  {
    "title": "House of Telcontar",
    "lotr_page_id": "3264",
    "text": "The HOUSE OF TELCONTAR, previously the House of Elendil, was the Royal\nHouse of the Reunited Kingdom of Arnor and Gondor. The House was founded\nby Aragorn II during the War of the Ring, who was the last surviving\nHeir of Elendil, and took the throne under the name Elessar.\n\n\nHistory\n\nThe name of the House finds its origin in the Quenya version of Elvish.\nDuring the War of the Ring, Peregrin Took, a companion of Aragorn's in\nthe _Fellowship of the Ring_, became a member of the elite Citadel Guard\nat Minas Tirith, capital of Gondor. When Lord Aragorn entered the city,\nPeregrin persisted in crudely referring to Aragorn by the nickname he\nhad garnered as a Ranger of the North: “Strider”, even in front of\nforeign dignitaries such as King Éomer of Rohan. Aragorn was amused, and\ndecided that the name of the lineage he founded would be “Telcontar”,\nwhich translates as “Strider” in Quenya. Members of the House of\nTelcontar are referred to as the “Telcontari”, because Telcontari\n(Striders) is the plural of Telcontar in Quenya.\n\nAragorn then took the royal name “Elessar”.\n\nWith Queen Arwen, King Elessar reigned for 120 years, before finally\nsurrendering his life. This long reign is attributed to Elessar's\ndescent from the Men of Númenor, who are blessed with long life (he was\n87 when he took the throne). He rebuilt the old capital Annúminas in\nArnor and later ruled from this northern capital, although the old\ncapital Minas Tirith was still of great political importance. Elessar\nhad one known son, Eldarion, and an unspecified number of daughters.\nKing Elessar was buried with higher honor in Minas Tirith. King Eldarion\n(his name meaning “From the Elves” in reference to his mother Arwen) was\n“full ripe for kingship” at the time, and ruled for an unspecified\namount of time well into the Fourth Age of Men. Little is known of\nEldarion, save that he left heirs to continue the House of Telcontar\nafter him.\n\nde:Telcontar it:Casa di Telcontar"
  },
  {
    "title": "House of Fëanor",
    "lotr_page_id": "9657",
    "text": "The HOUSE OF FËANOR was a noble house of Elves.\n\n\nHistory\n\n\n\nIt was formed during the Years of the Trees when Fëanor married Nerdanel\nand had sons. After the death of Finwë and the theft of the Silmarils,\nthe house became dominate amongst the Ñoldor Fëanor, the only heir to\nthe throne of the Ñoldor should have been its ruler, but with his early\ndeath and the rash and traitorous deeds committed by him the house did\nnot rule the Ñoldor in Aman or Middle-earth. Instead, the overlordship\npassed to the House of Finarfin in Aman with the support of the Valar,\nand the House of Fingolfin in Middle-earth when Maedhros repented the\ndeeds of father after being rescued from torment on Thangorodrim by his\ngood friend Fingon.\n\nThe house became accursed and dispossessed in exile with most all of its\nmembers being slain in the evil deeds committed in the name of their\ndreadful oath. Despite the events of the First Age, the house did\nsurvive into the Second Age under the leadership of Celebrimbor, son of\nCurufin in Eregion until it was destroyed by Sauron in SA 1697.\n\nThe symbol of the House was an eight-rayed silver star."
  },
  {
    "title": "House of Finarfin",
    "lotr_page_id": "9659",
    "text": "The HOUSE OF FINARFIN was a noble house of Ñoldorin Elves.\n\n\nHistory\n\nIt was founded by Finarfin, son of Finwë, after his marriage to Eärwen\ndaughter of Olwë in YT 1280. The couple had four or (five) children:\nFinrod, (Orodreth), Aegnor, Angrod, and Galadriel. During the Revolt\nof the Ñoldor, Finarfin and household followed the House of Fëanor into\nexile. The Kinslaying at Alqualondë made Finarfin reluctant to journey\nfurther. At last, at the proclamation of the Doom of Mandos, Finarfin\nrepented and turned back to Aman where he sued for pardon to the Valar.\nHe returned, but his children did not come, thus the foundation of the\nHouse of Finrod in Middle-earth. In Aman, the High Kingship of the Elves\nwas passed to Finarfin.\n\nThe House is recognizable by the golden hair of its members due to their\nhalf-Vanyarin heritage from Finarfin's mother, Indis.\n\n\nOther versions of the legendarium\n\nIn _The Silmarillion_, Orodreth was the second son of Finarfin. This is\nan editorial mistake and Orodreth is later changed as the son of Angrod,\nand father of Finduilas and Gil-galad\n"
  },
  {
    "title": "House of Finwë",
    "lotr_page_id": "9771",
    "text": "The HOUSE OF FINWË was the\nfounding royal house of the Noldor in Arda.\n\n\nHistory\n\nThe House of Finwë was founded soon after the Noldor where established\nin Aman and Finwë married Míriel and then Indis. Their sons Fëanor,\nFingolfin, and Finarfin, who founded their own houses, became the\nsuccessors to the High Kingship of the Noldor in both Aman and\nMiddle-earth throughout the ages. Since Elros was of the House of Finwë,\nit is plausible that all the Kings of the Numenor, Gondor, and Arnor are\nof the line of Finwë, making them members of the House of Finwë."
  },
  {
    "title": "House of Finrod",
    "lotr_page_id": "13684",
    "text": "The HOUSE OF FINROD, no longer has a place that it can call home, and is\nmostly made up of Wanderers. During September of 3018 (Third Age)\nremnants of the House of Finrod found Frodo and Sam and helped them for\nthe night. Gildor, who was among them, said he would help them and sent\nword to Tom Bombadil, Aragorn and Glorfindel. The members that talked to\nFrodo and Sam said they were waiting to go to the Undying Lands, so it\nis likely that they departed over the sea into the west.\n\n\nOrigins (Speculative)\n\nThe true origins of the House of Finrod have not been fully explained.\nGildor said that he and his company were exiles and the only exiles\nknown that could possibly be connected to Finrod, son of Finarfin, if\nindeed this means it is connected to Finrod Felagund are the Ñoldor\nexiled from Valinor. However, Finrod did not marry his lover Amarië\nuntil much later in Valinor so it is not possible for him to have had\nany sons or daughters in Middle-earth. Therefore, unless some family\nmember came to Middle-earth from Valinor in later ages, perhaps to\nLindon or Eregion, the House of Finrod cannot possibly have a direct\nblood relationship to Finrod Felagund of the First Age. Therefore, it is\npossible that the House of Finrod is either an honorary title or\npossibly the name of the House of Finarfin operating in Middle-earth.\n\n\nNotable Members\n\n-   Gildor Inglorion\n"
  },
  {
    "title": "House of Olwë",
    "lotr_page_id": "32251",
    "text": "The HOUSE OF OLWË was a noble house of Telerin Elves.\n\n\nHistory\n\nAround YT 1150, Olwë led the most of his people to Beleriand. They\nstayed upon Tol Eressëa and were later called the Falmari. During this\ntime, Olwë established many realms and moved his people to Alqualondë.\nOlwë married an unnamed elf, possibly of Telerin origin like himself,\nand had several sons and a daughter called Eärwen. Through Eärwen, the\nHouse of Olwë continued down to her sons Finrod (who founded his own\nhouse), Angrod, Aegnor, and Galadriel. Through Angrod, his son\nOrodreth and Orodreth's children Finduilas and Gil-galad were members of\nthis house. Galadriel's daughter Celebrían was also a member, and so\nwere her children Elladan and Elrohir and Arwen.\n\nTheir realms included Tol Eressëa, Alqualondë, and possibly Avallonë and\nKortirion.\n"
  },
  {
    "title": "House of Bëor",
    "lotr_page_id": "657",
    "text": "The HOUSE OF BËOR was the oldest of the Three Houses of Men that had\nallied with the Elves in the First Age.\n\n\nHistory\n\nThe House of Bëor ceased to exist as an independent House after\nthe Dagor Bragollach, when Morgoth invaded their land and orcs overran\ntheir land.Some people did survive and the remaining led by Barahir\nstaged many attacks against the orcs but eventually they were betrayed\nand Barahir along with everyone else was slain by Morgoth.Beren was the\nonly survivor due to being sent to scout during the attack. Beren was\nnow the last person of the house of Bëor but in the Second Age some\nfamilies of Númenor still spoke Adûnaic with a notable Bëorian accent.\n\nFurthermore, the majority of faithful were those of Bëorian descent.\nThis was because the majority of the Men of Bëor had settled in the\nwestern part of Númenor, which later became the area controlled by the\nfaithful Lords of Andúnië. Traits of the House of Bëor were passed down\nto the Dúnedain of the Middle-earth and can be seen in Aragorn II\nElessar's physical description: lean, dark and tall, with “a shaggy head\nof dark hair flecked with grey, and in a pale stern face a pair of keen\ngrey eyes.”\n\n\nNotable members\n\n-   BËOR THE OLD, originally named Balan and later given the title _the\n    Old_, was leader of the House of Bëor, the first men to travel into\n    Beleriand. He met Finrod Felagund, who guided them to settle in\n    Estolad, east of Doriath. Bëor took service with Finrod in\n    Nargothrond. His name _Bëor_ meant _vassal_ in the Bëorian tongue.\n    He got his title, _the Old_, because he died at 93 years of age, of\n    which 44 were spent serving Finrod.\n\n&nbsp;\n-   BARAN was the eldest son of Bëor the Old and took up the leadership\n    of the House of Bëor when his father departed to Nargothrond. He\n    dwelt in Estolad and had two sons, BORON and BARANOR.\n\n&nbsp;\n-   BEREG, a grandson of Baran, was dissatisfied with Estolad, and led\n    part of the people away to parts unknown, disappearing from the\n    histories. It is possible some of his descendants were the ancestors\n    of the later Men of Eriador.\n\n&nbsp;\n-   BOROMIR was a son of Boron. The later Boromir of Gondor was named\n    after him. Boromir was granted the land of Ladros in Dorthonion as a\n    fief, and his house removed there.\n\n&nbsp;\n-   BREGOR was a son of Boromir and Andreth was Boromir's daughter.\n\n&nbsp;\n-   BREGOLAS, who died in the Dagor Bragollach, and BARAHIR were sons of\n    Bregor.\n\n&nbsp;\n-   BEREN was a son of Barahir, perhaps the greatest hero of the First\n    Age. He and Luthíen went to Morgoth and successfully cut a Silmaril\n    from his crown.\n\n&nbsp;\n-   BARAGUND was a son of Bregolas and a direct descendant of Bëor the\n    Old. He had one daughter, Morwen, and he was the grandfather of\n    Túrin Turambar. He survived the Dagor Bragollach and lived as an\n    outlaw with his uncle Barahir and some companions. They were\n    eventually betrayed by Sauron and killed."
  },
  {
    "title": "House of Elros",
    "lotr_page_id": "27215",
    "text": "The HOUSE OF ELROS was the line of Elros's descendants. Due to his\nancestry, he was Half-elven and given the choice of the immortality of\nthe Eldar or the Gift of Men. He chose to live as a mortal, but he had\nan extraordinary lifespan of 500 years. His descendants inherited his\nlongevity, but Elros was the only one who lived so long.\n\n\n\nElros, also known as Tar-Minyatur, was the first King of Númenor. After\nhis time the island was ruled by Kings and Queens of his house for about\n3,000 years of the Second Age. Elros's distant descendant\nAr-Pharazôn was manipulated by Sauron into bringing about the Downfall\nof Númenor, and so the end of the Line of the Kings.\n\nThere were no more kings for Númenor, but the House of Elros did not end\nin the Downfall. The Kings had been descended through Elros's\ngreat-great-grandson Meneldur, but another branch of the House also\nsurvived: the Lords of Andúnië, descended from Meneldur's elder\nsister Silmariën. The line of the Lords of Andúnië continued until\nElendil and his sons, Isildur and Anarion, and so was carried from\nNúmenor to Middle-earth and survived the Kings of Arnor and of Gondor.\nAfter the War of the Ring and 6,000 years after its founder, an heir of\nthe House of Elros was still alive. He could be no other than Aragorn II\nElessar.\n\nit:Casa di Elros"
  },
  {
    "title": "House of Isildur",
    "lotr_page_id": "44738",
    "text": "The HOUSE OF ISILDUR were the descendants of Isildur, elder son of\nElendil. The House came close to destruction at the beginning of the\nThird Age, when Isildur and his three eldest sons were lost at the\nDisaster of the Gladden Fields. His youngest son Valandil was kept safe\nin Rivendell, however, and from him came the line of the Kings of Arnor\nthat led over three thousand years to Aragorn II Elessar.\n\n\nThe Family Tree of the House of Isildur\n\nShowing the descendants of Isildur. All information in the tree is from\n_The Lord of the Rings_, Appendix A, “The Northern Line: Heirs of\nIsildur”, or “Eriador, Arnor, and the Heirs of Isildur”, or “The\nTale of Aragorn and Arwen”, or _The Peoples of Middle-Earth_, “The\nHeirs of Elendil” unless otherwise specified. The figures after the\nnames are those of birth and death where recorded (a single figure\npreceded by a 'b.' indicates a birth date). A dagger symbol, '†'\nsignifies those who did not die of old age. A name preceded by: '***'\nindicates a King of Arnor and Gondor, '**' indicates a King of Arnor\nalone, and '*' indicates a King of Arthedain. A vertical dashed line\nindicates a line of descent with some members missing.\n\n\nThe Realm of Arnor\n\nElendil and his two sons, Isildur and Anárion founded the two Númenórean\nrealms in exile: Arnor and Gondor. Elendil was the High King of all of\nthe Dúnedain but the rule of the southern kingdom of Gondor was\ndelegated to joint ruled under his sons. After the War of the Last\nAlliance of Elves and Men both Elendil and Anárion were dead, so Isildur\nbecame the new High King. When he left Gondor to take up his kingship in\nArnor he delegated rule of Gondor to Anárion’s son, Meneldil. However,\nIsildur and his first three sons perished in the Disaster of the Gladden\nFields. From that time forward the two realms were sundered, with the\nKings of Gondor descending from the House of Anárion and the Kings of\nArnor descending from the House of Isildur.\n\nit:Linea di Isildur"
  },
  {
    "title": "House of Haleth",
    "lotr_page_id": "665",
    "text": "The House of Haleth (or the HALADIN) was the second of the Three Houses\nof Men.\n\n\nHistory\n\nHouse of Haleth were the descendants of Haldad, but the house was named\nafter Haldad's daughter Haleth, who led her people from East Beleriand\nto Brethil. They were a reclusive folk, dark-haired but smaller in\nstature than the Bëorians. They kept separate from the other Men. Their\nlanguage was different from that used by the other Edain.\n\nThe Haladin first had settled in Thargelion after arriving in Beleriand,\nsince they were unwilling to settle in Estolad with the Bëorians and\nMarachians. They were caught off-guard by an Orc-raid there, and a great\npart of their people was wiped out. The remnant, fighting under Haleth\nand her kin, held out for days in a stockade until the Ñoldor rescued\nthem. Impressed by their virtue Caranthir offered them his lands to live\nin protected, but Haleth refused, and later got permission to settle in\nthe forest of Brethil, part of Doriath but outside the Girdle of Melian.\nThey mostly kept out of the wars.\n\nThe Haladin were ruled by a HALDAD, father of Haldar brother of Haleth,\nbut they formed a lose alliance of clans rather than a strong nation as\nthe other Edain. The Haldad was in charge of a council of elders, which\ntook decisions for the entire people. The last Haldad of Haldar's line\nwas Brandir the Lame, who was killed by Túrin Turambar.\n\nHúrin Thalion wrought the final ruin of the Haladin when he came to\nBrethil. He caused a civil war which killed the last descendants of\nHaldad, and led a great part of the Haladin away south to Nargothrond.\nHe abandoned them after delivering the treasure to Thingol of Doriath.\n\nAfter the fall of Doriath the Haladin were nearly completely wiped out,\nor at least they had disappeared as a separate people. The last Drúedain\nof Beleriand did go to Númenor, suggesting at least a few Haladin\nsurvived as well, as the Drûg formed a part of their people. They must\nhave held out in Brethil forest or fled to the Mouths of Sirion with the\nother survivors.\n\nSome of the Second and Third Age nations of Men, such as Dunlendings,\nwere related to the Haladin, but were not recognised as Middle Men by\nthe Númenoreans because their speech was too different, and they were\nhostile.",
    "dominions": "Thargelion (formerly) and Brethil",
    "members": "Haleth, Haldad, Haldar, et al.",
    "height": "Somewhat shorter than those of the House of Bëor"
  },
  {
    "title": "House of Fingolfin",
    "lotr_page_id": "2456",
    "text": "The HOUSE OF FINGOLFIN was a royal House of the Ñoldor.\n\n\nHistory\n\n\n\nThe House was founded by Fingolfin son of Finwë during the Years of the\nTrees. Fingolfin married Anairë and had four children with her: Fingon,\nTurgon, Aredhel, and Argon. The family lived in Tirion until the\nRevolt of the Ñoldor in which all members of the House, with the\nexception of Anairë, followed the House of Fëanor into exile. After the\nKinslaying at Alqualondë, Fingolfin led his  House to cross the\nHelcaraxë in which Turgon's wife Elenwë perished.\nThe Kingship of the Ñoldor passed over to Fingolfin after Fingon's\nrescue of Maedhros from Thangorodrim. Thus, the House held the\nnorthwestern lands of Beleriand: Nevrast, Dor-lómin, Hithlum, and\nGondolin. During the Dagor Bragollach, Fingolfin fell and Fingon took\nthe Kingship, ruling Hithlum until his death during the Nirnaeth\nArnoediad. According to the Silmarillion, Turgon later inherited the\nHigh Kingship rather than Fingon's son, Gil-Galad, likely because\nGil-Galad was very young whereas Turgon had greater experience.\nNevertheless, after Turgon's demise in the fall of Gondolin, his nephew\nGil-Galad inherited the High Kingship of the Noldor.\n\nAfter Nirnaeth, Tuor son of Huor arrived in Gondolin and wedded Idril\nTurgon's daughter. Thus, this was the second union of Elves and Men\nafter Beren and Lúthien. After the Fall of Gondolin in FA 510, the\nexiles lived at the Mouths of Sirion with the surviving elves of\nDoriath. Here, Eärendil son of Tuor and Idril wedded Elwing daughter\nof Dior. They had two sons Elros and Elrond, called the Half-elven, who\nwere given the choice whether to be counted among the Elves or Men.\nElrond chose to be of the Firstborn while Elros chose to be counted\namong the Men and became the first King of Númenor.\n\n\nOther versions of the legendarium\n\nIn _The Silmarillion_, Gil-galad was listed as the son of Fingon.\nHowever, this was later corrected by Christopher Tolkien and made\nGil-galad the son of Orodreth and member of the House of Finarfin\ninstead."
  },
  {
    "title": "House of Anárion",
    "lotr_page_id": "28182",
    "text": "The HOUSE OF ANÁRION was the Royal House of Gondor, descended\nfrom Anárion, joint first King of Gondor with his elder\nbrother Isildur who went north to Arnor. When the last King of Gondor\ndied without an heir, the Stewards of the House of Húrin ruled in their\nstead for the next 969 years until the House of Elendil successfully\nreclaimed the Throne after the War of the Ring.\n\nit:Linea di Anárion"
  },
  {
    "title": "House of Thingol",
    "lotr_page_id": "32253",
    "text": "The HOUSE OF THINGOL was a noble house of Sindarin Elves.\n\n\nHistory\n\nThingol, originally called Elwë, traveled with his brother Olwë across\nArda but in YT 1130, he went astray from his people and was lost in Nan\nElmoth. In this forest he met Melian the Maia of Varda and was\nentranced by her. He fell into a deep sleep and could not be found by\nOlwë and the Teleri. Some thousand years later, Elwë awoke from his\ntrance and lived with Melian in Beleriand. He established the realm of\nDoriath and ruled over the Sindarin elves as Elu Thingol.\n\nIn YT 1200, Thingol's daughter Lúthien was born in Neldoreth. After\nthe Quest for the Silmaril in FA 466, Lúthien lived with her lover\nBeren of the House of Bëor. Thus was the first union between Elves and\nMen. They had one son Dior, who was called Heir of Thingol, and later\nKing of Doriath. Through Dior and his wife Nimloth, Eluréd and\nElurín, and Elwing were members of the House of Thingol. Through Elwing,\nher sons Elros and Elrond were also members.\n\nThe House of Thingol ruled over the realm of Doriath for well nigh four\nthousand years, from YT 1152 until FA 506 during the Second\nKinslaying."
  },
  {
    "title": "House of Tulkas",
    "lotr_page_id": "35548",
    "text": "The HOUSE OF TULKAS was the dwelling of Tulkas in Valmar, the city of\nthe Valar in Valinor.\n\n\nHistory\n\nThe house is said to have sprung “_high into the air with many\nstoreys_”, and to sport a “_tower of bronze and pillars of copper in a\nwide arcade_”. Tulkas's house also had a court, where champions engaged\nin athletic games. There would often Nessa, wife of Tulkas, appear to\nbring goblets of wine and drinks to the players. \n\n\nNotes\n\n-   The house could have been referenced by the Greek God of war Ares.\n"
  },
  {
    "title": "House of the Hammer of Wrath",
    "lotr_page_id": "40744",
    "text": "The HOUSE OF THE HAMMER OF WRATH was one of\nthe kindred of Gondolin whose lord was Rog.\n\nThey were great smiths and craftsmen, and revered Aulë. In battle they\ncarried great maces like hammers, and heavy shields, for they had strong\narms. The device of this people was the Stricken Anvil and a hammer that\nsmites sparks about it; this was set upon their shields, for red gold\nand black iron was their delight. They had a great hatred for Morgoth\nand the Balrogs, and during the Fall of Gondolin they slew a number of\nthe fell beasts, being the first of Elves and Men alike to slay a\nbalrog. All of them perished in that battle, when a large force of\nBalrogs, Orcs and Fire-drakes was unleashed upon them.it:Casata del\nMartello dell'Ira"
  },
  {
    "title": "House of the Tree",
    "lotr_page_id": "40753",
    "text": "The HOUSE OF THE TREE was one of the noble Houses of the\nGondolindrim of Gondolin, under the leadership of Galdor. They wore\ngreen, and carried iron-studded clubs and slings.\n\n\nHistory\n\nDuring the Fall of Gondolin, they were one of the two main kindreds that\nfirst hurled themselves upon the Balrogs and Orcs upon the destruction\nof the Gate of Gondolin. They guarded the western entrance to the Arch\nof Inwë. Many escaped the slaughter with Tuor, and were scouts ahead of\nthe women and children, for they had “eyes like cats in the dark”, later\ndwelling at the Mouths of Sirion. They are often referred to as\nthe _People_ or _Folk of Galdor_"
  },
  {
    "title": "House of the Heavenly Arch",
    "lotr_page_id": "43664",
    "text": "The HOUSE OF THE HEAVENLY ARCH was one of the twelve houses of the\nGondolindrim in the First Age. Their captain was Egalmoth. \n\nThe Elves of this house wore vestiture of many vivid colors, since _The\nHeavenly Arch_ referred to the rainbow. Along with those of the House of\nthe Swallow, these Elves were the finest archers in Gondolin, and some\nof the greatest swordsmen. Each of their weapons was set with bright\njewels, and their shields were blue, bearing in the middle seven\nprecious minerals of color.\n\nDuring Gondolin's fall, bowmen of the Heavenly Arch fired many volleys\nof arrows upon enemy orcs at the city's northern walls. As the odds of\nthe onslaught turned slowly against the Gondolindrim, these defenders\nretreated to the Square of the Palace, along with others, where Tuor\ngathered them. By the end of the battle, few warriors of the House of\nthe Heavenly Arch had escaped and lived on.\n"
  },
  {
    "title": "House of Dol Amroth",
    "lotr_page_id": "45878",
    "text": "The '''House of Dol Amroth''' was a noble house of Gondor whose male\nheirs were the Princes of Dol Amroth descended from Galador the first\nprince. Legend told that his father, Imrazôr the Númenórean, married a\nSilvan Elf named Mithrellas, and from that time forward the house and\nkin were noble by blood and fair in face and mind.\n\n\nThe Family Tree of the House of Dol Amroth\n\nShowing the descendants of Galador, the first of the Princes of Dol\nAmroth. All information in the tree is from ''The Peoples of\nMiddle-Earth'', \"The Heirs of Elendil\", either ''The Line of Dol\nAmroth'' or ''The House of Dol Amroth''."
  }
]