[
  {
    "title": "Dalish",
    "page_id": "45828",
    "text": "DALISH was the language of the inhabitants of Dale. It derived from\nRohirric and Westron.\n\nThe Dwarves of the Lonely Mountain spoke this language and many of their\nnames (Ori, Nori...) were in fact Dalish, so as not reveal their true\nlanguage, Khuzdul. It was similar to Rohirric, the language of Northmen\nand the language of certain Hobbits."
  },
  {
    "title": "Dunlendish",
    "page_id": "43232",
    "text": "'''Dunlendish '''was the language of the Men who were native to\nCalenardhon (the lands that became Rohan) and then to Dunland - the\nDunlendings, or “Wildmen”.\n\nThis tongue was quite unlike the Common Speech, and seemed to have roots\nin an older Mannish tongue not akin to what Edain spoke. One known\nDunlendish word was _forgoil_, a name with which the Dunlendings\ninsulted the Rohirrim.\n\nSometime in the early Third Age, the Stoors likely adopted this language\nwhen making abode in or near Dunland.\n"
  },
  {
    "title": "Gondor Sindarin",
    "page_id": "45924",
    "text": "GONDOR SINDARIN was a dialect of the Elven language spoken by the Men\nof Gondor.\n\n\nDifferences\n\nWestron was the first language of Gondor. The nobility usually learned\nSindarin, and used it to be polite to other nobles and strangers\nalike. Because it was both an acquired and a learned language, it had\nsome notable differences with “regular” Third Age Sindarin.\n\n\nPhonetical\n\nLike any acquired language, the second language's sound range is\ndirectly influenced by the speaker's original sound range. Westron did\nnot possess _ch_ or _y_, and pronounced them differently.\n\n\n“Y”\n\nThe _y_ was pronounced by Sindarin Elves as IPA , a close front\nrounded vowel. Of all languages, only Sindarin had this sound, so it was\nproblematic for speakers of other tongues. Gondorians generally\npronounced it as an _i_, though it was sometimes substituted with an\n_e_, as in the Gondorian plural for _onod_, _ened_ (rather than the\nusual _enyd_).\n\n\n“CH”\n\nAlso frequent in Sindarin was the _ch_, the velar fricative, which the\nGondorians also encountered among pre-Númenórean placenames such as\nErech and Eilenach.\n\nThe most notable use of the voiceless velar fricative was in the name of\nGondor's new northern neighbour, Rohan. Originally envisioned as\n_Rochand_, in Gondor this became _Rohan_. Though the tongue of the\nÉothéod did possess the voiced _ch_, it adopted the southern use. The\nvoiced velar fricative, which is found in _Rochand_, was pronounced as a\nsounded _h_, while the voiceless variant, at the end of words, was\npronounced as a _k_. Those very learned would pronounce them correct,\nbut forcibly so.\n\n\nPhilological\n\nAnother notable difference from regular Sindarin was purely\nphilological. Those Gondorians learned in lore wished to speak like\nNoldor, and the Sindarin they spoke in the First Age was North Sindarin.\nAt least one feature from North Sindarin was reintroduced: whereas “true\nSindarin of the Elves” changed both the voiced and voiceless combination\nof a sonorant consonant and a spirant to a long sonorant, the Gondor\nSindarin retained the spirant. Thus in the case of the former, _malt_\n(“gold”) and _orn_ (“tree”) became _Mallorn_, in Gondor this remained\n_Malthorn_."
  }
]