[
  {
    "title": "Elendili",
    "page_id": "581",
    "text": "The Faithful_Elendili_' or ELF-FRIENDS are a faction of\n    Númenóreans who advocated continued friendship with the Elves. They\n    were also called the FAITHFUL for their continued devotion and\n    obedience to the Valar. Their most noted leader was Elendil, Lord of\n    Andúnië, who later founded the kingdoms of Arnor and Gondor in\n    Middle-earth.\n\nBy the close of the Second Age Númenóreans had become split between the\nElendili and the King's Men — a faction centered around the King that\nsought to assert Númenórean authority and self-determination. With\nNúmenor reaching the apex of its might, the King's Men eventually\nespoused open defiance of the Valar. This split would eventually\nprecipitate the Fall of Númenor.\n\nThe Elendili, however, not only preserved their ancient friendship with\nthe Elves, they also regarded the burgeoning arrogance of the King's Men\nas blasphemy. But the King's Men became more powerful, and by the end of\nthe Second Age had begun to persecute the Elendili as rebels and\ndissidents. Fearing their growing strength, the King's men secured the\nFaithful's deportation from their strongholds in the western regions,\nnotably around the city Andúnië.\n\nThe Elendili enjoyed a brief respite when Elf-friend Tar-Palantir\nassumed kingship and began to turn Númenor back to the ways of the\nFaithful. But after Tar-Panatir died, his nephew Ar-Pharazôn usurped the\nthrone and the Elendili were more vigorously oppressed, this time with\nthe help of the Dark Lord Sauron, who had established an evil cult on\nthe island to corrupt and eventually destroy Númenórean society.\n\nAs Ar-Pharazôn led his grand armada to Aman to challenge the Ban of the\nValar, Elendil and the remaining Elf-friends were warned by the divine\npowers to leave Númenor forever. They were thus spared the downfall of\nNúmenor when, as punishment for an attempt to defy the Ban, Ilúvatar\nsank the island kingdom into the sea.\n\nThe Elendili, under the leadership of Elendil and his sons, eventually\nmade their way to refuge in Middle-Earth where they were welcomed by the\nElves. There they established the Dúnedain kingdoms of Arnor and Gondor.",
    "name": "The Faithful",
    "other_names": "_Elendili_,\n\nElf-friends",
    "origins": "Númenór",
    "leader(s)": "Tar-Palantir\n\nAmandil\nElendil\nIsildur\nAnarion",
    "dominions": "Númenor (early)\nArnor and Gondor (later)",
    "rivalries": "The King's Men",
    "languages": "Adûnaic, Westron, Sindarin",
    "lifespan": "Númenóreans lived around 350 years while royal kindred lived 400 years\n(formerly)\n\n150-180 years of average except the Kings and Chieftains of the Dúnadan\nwho had a considerably longer lifespan.",
    "distinctions": "Mortality, Wisdom",
    "height": "Usually tall",
    "skin_color": "Fair",
    "hair_color": "Black, brown, blonde, grey or white (in later years)"
  },
  {
    "title": "Edain",
    "page_id": "656",
    "text": "The EDAIN (sing. ADAN) also known as ATANATÁRI, FATHERS OF MEN, and_'\nThree Houses of Men_', are a group of Men that came to the Beleriand\nfrom the Far East during the First Age.\n\n\nHistory\n\nIn the early fourth century of the First Age the Edain, drawn towards\nthe Light of the West, came into Beleriand where they befriended the\nelves, entered their service, received land and title for that service,\nand fought valiantly in the Battles of Beleriand. Some, however,\nremained in Estolad or fled south or east from the power of Dark Lord\nMorgoth, and passed from history until the Third Age. Despite their\nmighty heroes, the Edain were decimated by the hordes of Morgoth, but\none of their numbers, Eärendil of the House of Hador, sailed to Aman and\nobtained from the Valar the aid by which Morgoth was defeated in the\nLast Battle. The remnant of the Edain, now increased in body and mind by\nEönwë, then sailed to Númenor and became known as Númenóreans and later\nthe Dúnedain who came to live in Middle-earth in the Realms in Exile\nafter the Fall of Númenor.\n\n\nThree Houses of Man\n\nThey were divided into three tribes, or “Houses”:\n\n1.) The HOUSE OF BËOR: they were dark-haired and stoutly built, and most\nresembled the Ñoldor of all Elves. They were first discovered by Finrod\nFelagund, Lord of Nargothrond, and under his guidance later made their\nway to the lands of the Ñoldorin lord Amrod, in a place later known as\nEstolad, the Encampment. They remained loyal to the House of Finarfin,\nand later settled in the lands of Dorthonion.\n\n2.) The Second House, later known as the HALADIN or the HOUSE OF HALETH:\nThey were a reclusive folk, dark-haired but smaller in stature than the\nBëorians. They usually kept separate from the other Men, and were later\ngranted permission to settle in the Forest of Brethil, part of Doriath.\nThey mostly kept out of the wars.\n\n3.) The HOUSE OF MARACH, later best known as the HOUSE OF HADOR: They\nwere originally led by Marach but later took the name of Hador in honor\nof him. Tall and golden-haired, they most resembled the Vanyar of the\nelves. They were a very numerous and war-like tribe, and the Green Elves\nof Ossiriand feared them. They first settled in Estolad, then in the\nsouthern parts of Ered Wethrin (Mountains of Shadow), and then later in\nDor-lómin. They were loyal to Fingolfin.\n\n\nCharacteristics\n\nThe Edain were tall, fair, and strong; their spirits were noble, they\nwere fierce in war, and they shunned all dealings with evil. In\nBeleriand the Edain loved the Eldar, from whom they learned much wisdom,\nand they were further ennobled by the two marriages of Elda and Adan:\nBeren and Lúthien and Tuor and Idril. The lifespan of the Edain before\nthey entered Beleriand was probably about 70 years; in Beleriand, it was\nlengthened to 90, but few of the Edain lived to old age in peace.\n\n\nLanguage\n\nThe language of the Edain (at least those of the First and Third Houses)\nwas related to Adûnaic, but in Beleriand, most of the Edain spoke\nSindarin, and so the tongue of the Haladin was alien to them.\n\n\nFate of the Edain\n\nThe House of Bëor was nearly wiped out by Morgoth, and the remainder of\nits people merged with the Hadorians and became the Númenóreans. It\nwould seem that the Haladin of Beleriand were completely wiped out, or\nat least disappeared as a separate people.\n\nWhen they returned as Númenóreans to Middle-earth in the Second Age,\nthey encountered many men who were obviously related to the Atani: they\nclassified these men as _Middle Men_, and established friendly relations\nwith them. Examples are the Rohirrim, the Men of Dale, and the\nBreelanders.\n\nOther men, such as the Dunlendings, were not recognised as Middle Men\nbecause they were related to the Haladin rather than Bëorians or\nMarachians, and they were hostile to Númenor.\n\nA fourth kind of men came with the Second House, and called themselves\n_Drughu_. This name was adopted in Sindarin as _Drúedain_:\n_Drû_+_Edain_. They were a strange people, living with the Haladin in\nthe forest of Brethil, some even apparently made it to Númenor, but they\ndied out or had left before the Akallabêth. In the Third Age, their far\nkin were known as the _Woses_ of the Drúadan Forest. They had dwindled\nto a very small number and were secretive but were renowned for the\nassistance they gave to the Rohirrim in the War of the Ring.\n\n\nEtymology\n\nThe Sindarin word _Edain_, singular _Adan_ (Quenya _Atani_, _Atan_),\nliterally meant _Second People_, and originally referred to all men, but\nlater it only applied to the Men of Beleriand and their descendants. The\nQuenya term _Atani_ kept its old meaning.",
    "pronunciation": "_EH-deyen_",
    "origins": "Men who crossed into Beleriand",
    "gallery": "IMAGES OF EDAIN",
    "languages": "Mannish, Sindarin",
    "locations": "Beleriand, Middle-earth, Númenor",
    "members": "Húrin, Túrin, Tuor, Beren, Barahir, Andreth, Morwen, Bëor"
  },
  {
    "title": "Númenóreans",
    "page_id": "897",
    "text": "NÚMENÓREANS were the scion of the Edain, the most noble race of Men\nduring the First Age. These men were given the island of Numenor at the\nbeginning of the Second Age by the Valar.\n\n\nOrigins\n\nAs mentioned, the Númenóreans were the descendants of the Edain, the\nElf-friends of the First Age. As a reward for their services during the\nWar of Wrath, the Valar gave them an island continent in the western sea\nwhich became Númenor as their abiding place. They also gifted with far\nlonger life (300 years or more average), greater height, and greater\nwisdom.\n\nNúmenor, which had been raised up by Ulmo, was shaped like a star upon\nthe ocean, and was in between Aman and Middle-earth. These Edain reached\nthe island in the year 32 S.A.. Elros, the brother of Elrond, was their\nfirst king.\n\n\nPhysical Characteristics\n\nBeing descendants of the Edain, the men of Númenor were well bred.\nExceptionally strong individuals were legendary.\n\nMost had dark hair, however lighter hairs (blondes) did exist. They were\nalso on average very tall; with Six foot, four inches being the average\namong them. Many far exceeded such height; Elendil himself being\nnicknamed “_ELENDIL THE TALL_” being over seven feet high. One\ncharacteristic that set them apart from typical men was their ages.\nNúmenóreans were not immortal as the Elves or Ainur, however in\ngratitude in their service during the War of the Wrath, they were\nblessed with extended lifespans averaging over 300 years. Bloodlines\nfrom the House of Elros could live for over 400-500. They aged slower\nthan their typical counterparts.\n\n\nHistory\n\nFrom the start, the friendship of the Númenóreans was between the\nDúnedain of the West and the Eldar of Eressëa. The white swan ships of\nthose Eldar brought many gifts to the Númenóreans: birds, trees, herbs,\nand more. Unfortunately, as time progressed, the kings of Numenor began\nto envy the Eldar for their immortality, and a fear of death infected\nthe island. Later on, kings fell dead, decrepit and witless, as they\nhopelessly clung to their lives. Thus faded the bliss of the\nNúmenóreans, if not their power. They had sailed the earth to the East\nin their wooden ships, and even glimpsed from their tall ship prows the\nGates of Morning, in the eastern continent. They founded many colonies\nin Mortal Lands, north and south, and there they ruled. With the gradual\ncreation of a colonial empire, the pride of the Kings grew. The old\ncustoms were for the most part abandoned; those that were kept were kept\nout of fear of the Valar. Most of the Númenóreans distanced themselves\nfrom the Eldar, and towards the end they persecuted any who were in\nfellowship with them. The 25th King, and also the last, Ar-Pharazôn, was\nmade angry by the reemerging Sauron in Mordor. The King sent a vast\narmy, so large and imposing that Sauron found himself deserted by his\nown armies, not a single large battle fought. But what Sauron could not\ncrush with his armies, he would manipulate with cunning mind and\nhoneyed-tongue. He prostrated himself before Pharazôn, and was taken\nprisoner. In less than three years, the Dark Lord had gone from\ntop-priority prisoner to the King's greatest councilor. All save one\n(Lord Amandil of Andúnië) of the Royal Council fawned on Sauron.\n\nAfter many years, the king felt the shadow of death near, and Sauron,\never the opportunist, seized his chance. He told the aging king of “The\nGiver of Freedom and Life” Melkor, behind closed doors. The king,\ndesperate to escape death, turned to the worship of the Dark. At\nSauron's urging, a great temple was built, and the tree Nimloth was cut\ndown, though not before Isildur, Amandil's grandson, escaped with a\nfruit of the tree. In the year 3310 SA, Sauron urged Pharazôn to take\nwhat the king desired for so long, the immortality of Aman. In 9 years,\na vast fleet was made ready, and Pharazôn, almost wavering, boarded his\nflagship, Alcarondas, and set sail. 39 days later, Numenor met with\napocalypse. The king had landed at Aman, and the Valar had ceded\nguardianship of Arda to Eru. Eru tore Aman away from the world, and\nformed the flat disc of Arda into a globe.  Númenor\nwas flooded, and its proud towers and walls crumbled. Sauron was taken\nunawares, and his last fair form was destroyed, and “as a gale” he\nescaped. Not all the Númenóreans were killed, however. Nine ships, led\nby Elendil son of Amandil escaped to the North of Middle-earth, and\nthere founded the kingdoms of Gondor and Arnor. The race of Black\nNúmenórean colonists existed far away in Harad still, as well as the\nrest of the Númenóreans' colonies.",
    "other_names": "Númenóreans",
    "dominions": "Númenor, Eriador, Harad, later Arnor and Gondor",
    "languages": "Adûnaic (native tongue), Quenya, Sindarin",
    "members": "Elros, Aldarion, Ar-Pharazôn, Elendil, Isildur",
    "lifespan": "Númenóreans - 300-350 years\nKings of Númenor - 400-500 years",
    "distinctions": "Increased lifespan, wisdom, and physical abilities",
    "height": "Taller than other men",
    "pronunciation": "_NOO-meh-NOR-ee-ans_",
    "other names": "Men of Westernesse",
    "origins": "Descendants of the Edain",
    "affiliation": "Eldar",
    "rivalries": "Sauron",
    "average height": "Taller than other Men",
    "gallery": "IMAGES OF NÚMENÓREANS",
    "locations": "Númenor, Eriador, Harad, Umbar, Pelargir, later Arnor and Gondor"
  },
  {
    "title": "Black Númenórean",
    "page_id": "893",
    "text": "The BLACK NÚMENÓREANS were a fallen group of Númenóreans who were\ndescended from those loyal to the Númenórean crown but opposed to the\nValar and relations with the Elves. They listened to the words of\nSauron. Soon they were corrupted by him, and would come to worship the\nDarkness and Morgoth.\n\n\nHistory\n\n\n\nSecond Age\n\nOrigins\n\nAs the power and knowledge of the Númenóreans grew throughout the course\nof the Second Age, they became increasingly preoccupied with the limits\nplaced on their contentment in the world - and eventually their power -\nby mortality, the purpose of which they began to question.\n\nAs time went on they began to fear death more and more and ultimately\nwished to escape it. So the Númenóreans became envious of the immortal\nElves (the Eldar), whom they had come to physically resemble as part of\ntheir reward from Ilúvatar for having been their allies. The Eldar\nsought ever to remind the Men of Númenor however, that death was a gift\nfrom Ilúvatar to all Men, and to lose faith in Ilúvatar would be\nheretical.\n\nNevertheless, after SA 2221, when Tar-Ancalimon became King of Númenor.\nThe 'King's Men' therefore became increasingly predisposed to the\ncorruption of Sauron after he came to Númenor.\n\nEventually, in Númenor's last years, its hugely powerful but elderly\nKing Ar-Pharazôn, who had become “frightened of old age” (_Letters_,\nno.156), was persuaded by Sauron that Ilúvatar was a lie invented by the\nValar, and seduced him. Within Númenor, the majority immediately\nfollowed suit, and this worship quickly passed across the ocean when\nthey sailed eastwards from Númenor, to most of Númenor's colonies in\nMiddle-earth where the group started in proper.\n\nThe group thrived in Middle-earth, particularly in Umbar after the\ndestruction of Númenor. They continued to oppose The Faithful, from\nwhich came the Kings of Arnor and Gondor, the Black Númenóreans remained\nloyal towards Sauron.\n\nThree of the Ringwraiths can be considered among the first and most\npowerful Númenóreans who were corrupted by Sauron, 1000 years before the\nDownfall: they served Sauron, being enslaved to his will, having become\nso because of their lust for power or knowledge.\n\nThese sacrilegious 'black arts' and 'follies', which arose as a\nconsequence of their worship of 'The Dark' and Melkor, marked the final,\nirrevocable division between the 'King's Men' and the minority known as\nthe 'Faithful' Númenóreans, or the 'Elendili', who kept to their old\nfaith in Ilúvatar. They were also presumably the earliest culture traits\nof those who became known afterwards as Black Númenóreans.\n\nAfter the Fall of Númenor\n\nFor many centuries after the Downfall, descendants of the 'King's Men'\nheld onto colonies in Middle-earth, what became the most northerly and\nfamous of their Realms in Exile, Umbar.\n\nMost of those few Númenóreans who had never disavowed the Eldar, and had\nalways remained true to their belief in Ilúvatar, also survived the\ndestruction of their homeland, and they established their own Realms in\nExile north of Umbar, in familiar and friendly colonies. The Faithful\nNúmenóreans saw their southern counterparts as renegades. The Black\nNúmenóreans held a similarly low opinion of 'The Faithful' and their\ndescendants.\n\nOnly two Black Númenórean lords are named from the time of the late\nSecond Age: Herumor and Fuinur. Like all Black Númenóreans and 'King's\nMen' before them, Herumor and Fuinur desired power over men of other,\n lesser races, and they “rose to (great)\npower amongst the Haradrim”, the peoples neighbouring Umbar. Their fate\nis unknown, but they were likely defeated along with Sauron at the War\nof the Last Alliance of Elves and Men.\n\nThird Age\n\nThe Black Númenórean style of rule was no doubt tyrannical, but may also\nhave involved a tradition of duumviracy, at least in Umbar, whose lords\nare usually paired when mentioned; Herumor/Fuinur for example, were\nprobably rulers of Umbar, as much later Angamaitë/Sangahyando were.\nWhatever political system was in place, however, the Black Númenóreans\ndid not govern effectively.\n\nThe triumph of the Last Alliance marked the decline of the Black\nNúmenórean race and the end of their racial superiority. Nevertheless,\nthe Black Númenórean elite survived at least in Umbar for over a\nthousand years after Númenor's fall, maintaining much influence in\nHaradwaith. As late as Angamaitë for example, even after being exiled\nfrom their homeland for nearly a century.\n\nBlack Numenoreans in the 3rd age eventually joined The Witch King of\nAngmar in his conquests of Arnor. The fate of the Black Numenoreans of\nAngmar is unknown, but it's most likely they either all died or\ndisbanded after the Battle of Fornost.\n\nThe Black Númenóreans did not use Westron, but probably retained their\nold tongue Adûnaic, speaking a dialect of it. (In The Notion Club\nPapers, part of Sauron Defeated, Arundel Lowdham cited two descendants\nof classical Adûnaic. One of these must have been Westron, the other the\ntongue of the Black Númenóreans (Black Adûnaic?).\n\nThe Black Númenóreans are absent from recorded history after their\ndefeat by Ciryaher in TA 1050, but a  population of sorts must have survived somewhere at least\nuntil the end of the Third Age, as the Mouth of Sauron, who mocked the\narmy of King Elessar in front of the Black Gate was described both as a\nBlack Númenórean and “Renegade”, which is presumably the term used by\nthe Free Peoples of that time to describe all folk of similar ancestry.\n\nIn one of his letters, Tolkien wrote that Queen Berúthiel, wife of\nGondor's King Tarannon Falastur was a Black Númenórean, from a Black\nNúmenórean realm he describes as “the inland city” somewhere south of\nUmbar. This was a loveless union, and was presumably a political\naccommodation: that such arrangements were possible implies the\nexistence at that time of more Gondor-friendly Black Númenóreans than\nthe much later Mouth of Sauron.",
    "other_names": "Black Númenóreans",
    "dominions": "Númenor (at first)\nThen Umbar, Angmar, Harad, & other southern lands",
    "languages": "Adûnaic, Westron, Black Speech",
    "lifespan": "Regular Númenórean lifespan: 300-350 years",
    "origins": "Númenóreans seduced by Sauron",
    "rivalries": "Gondorians",
    "gallery": "IMAGES OF BLACK NÚMENÓREANS",
    "affiliation": "Sauron",
    "locations": "Primarily Umbar, other southern lands",
    "members": "Herumor, Fuinur, Berúthiel, The Mouth of Sauron"
  },
  {
    "title": "Avari",
    "page_id": "905",
    "text": "The AVARI were a branch of the Elves in Middle-earth.\n\n\nHistory\n\n\n\nWhen Oromë found that Elves that awakened in Cuiviénen, he invited them\nto come with him to Valinor. All the Minyar and most of the Tatyar and\nNelyar were persuaded and followed Oromë into the west on the Great\nJourney. The remainder of the Tatyar and Nelyar remained suspicious of\nthe Lords of the west, seeing them only in their wrath, or they simply\nrefused to depart from their own lands, and spread gradually throughout\nthe wide lands of Middle-earth. They were after known in Quenya, the\nlanguage of the Eldar that eventually reached Valinor, by the name\n_Avari_, meaning “the Unwilling”, because they refused the summons.\n\nHaving never come to Valinor, the Avari remained wild folk, dwellers of\nforests. Little is known of them, as they do not appear in any of the\ntales, save some references to Avari creeping in the south of Beleriand\nin the First Age. Some of them merged with the Nandor and Sindar in\nEriador and the Vale of Anduin. Also, it is speculated that the Dark\nElves were the first other sentient race encountered by the race of Men\nduring their infancy. The Dark Elves probably taught them many of the\nbasic crafts of civilization, though the craft of the Eldar surpassed\nthat of the Avari even more than that of the Avari surpassed primitive\nMen.\n\nIn _The War of the Jewels_, names of six tribes of Avari in their own\nlanguages are given, all being cognates of the Quenya word Quendi (_the\nSpeakers_): KINDI, CUIND, HWENTI, WINDAN, KINN-LAI, PENNI. They are the\nonly certain Avarin words ever mentioned in the published Middle-earth\nmaterial. It is speculated however that Dorwinion was an Avarin land,\nwith WINION carrying the meaning of “Wine”.\n\nThe Silmarillion contains a suggestion that orcs may be descended from\nAvarin elves captured and corrupted by Melkor.\n\nEöl was called the 'Dark Elf' for he shuns the daylight, preferring to\nstay within the dark woods of Nan Elmoth and walk under the moon and\nstarlights but he is not of Avari origin for he is a kin of Thingol. His\nroots lies with the Teleri, who did not go to Aman, later called the\nSindarin under the rule of Thingol and Melian the Maia.\n\n\nOther versions of the legendarium\n\nIn older versions of the legendarium, the name _Avari_ was originally\nthat of the later Eldar, then meaning “those that departed”.\n\nIn other, relatively late writings, a brief idea was that the Avari did\nnot come from the three clans, but from two other clans, led by Nurwë\nand Morwë. This idea was later dropped. In the final conception, the\nelves were divided into three tribes.",
    "other names": "Dark-elves, the Unwilling",
    "origins": "Elves who refused to make the Great Journey",
    "members": "Possibly Morwë, Nurwë",
    "languages": "Avarin languages",
    "gallery": "IMAGES OF AVARI",
    "locations": "Cuiviénen, Taur-im-Duinath, Rhûn, Eriador, Vales of Anduin",
    "skin color": "White",
    "lifespan": "Immortal"
  },
  {
    "title": "Dunlendings",
    "page_id": "916",
    "text": "DUNLENDINGS, also known as\nWILDMEN OF DUNLAND, were the people of Dunland. They were known as a\nfierce culture of Men who sought vengeance on the people of Rohan who,\nas Saruman rightly said, drove them into the mountains. In _The Two\nTowers_, Saruman used their anger to manipulate and convince them to\ndestroy the land of Rohan during the War of the Ring. He sends them\nacross Rohan, burning and looting the land.\n\nDunlending Wildmen come from the land of Dunland. When looting Rohan\nearlier in the Third Age, they are led by a Dunlending named Wulf son of\nFreca.\n\n\nHistory\n\n\n\nIn the years of the Second Age before the Númenóreans settled in\nMiddle-earth, the tribal Hill-men inhabited the lands west and south of\nthe Misty Mountains, as far down as the valleys surrounding the White\nMountains.\n\nWary of the men who came out of the west, they came to fear and hate\nthem. They were hunted and persecuted in such numbers that they had\ndwindled by the start of the Third Age. At this time they had come to\ncongregate in the valleys of the White Mountains and the grassy plains\nof Dunland, which lay west of the Misty Mountains between Moria and\nIsengard; a few went north, and became the ancestors of the Men of Bree.\nDunland then became the area most populated by these men, who came to be\ncalled Dunlendings.\n\n\n\nWhen Eorl and his people were granted Calenardhon --- Rohan, as it would\nlater be known --- in TA 2510, they drove the Wild Men from their new\nlands, earning their bitter hatred and enmity. The Wild Men were also\ndriven from the White Mountains by the Men of Gondor. During the next\nfive hundred years these shorter, dark-haired warriors made frequent\nattacks upon the outlying settlements of Rohan, exacting revenge upon\nthe usurpers, whom they called “straw-heads” because of the high number\nof blond warriors among them.\n\nAs a consequence, Rohan maintained patrols and garrisons to the west of\nthe Fords of Isen to try to limit the number of raids, although these\npatrols had virtually disappeared under Wormtongue's stewardship, to the\npoint where Saruman's forces could make incursions almost at will.\n\nYet not everybody took against the Wild Men. At some point near the end\nof the thirtieth century of the Third Age, Saruman made contact with\nthem and swayed them to his side by playing on their resentment and\nhatred of those who had taken what was theirs.\n\nSaruman welcomed to Orthanc a large warband of these Dunlendings.\nSaruman evidently convinced them that they could reclaim what had been\ntaken, and during the early part of TA 3019, a fearsome raiding force\ncomprising Dunlendings, Orcs and Uruk-hai left Isengard and began\nravaging the western settlements of Rohan. Previous attacks by Orcs and\nUruk-hai had killed many Rohirrim at the Fords of Isen, so there were no\nwarriors to defend against the surprise attack.\n\n\n\nMany people of Rohan were killed in these attacks, but the raiders never\nmade it across the country to Edoras; it is fair to assume that they\nencountered one or more Éoreds, companies of mounted warriors, who would\nhave been patrolling the interior. After the defeat of Isengard at the\nBattle of the Hornburg, the Rohirrim spared the surviving Dunlendings\nand used them as workmen to repair the broken walls of the Hornburg.\n\nThe Rohirrim's mercy surprised the Dunlendings, as Saruman had convinced\nthem the Rohirrim would slaughter them all if given the chance. When\nGandalf, Frodo Baggins, Sam Gamgee, Merry Brandybuck, and Pippin Took\nwere traveling through Dunland on their way back towards the the Shire,\nthe Dunlendings in that area hid from them. After the War of the Ring,\nthe Dunlendings sent ambassadors to the court of King Aragorn, thus\nfinally began peace and diplomacy between Gondor and Rohan with the\nDunlending realms.\n\n\n\n\nCulture\n\nThe Dunlendings were hill-folk used to living in harsh conditions, often\nseen in leather garb and fur cloaks. They may have been related to the\nSnowmen of Forochel in the north. They were a tough, hardy people, big\nand powerful with long, unkempt hair and beards. The Dunlendings,\nbecause they lived in the hilly and forested area of Dunland, most\nlikely hunted, foraged, and fished for food, with agriculture being a\nlesser form of food production.\n\nThe Dunlendings, due to their way of life, probably were very skilled\nwith bows. Dunlendings are also described as using cavalry at the Fords\nof Isen. Most Dunlendings probably fought, however, on foot, with long\nspears, axes and other melee weapons (as with most self-arming forces,\nswords were expensive and therefore a rarity).  Armour for most soldiers\nwas light, but well-off warriors and chieftains likely made use of\nchainmail and were clad similarly as their Rohirrim counterparts.\n",
    "other_names": "Dunlenings, Wild Men",
    "dominions": "Dunland",
    "rivalries": "Rohan",
    "languages": "Westron, Dunlendish",
    "notable_members": "Freca, Wulf",
    "lifespan": "Short to average (around 30-50 years) [_citation\\ needed_]",
    "distinctions": "Minimalistic clothes, tanned, barbaric, bitter [_citation\\ needed_]",
    "height": "Generally tall, shorter than Dunadain on average",
    "skin_color": "Tanned ruddy to olive brown, “swarthy” [_citation\\ needed_]",
    "hair_color": "Brownish, dark, black, grayed, auburn, red [_citation\\ needed_]",
    "locations": "Dunland",
    "members": "Squint-eyed Southerner, Freca, Wulf",
    "hair color": "Dark",
    "skin color": "Dark",
    "gallery": "IMAGES OF DUNLENDINGS"
  },
  {
    "title": "Wood-elves",
    "page_id": "933",
    "text": "WOOD-ELVES, or SILVAN ELVES, were a class of Elves that lived near the\nBlue Mountains. They were added to the number of High Elves, and they\nshared the lands with the Dwarves.\n\nThe best known Wood-elves are the Elves of the Woodland Realm in\nNorthern Mirkwood and Lothlórien. In the First Age the elves of\nOssiriand, the Laiquendi, were also referred to as Wood-elves.\n\nSilvan Elves were of Nandorin descent but they were mainly governed by\nSindar and Noldorin rulers. Examples of such rulers were Thranduil, the\nKing of the Woodland Realm in Northern Mirkwood, Amdír and his son,\nAmroth, who ruled over Lothlórien, and Celeborn, who too ruled over\nLothlórien with his wife Galadriel who was a Ñoldor elf.\n\nSilvan Elves were considered to be less wise than other Eldar, but were\nmore wise than men. Some of them were almost indistinguishable from the\nAvari, those who never joined the Great Journey.\n\nMirkwood\n\nThe Silvan Elves of Mirkwood (formerly known as Greenwood the Great)\nwere known to be distrustful of Dwarves but friendly to Men, with whom\nthey trade. Mirkwood had been called Greenwood the Great until around\nthe year TA 1050, when the shadow of the Dark Lord Sauron fell upon it,\nand men began to call it Mirkwood. During his journey to the Lonely\nMountain, Bilbo Baggins had to rescue the Dwarves of Thorin II\nOakenshield's company from these Elves. These Elves were also one of the\narmies in the Battle of the Five Armies.\n\nLegolas of the Fellowship of the Ring, although he lived among them and\npresented himself as one of the Silvan folk, was not one of them. As a\nson of the Elven-king Thranduil, who had originally come from Doriath,\nLegolas was actually at least half of Sindarin heritage on his father's\nside (his mother's identity is unknown, though it is likely she was of\nSilvan background). This was complicated by the fact that a small\nminority of Sindarin Elves ruled the predominantly Silvan Woodland Realm\nof Northern Mirkwood, a minority to which Legolas belonged. The Sindarin\nminority in that realm, who should have been nobler and wiser than the\nSilvan Elves, could be seen as having “gone native” at the end of the\nFirst Age after Morgoth was defeated and all the grand elf kingdoms of\nBeleriand were destroyed.\n\nIn the cartoon version of _The Hobbit_, they have been depicted as\nhaving green skin and brown clothes which were very primitive in\ncomparison to the other elves portrayed in the movie.\n\n\n\nLórien\n\nThe Silvan Elves of Lórien were known as part of the Galadhrim,\nliterally “tree-folk”. However, the Galadhrim of Lorien also included a\nmixture of elves of Nandor, Noldor, and Sindar descent. Galadriel was of\nNoldor descent, being the daughter of Finarfin, while Celeborn was of\nSindarin descent of the Kingdom of Doriath. At the time of the War of\nthe Ring they spoke an accent or dialect of Sindarin which had changed\nso much that Frodo Baggins, who spoke Sindarin, could not understand\nthem. Additionally, few Elves of Lórien could speak Westron, so that\nHaldir, one of the few that could, had to accompany them on their way to\nCaras Galadhon. Haldir has been speculated to be a Sindarin Elf, but\nthere is no absolute evidence to confirm this. The only evidence is that\nhe shares the white blond hair of Thranduil and Legolas, who themselves\nare Sindarin.",
    "other names": "Wood-elves",
    "origins": "Teleri who fell away from the Great Journey",
    "locations": "Belfalas, Lothlórien, Mirkwood, Ithilien",
    "affiliation": "Last Alliance of Elves and Men",
    "rivalries": "Dwarves",
    "languages": "Silvan Elvish, Sindarin, Westron",
    "members": "Nimrodel, Mithrellas, Galion, Haldir, Rúmil, Orophin",
    "lifespan": "Immortal",
    "distinctions": "Secretive, lovers of the forests and animals, less wise than other Eldar",
    "gallery": "IMAGES OF SILVAN ELVES"
  },
  {
    "title": "Nandor",
    "page_id": "906",
    "text": "The NANDOR (Quenya; IPA: ; singular NANDO; ) were Elves of Telerin\ndescent, who left the Great Journey from Cuiviénen to Valinor as the\nElves reached the Misty Mountains.\n\n\nHistory\n\nThe Nandor began under the Teleri Elf Lenwë or _Dan_ in their language,\nwho led a group that turned south along the river Anduin, and\ndisappeared from written history. _Nandor_ eventually became their term\nfor themselves, and meant _people of Dan_ in their own language. Many\nyears later a group of Nandor under Denethor, son of Lenwë, hearing of a\ngreat Elven realm crossed the Blue Mountains into the Ossiriand, which\nwas after named Lindon, or _Land of the singers_, after these elves.\nAfter their settlement, they became known as the Laiquendi, the Green\nElves.\n\nIn later years, the Silvan Elves of Mirkwood and Lothlórien were\ndescended from the Nandor (but most of their lords were not), as were\nthe elves which dwelt at Edhellond near Dol Amroth during the early days\nof Gondor.\n\n\nLanguage\n\nThe original Nandorin language gradually disappeared from Middle-earth\nafter the end of the First Age, when Sindarin Elves merged with the\nSilvan folk and were taken as their lords. Nandorin/Silvan gradually\nbecame extinct, surviving only in placenames such as\n“Laurelindórinan/Lindórinand” (old names for the land of Lórien) and\nproper names such as Amroth. The daily tongue of the Silvan elves became\nSindarin, or Sindarin with some Silvan influences.\n\n\nEtymology\n\nNandor is likely a Quenyan word that meant 'those who turn back'",
    "origins": "Teleri who turned aside from the Great Journey east of the Misty\nMountains",
    "locations": "Vales of Anduin, Ossiriand, Edhellond, Lothlórien, Mirkwood",
    "languages": "Nandorin, Sindarin",
    "members": "Lenwë, Denethor, Nimrodel",
    "lifespan": "Immortal",
    "distinctions": "Secretive, lovers of the forests and animals",
    "average height": "Tall",
    "hair color": "Usually dark",
    "skin color": "White or olive",
    "gallery": "IMAGES OF NANDOR"
  },
  {
    "title": "Silvan Elves",
    "page_id": "932",
    "text": "SILVAN ELVES (also known as '''Woodland Elves ''') are a subgroup of\nthe Nandor, and are thus ultimately of Telerin origin. As Úmanyar, they,\nlike the Sindar, began the Great Journey but did not complete it. In the\nThird Age, most remaining Silvan Elves lived either in Lothlórien or the\nWoodland Realm.\n\n\nHistory\n\nOrigin\n\nThe Silvan Elves were of Nandorin background, descended from the\nfollowers of Lenwë, who were fascinated by the landscape East of the\nMisty Mountains and afraid to attempt to cross them. They thus abandoned\nthe Great Journey, choosing instead to remain in those wide forests,\nwhere they became a scattered people.\n\nLittle is known of the wanderings of the Nandor, save that they spread\nthroughout the Vales of Anduin over a period of many centuries, some\nfollowing the Great River southward, eventually settling at the Mouths\nof Anduin or instead turning north again into Eriador, where eventually\nDenethor gathered as many as he could and crossed the Blue Mountains\ninto Beleriand. These were later known as the Green-Elves of Ossiriand,\nand were welcomed by Thingol as long lost kin.\n\nSome of the Nandor however stayed in the forested Vales, and these would\nbecome the Silvan Elves - hidden away in their woodland fastnesses and\nwere to their estranged kin hardly distinguishable from the Avari, and\nindeed sometimes living in friendship with them. Their language had\ndiverged to such an extent that it was barely intelligible to the Sindar\nand Noldor when these met the Silvan Elves again in the Second Age,\nthough the languages were found to be obviously related. It was not\nuntil this renewed contact between the kindreds and the guidance of the\nSindar and Noldor that the Silvan Elves again became an organised people\nand increased in wisdom. This however also led to the Silvan tongue\nbeing largely forgotten, Sindarin instead becoming the primary spoken\nlanguage by the end of the Third Age, with the Silvan dialects only\nsurviving in several names of places and persons. \n\nThe renewed contact was caused by the destruction of Beleriand after the\nWar of Wrath, for when the Second Age was young, the Silvan Elves\nwelcomed those survivors of the calamity who rather than crossing the\nSea rejoined their kindred east of the Misty Mountains. Indeed soon\nmany of the Silvan Elves came to be ruled by these Sindar refugees,\nprimarily in Lothlórien and the Woodland Realm.\n\nThe Woodland Realm\n\nThe primarily Silvan Elves of Mirkwood were known to be distrustful of\nDwarves but friendly to Men, with whom they traded. Mirkwood had been\ncalled Greenwood the Great until around the year TA 1050, when the\nshadow of the Dark Lord Sauron fell upon it, and men began to call it\nMirkwood. During his journey to the Lonely Mountain, Bilbo Baggins had\nto rescue the Dwarves of Thorin II Oakenshield's company from these\nElves. These Elves sent hosts to both the War of the Last Alliance\nand the Battle of the Five Armies.\n\nLegolas of the Fellowship of the Ring, although he lived among them was\nnot truly one of the Silvan folk. As a son of the Elven-king Thranduil,\nwhose father Oropher had originally come from Doriath, Legolas was\nlikely actually at least half of Sindarin heritage on his father's side\n(his mother's identity being unknown).\n\nIt is important to note that while by the end of the Third Age, Sindarin\nhad become the primary language of the Woodland Realm, Silvan being\nalmost completely forgotten, that in the early years of the Sindarin\nrule over the Silvan Elves here, the Sindar for a time “deliberately”\nadopted the language and customs of the Silvan Elves, as “they wished to\nreturn to the simple life natural to the elves before the invitation of\nthe Valar had disturbed it”. \n\nLórien\n\nThe Silvan Elves of Lórien were the larger part of the Galadhrim or the\nTree-people, who were a mixture of elves of Nandor, Noldor, and Sindar\ndescent. Most of the Sindar that came to Lórien were refugees from\nBeleriand, arriving early in the Second Age, and the Sinda Amdír became\nthe King of Lórien. After Amdír was killed in the Battle of Dagorlad,\nhis son Amroth became King.\n\nAfter the destruction of Eregion, they were joined by many Sindarin\nspeaking Noldor, led by Galadriel and Celeborn, who fled to Lórien\nthrough Moria. Galadriel was of Noldor descent, being the daughter of\nFinarfin, while Celeborn was of Sindarin descent of the Kingdom of\nDoriath. When Amroth was lost in the Third Age, Galadriel and Celeborn\nbecame known as the Lady and Lord of Lórien, but neither of them took\nthe vacant Kingship.\n\nAt the time of the War of the Ring they spoke an accent or dialect of\nSindarin which had changed so much that Frodo Baggins, who spoke some\nSindarin, could not understand them. Additionally, few elves of Lórien\ncould speak Westron, so that Haldir, one of the few that could, had to\naccompany them on their way to Caras Galadhon.\n",
    "other names": "Wood-elves",
    "origins": "Teleri who fell away from the Great Journey",
    "locations": "Belfalas, Lothlórien, Mirkwood, Ithilien",
    "affiliation": "Last Alliance of Elves and Men",
    "rivalries": "Dwarves",
    "languages": "Silvan Elvish, Sindarin, Westron",
    "members": "Nimrodel, Mithrellas, Galion, Haldir, Rúmil, Orophin",
    "lifespan": "Immortal",
    "distinctions": "Secretive, lovers of the forests and animals, less wise than other Eldar",
    "gallery": "IMAGES OF SILVAN ELVES"
  },
  {
    "title": "Haradrim",
    "page_id": "979",
    "text": "The_' Haradrim, KNOWN IN WESTRON AS THE Southrons_' and once as the\n“SWERTINGS” by Hobbits, were a race of Men from Harad in the region of\nMiddle-earth directly south of Gondor. A part of the histories of the\nWestlands is given to the fierce people who in the Second and the Third\nAge of the Sun, came from the hot deserts and forests of sunlands, which\nlay in the South of Middle-earth. These people were ruled by many and\nlords, until in time Sauron the Maia corrupted them and called them to\nwar.\n\n\nHistory\n\nDuring the Second Age the Men of Númenor built a great city in the firth\nof Umbar, a vast natural harbour on the southern shores of the Bay of\nBelfalas, eventually turning the city into a fortified citadel from\nwhose gates the Men of Númenor could levy great tributes upon many of\nthe tribes of Harad.\n\nFor many years, the Haradrim were the greatest enemy of Gondor. Several\ntimes, they invaded the north. Finally, the Men of Gondor were able to\ncapture Harad, though it was later freed. During the War of the Ring the\nHaradrim were allied with Sauron. A Haradrim warrior wounded Faramir. At\nthe Battle of the Pelennor Fields, the 18,000 Haradrim were a great\nthreat to the Rohirrim that had come to aid the people of Minas Tirith.\nDuring the onslaught a Haradrim chieftain, who bore the standard of a\nblack serpent on a scarlet field, led the Haradrim cavalry. King Théoden\nof Rohan slew him in single combat.\n\nOnce Sauron was destroyed, the Haradrim, Variags, and Easterlings\ndisbanded from the Black Gates and out of Mordor, and became dispersed.\n\n\nEtymology\n\nThe name _HARADRIM_ means “South-people”, from the Sindarin _harad_\n(“south”) and _rim_ (“host, group”).\n\nOther names were SOUTHERNS, SOUTHRONS.\n\n\nTraits and culture\n\nThe Haradrim were bold and grim men, fierce in despair. They were tall\nand dark-skinned with black hair and dark eyes, and for that they were\ncalled SWERTINGS or SWARTHY MEN. The men of Near Harad were\nbrown-skinned, with black hair and dark eyes, while the race known as\n“half-trolls” out of Far Harad had black skin.\n\nMany Haradrim warriors were seen in bright clothing, such as scarlet\nrobes, and were decorated with golden ornaments, such as collars,\nearrings, corsets of overlapping brazen plates; they braided their hair\nwith gold. Some tribes painted their bodies. Scarlet and red was also\nthe color of their banners, tips of their spears, and body paint. Their\nshields were yellow and black with spikes. It is also mentioned that\nat the end of the Second Age some of the Men in the south had weapons of\niron. At the Battle of the Pelennor Fields, the Haradrim bore\nscimitars that glittered like stars.\n\nThe Haradrim had tamed the massive _Mûmakil_ beasts and used them in\nwarfare and, like their masters, were decorated with scarlet and gold.\nThey even strapped towers on their backs, used by Haradrim archers and\nspearmen.\n\nHarad's tribes included into those of Near and Far Harad, although there\nwere many tribes of the Haradrim, often mutually hostile. Some of the\npeoples of Far Harad were organized into kingdoms.\n\nLanguage\n\nTo the Gondorians their voices sounded harsh, like shouts of beasts.\n\nThe only word which is stated to come from a southron language is\n“Mûmak”, the name of the great war-oliphaunts of Harad.\n\nGandalf states that his name in “the south” is “Incánus” thought\n_Inkā-nūsh_ (or possibly _Inkā-nūs_), meaning “North-spy”.\n\nDespite having a meaning in Quenya (“fate”), the name Umbar is said to\nbe adapted from the natives' language and not from Elvish or Adûnaic.\n\n\nEnvironment\n\n\n\nThe lands of the Haradrim lie to the south of Gondor past the river\nPoros. In the land south of Gondor, the sun beat down unrelentingly,\ncooking much of Haradwaith into desert.\n\n\nMilitary Tactics\n\n\n\nThe Haradrim are said to be skilled horsemen, though not near the\nprowess of the Rohirrim. They are known to have mounted champions and\narchers, as well as infantry. Horses fear the Mumakil, and so the\nSouthron forces often rally around them when faced with mounted foes.\n\n\nFuture of Harad\n\nMuch of Harad's impressive army was wiped out on the expanses of\nPelennor Fields, during the Battle of the Pelennor Fields. With Sauron\ndefeated, many Harad peoples sent emissaries to the court of King\nAragorn, and peace talks began; however, many other Haradrim tribes\ncontinued hostility with Gondor.\n",
    "name": "Haradrim, Southrons, Swertings",
    "dominions": "Harad, including Umbar, Near Harad and Far Harad",
    "lifespan": "Shorter than Númenórean",
    "skin_color": "Dark",
    "hair_color": "Dark",
    "pronunciation": "_ha-RAD-rim_",
    "other names": "Southrons",
    "locations": "Harad, including Umbar, Near Harad and Far Harad",
    "affiliation": "Sauron",
    "rivalries": "Gondorians",
    "languages": "presumably numerous; different from Common Speech",
    "members": "Black Serpent",
    "average height": "Tall",
    "hair color": "Dark",
    "skin color": "Dark",
    "weaponry": "Oliphaunts",
    "gallery": "IMAGES OF HARADRIM"
  },
  {
    "title": "Ainur",
    "page_id": "2352",
    "text": "The AINUR, also known as the HOLY ONES, are beings encompassing both the\nValar and the Maiar. They were the first and mightiest beings created by\nEru Ilúvatar in the depths of time before the beginning of the World.\n\nThey were primordial spirits who existed with Ilúvatar, and with him\ncreated the world through the '''Ainulindalë, '''the MUSIC OF THE AINUR.\nAfter the creation of Arda, many of the Ainur descended into it to guide\nand order its growth; of these there were fifteen more powerful than the\nrest. Fourteen of these great Ainur became known as the Valar, or Powers\nof Arda. The fifteenth, Melkor, turned aside from that path and became\nthe first Dark Lord. The many lesser Ainur that accompanied the Valar\ninto Arda are known as Maiar.\n\n\nHistory\n\nOrigin\n\nThe Ainur were the 'offspring of Ilúvatar's thought' and each was given\nunderstanding only of that part of the mind of Ilúvatar from which he or\nshe came. The exception to this was Melkor, a brother in spirit to\nManwë, who later became The Lord of the Valar and he was given some of\nthe parts from which the others had come, but for all his gifts he did\nnot know the full mind of Eru. Melkor and Manwë were the most powerful\nof the Ainur.\n\nThe Ainur were 'kindled with the Flame Imperishable', which can be taken\nto mean that they were granted free will by their Creator. Ilúvatar\ninstructed them in the arts of music, until he brought them together to\nmake the Music of the Ainur: the great song that created the Vision of\nIlúvatar and ultimately the real world. In the beginning of the Music,\nthe Ainur were all in harmony with Eru and one another, but Melkor\nturned instead to his own pride, seeking power for himself and bringing\ndiscord to the Great Music. He later led many of the Maiar astray as\nwell.\n\n\nThe Ainur and the World\n\nThrough the Music of the Ainur, Ilúvatar created a Vision of the World;\nhe showed it to the Ainur, and explained much of its nature and destiny\nto them - the Ainur therefore have much knowledge of the World, but are\nnot themselves omniscient. Ilúvatar then granted the World true being by\ndeclaring “Eä”, causing these visions to come into being. Melkor and\nmany of the other mighty Ainur desired to descend into it and form it in\nreadiness for the coming of the Children of Ilúvatar (that is, Elves and\nMen).  Upon descending into the World, the Ainur became known as the\nValar and the Maiar.\n\nThose Ainur who entered the World and chose to live in it at its\nbeginning remain bound to it until its end. Though Melkor was eventually\nthrown into the Void by the others, he is prophesied to return before\nthe end in the DAGOR DAGORATH, the final battle. Little is known of the\nultimate future of the Ainur, even by themselves, but it is said that\nafter the great battle at the end of the World, they will make a Second,\neven greater Music with the Children of Ilúvatar.\n\n\nThe Line of Melian\n\nAmong the many Ainur who entered the World long ago, there was one of\nthe order of the Maiar named Melian. Alone of all the Ainur, she wedded\none of the Children of Ilúvatar, King Elu Thingol of Doriath, and wove\nthe Girdle of Melian that protected Doriath for many centuries. Through\nher, an essence of the Ainur entered the bloodlines of the Elves and\nMen, passed down through generation after generation, and was still\npresent at the time of the War of the Ring. Elrond was Melian's\ngreat-great-grandson, and Aragorn, too, was her descendant, though\nthrough many more generations than Elrond.\n\n\nEtymology\n\nAINUR is a Quenyan word originating from Valarin and means “Holy ones”.\nIt appears to come from the word AINA, meaning 'holy'. Although the\norigin of the second element '''ur '''is less clear, it is possible\nthere is a link between the word 'Ainur' and the word 'Eru' as the first\nelement 'er' means 'one', though this may not be true as there is no\nfurther elaboration on this.\n\nThe singular form of Ainur is AINU, simply meaning “Holy one”.\n",
    "name": "Ainur",
    "dominions": "All of Arda, then later Valinor and Aman",
    "languages": "Westron, Sindarin, Quenya, Valarin",
    "notable_members": "Manwë, Ulmo, Aulë, Oromë, Námo, Irmo, Tulkas, Varda, Yavanna, Nienna,\nEstë, Vairë, Vána, Nessa, Melkor, Maiar",
    "lifespan": "Immortal",
    "distinctions": "Large, holy, strong, powerful, cunning",
    "height": "Varies",
    "skin_color": "Varies",
    "hair_color": "Varies",
    "origins": "Created from Ilúvatar's thought",
    "locations": "Timeless Halls, Arda, Almaren, Aman",
    "people": "Valar, Maiar",
    "members": "Melkor, Manwë, Ulmo, Varda, Aulë, Yavanna, Mandos, Sauron, Gothmog,\nGandalf, Saruman",
    "gallery": "IMAGES OF AINUR"
  },
  {
    "title": "Vanyar",
    "page_id": "2356",
    "text": "The '''Vanyar '''(Quenya; IPA: ; singular VANYA; adjectival VANYARIN; ),\nalso called the FAIR ELVES, '''Light-elves ''', and 'SPEAR-ELVES'\n, were the first and smallest of the Kindreds of the Eldar. Under the\nleadership of Ingwë, the Vanyar were the first to set forth on the Great\nJourney and the first to reach the shores of Belegaer; they sailed to\nAman on the first voyage of Tol Eressëa and remained there permanently.\n\n\n\nThe Vanyar are the fairest of all the elves hence their name: the FAIR\nELVES. Unlike the others who were attracted to the sea or the building\nand forging of things, the Vanyar culture seemed to revolve about Valar\nand Valinor. This is probably the reason why they choose to stay in\nValinor proper centered around Taniquetil, the seat of the rulers of\nArda, and loved the light of Valinor best of all the other places in\nAman and the wisdom of the Valar, and why they were favored by Manwë and\nVarda and always distrusted Melkor. They are known to have had the\ngreatest skill in poetry of all the Elves, likened to Manwë who loves\nthem for it. Their hair colour was golden and their banners white.\n\nIngwë was their king.\n\n\nHistory\n\nVanyar are descendants of Imin, the first Elf to awake at Cuiviénen, his\nwife Iminyë, and six other pairs of Elves who were awoken by them.\nImin's companions, Tata and Enel, later awoke groups of nine and twelve\npairs respectively, and Imin decided that since his group was now the\nsmallest and each group that he and his companions discovered was larger\nthan the last, he would now choose third rather than first in order to\nmake up the numbers. However, only a further two groups were discovered,\nleaving Imin's group of fourteen by far the smallest of the three Elven\nclans.\n\nWhen the Elves were discovered by Oromë, each clan chose an ambassador\nto return with him to Valinor to verify his claims of its greatness. The\nMinyar (Imin's companions) sent Ingwë. Upon his return, his people were\nswayed by his testimony and adopted him as their king (appropriate, as\nthe name Ingwë means chieftain in Quenya), and he led them with Oromë to\nAman. Ingwë has since been reckoned the High King of all Elves, and\nbecame known as Ingwë Ingweron, the “Chief of Chieftains”, and his\npeople were known by the rest of the Eldar as the Vanyar. In Aman the\nVanyar first dwelt in Tirion. Later, they came to love the full light of\nthe Trees and wandered into Valinor or settled on Taniquetil. He dwells\nwith them on the slopes of Taniquetil, beneath the halls of Manwë.\n\nAfter arriving in Aman, the Vanyar were rarely seen even by other Elves.\nVery few individual Vanyar are named besides Imin, Ingwë, his sister (or\npossibly niece) Indis, and Amarië, who was in love with Finrod Felagund.\n\n☀, Indis, the second wife of Finwë, the High King of the Ñoldor and the\nmother of both Fingolfin and Finarfin, the latter of which founded the\nonly house of Noldorin Elves to sport golden Vanyarin hair. After her\nhusband was killed by Melkor in his attack on Formenos to attain the\nSilmarils , she returned to her people with her daughter Findis.\n\nUnlike the Noldor, the Vanyar loved the light of Valinor so much that\nthey never choose to return to Middle-earth save when many of the Vanyar\nmarched in the War of Wrath with the Host of Valinor. Though they\npreferred the peaceful light of Valinor, the Vanyar were skilled in the\narts of war and were known for their fashioning of spears, thus they\nno doubt fielded a formidable army in the war. Ingwë's son led an armed\nhost of his people from Valinor to fight in the War of Wrath. They\nreturned to Aman, along with most of the Eldar living in the now largely\ndestroyed Beleriand, at the end of the First Age.\n\n\nRelations\n\nGaladriel was the granddaughter of Indis. It is to her Vanyarin blood\nthat Galadriel owes her famous silver-gold hair.\n\n\nEtymology\n\nThe name _Vanyar_ means 'Fair-ones' in Quenya , referring to their\ngolden hair. The Vanyar often called themselves MINYAR; IPA: ; “Firsts”;\nsingular MINYA; adjectival MINYARIN; ), their ancient name. This ancient\nname does not still refer to any of the Avari who remained in\nMiddle-earth, since all of the Vanyar heeded the call of the Valar to\ncome to Valinor.\n\n\nOther Versions of the Legendarium\n\nIn the earliest versions of Tolkien's mythology (see: _The History of\nMiddle-earth_), they were called INGWI, as they were the people of\nIngwë, the High King of the Elves.\n\n\nGallery\n\nImage:Indis the Fair by vigshane.jpg|Indis the Fair, the wife of Finwë,\nthe first High King of the Ñoldor and Queen of the Ñoldor, by Filat\nImage:Amarie of the vanyar by Filat.jpg|Amarie, the love of Finrod, by\nFilat",
    "other names": "_Minyar_, Light-elves, Fair-elves",
    "locations": "Oiolossë; Valmar",
    "languages": "Vanyarin Quenya",
    "members": "Imin, Iminyë, Ingwë, Indis, Elemmírë, Amarië, and others",
    "lifespan": "Immortal",
    "distinctions": "Most revered of the Elven kindreds, loved by Manwë",
    "average height": "Tall",
    "hair color": "Golden",
    "skin color": "Pale",
    "gallery": "IMAGES OF VANYAR"
  },
  {
    "title": "Wainriders",
    "page_id": "2483",
    "text": "The WAINRIDERS were a confederation of Easterling tribes who were united\nby their hatred of Gondor, and stirred-up by the Dark Lord Sauron to\nattack Gondor.\n\n\nHistory\n\nFollowing the Great Plague they started their attacks in TA 1856,\ndefeating the army of Gondor and killing King Narmacil II. They rode in\ngreat wagons and chariots (which gave them their name), and raided the\nlands of Rhovanion, destroying or enslaving its people. Gondor gradually\nlost all of its possessions east of the river Anduin to them. The\nthirtieth King of Gondor, Calimehtar son of Narmacil, defeated the\nWainriders at the Field of Celebrant, buying some rest for his land.\nHowever the Wainriders struck back in 1944, allying themselves with the\nHaradrim of Near Harad and the Variags of Khand. They managed to slay\nking Ondoher and all his heirs, but instead of riding on to Minas Anor\nand taking the city, they paused to celebrate. Meanwhile, general Eärnil\nof Gondor's southern army had defeated the Haradrim and rode north to\ndefend his king. He came too late to rescue Ondoher, but managed to\ntotally defeat the Wainriders. Eärnil was crowned king. After this\ndefeat the might of the Wainriders was broken, and they retreated east.\nThey still held Rhovanion, but never troubled Gondor again. It later\nturned out that their attacks had been staged by Sauron to allow him to\nreclaim Mordor while Gondor's watch was diverted.",
    "origins": "Easterlings",
    "locations": "lands east of and around Rhûn; Rhovanion",
    "languages": "various Easterling tongues",
    "rivalries": "Gondorians"
  },
  {
    "title": "Drúedain",
    "page_id": "2780",
    "text": "The DRÚEDAIN, also known as DRÛGS, DRUGHU, RÓGIN, WOSES, WILD MEN OF THE\nWOODS and PÚKEL-MEN, were a strange race of Men that lived in the\nDrúadan Forest by the Third Age. They were counted amongst the Edain.\n\n\nHistory\n\nThe Drúedain developed a close relationship with the Folk of Haleth, the\nEdain that inhabited that forest region. The Drúedain lived among the\nSecond House of Men, the Haladin, in the First Age in the forest of\nBrethil. There were also a number of the Drúedain present in Númenor,\nthough they had left or died out before the Akallabêth, as had the\nPúkel-men of Dunharrow. At the end of the Third Age, the Drûg still\nlived in the Drúadan Forest of the White Mountains, and on the long cape\nof Andrast west of Gondor. The region north of Andrast was still known\nas Drúwaith Iaur, or “Old Drûg land”.\n\nThe Woses of Ghân-buri-Ghân held off Orcs with poisoned arrows and were\nvital in securing the aid of the Rohirrim in the Battle of the Pelennor\nFields. After the War of the Ring, King Aragorn II Elessar granted the\nDrúadan Forest “forever” to them in the Fourth Age, promising that no\nman would enter their forests without the leave of the Drúedain.\n\n\nPhysical characteristics\n\n\n\nThey were an alien folk to the other Men: a bit like Dwarves in stature\nand endurance, stumpy, clumsy-limbed (with short, thick legs, and fat,\n“gnarled” arms), had broad chests, fat bellies, and heavy buttocks.\nAccording to the Elves and other Men, they had “unlovely faces”: wide,\nflat, and expressionless with deep-set black eyes that glowed red when\nangered. They had “horny” brows, flat noses, wide mouths, and sparse,\nlanky hair. They had no hair lower than the eyebrows, except for a few\nmen who had a tail of black hair on the chin. They were short lived and\nhad a deep hatred of Orcs. Their characteristics may have originated in\nthe First Age. People who didn't know them very well may have thought\nthat Morgoth may have captured some men as they did with the elves and\nbred Orcs from their stock leading to the conclusion that the Drúedain\ncould have possibly been Men that escaped, but were more deformed but\nnot very Orc-like. Evidence for this is that both they and Orcs consider\neach other renegades. They were known to have certain magical powers and\nto be still in meditation for long periods of time.\n\n\nEtymology\n\nOther names\n\n-   DRÛG/DRUGHU: (singular and plural) is the name the Drúedain give to\n    themselves in their own language and the name used for a race known\n    to the Elves as the Drúedain, and to Men.\n-   DRÚATH: (plural) was an earlier Sindarin name for them in ancient\n    times.\n-   RÓG/RÓGIN: (singular and plural) is the name that the Rohirrim have\n    for them in their own language.\n-   RÚ/RÚATANI: (singular and plural) is their name in Quenya.\n-   WOSE/WOSES: (singular and plural) was a word Tolkien took from an\n    Old English word, which was meant to be a translation of the\n    Rohhirric 'Róg'.\n-   OGHOR-HAI: (singular and plural) is the name the Orcs gave to\n    them.\n\nOrigin\n\nTolkien got this term from the legendary Woodwoses of European myths.",
    "name": "Drúedain",
    "dominions": "Númenor\n\nBrethil\nDrúadan Forest\nDrúwaith Iaur",
    "notable_members": "Ghân-buri-Ghân, Aghan",
    "lifespan": "Short-lived for Men",
    "height": "Short",
    "skin_color": "Dark",
    "hair_color": "Dark",
    "pronunciation": "_DROO-eh-deyen_",
    "other names": "Woses, Wild Men",
    "locations": "Brethil, Númenor, Drúwaith Iaur, Drúadan Forest",
    "distinctions": "Good stoneworkers, mysterious powers, glowing red eyes",
    "languages": "Drúadan language",
    "average height": "Short",
    "hair color": "Dark",
    "members": "Aghan, Ghân, Ghân-buri-Ghân",
    "gallery": "IMAGES OF DRÚEDAIN"
  },
  {
    "title": "Men of Gondor",
    "page_id": "2834",
    "text": "'''Men of Gondor '''were the Edain descended from the Númenórean\ncolonists (and from their noble kin who escaped the destruction of\nNúmenór in SA 3319) who settled in the southern land of Gondor\nthroughout most of the Second Age\n\nThe DÚNEDAIN OF GONDOR were the descendants of the Exiles of Númenor who\nsettled in the southern lands of Middle-earth, and founded the southern\nkingdom of Gondor. Their first independent King was Meneldil, the nephew\nof Isildur, whose line ruled over Gondor for more than two thousand\nyears. Unlike their cousins in the North, the Dúnedain of the South\nmaintained their realm even after the loss of its Kings, and it survived\nunder the rule of the Stewards until the time of the War of the Ring,\nwhen the Kingship was restored.\n\n\nDescription and Historical accounts\n\nBeing mostly of Númenórean stock and ruled by exiled Númenórean\noverlords, the Men of Gondor continued most of the customs and\ntraditions of Númenór. However, over the centuries, they mixed more and\nmore with the men of Middle-earth. One of these peoples was the Northmen\nwho lived in Rhovanion, and Gondor, ever needing allies, began\nacquainting themselves with these men by the mid Third Age. Brave and\nvaliant, but by the standards of the Dúnedain shorter lived, the\nNorthmen gradually had more and more to do with Gondor, and one of its\nheirs to the throne, Valacar, who lived and worked with them in their\nown land as an ambassador, married one of their noble ladies, setting\nthe stages for the Kin-strife. \n\nOver the next few hundred years afterward, war, rebellion, and plague\nseverally weakened the blood of the Dúnedain in Gondor. Their rulers\nthough survived and retained many of the ancient customs. As the\ncenturies rolled on into the late Third Age, the Men of Gondor\naccustomed to war and invasion became a hardy and stern people more\nlikened to Middle-earth. They became summed up in the phrase, “when\nheads are at a loss, bodies must serve.”\n\nBy the time of just before War of the Ring, the Men of Gondor grappled\nconstantly with the forces of Mordor giving and regaining ground to the\nDark Lord's armies. Their leader Denethor II could foresee nothing but a\nvictory in single combat on the battlefield against him or total doom,\nso when it became clear that Sauron's lost Ring of Power had been found,\nhe and people like his son and others wanted the Ring to be taken by\nGondor and be used against the enemy as a weapon. The Men of Gondor were\nspared the folly of this choice when Denethor's youngest son Faramir let\nFrodo and Sam continue to Mount Doom to destroy the One Ring.\n\nAfter the war was won and Aragorn II Elessar was crowned, the Men of\nGondor were rekindled with the ancient tradition of the Dúnedain of old\nwhen Elendil founded the Two Kingdoms with his two sons: Isildur and\nAnárion. They thrived and prospered as part of the Reunited Kingdom into\nFourth Age and beyond.\n\n\nNotable Men of Gondor\n\nImage:Seanbean boromir.jpg|Boromir Image:Faramir3.jpg|Faramir\nImage:Denethor.jpg|Denethor II",
    "other_names": "Men of Gondor",
    "dominions": "Gondor",
    "languages": "Gondor Sindarin\nWestron",
    "members": "Denethor\nBoromir\nFaramir",
    "lifespan": "80-110 years",
    "height": "Average"
  },
  {
    "title": "Fallohides",
    "page_id": "2850",
    "text": "The FALLOHIDES are one of the three races of Hobbits.\n\n\nHistory\n\nThe Fallohides were the least common of Hobbits, and in their earliest\nknown history they lived in the forested region where later was the\nEagles Eyrie near the High Pass to the north, in the Vale of Anduin. To\ntheir south lived the far more numerous Harfoots, and far south in the\nGladden Fields lived the Stoors.\n\nThe Fallohides were fair of skin and hair, and none of them ever grew a\nbeard. They were great lovers of the trees and forests, and skilled\nhunters. Many of them were friends with the Elves, and because of this\nthey were more learned than the other Hobbits. They were the first to\nlater learn Westron, and the only ones to preserve some of their old\nhistory. They learned Westron from the Men of Arnor, and it was they who\nfirst learned writing.\n\nAfter the Harfoots had migrated westward in the years following TA 1050,\nthe Fallohides followed them around TA 1150. Unlike the Harfoots they\ncrossed far north of Rivendell, and from there later met up with the\nHarfoots. The Fallohides were more bold and adventurous than the\nHarfoots, and many of them became leaders of the Harfoot villages. It\nwas probably under Fallohide rule that the Harfoots migrated westward\nbeyond Weathertop and reached Bree. In TA 1601 two Fallohide brothers,\nMarcho and Blanco, by permission of Argeleb II, the King in Fornost\ncrossed the Brandywine River and colonized the Shire.\n\nAfter this, the Fallohides mixed more and more with the Harfoots and\nlater the Stoors, until the three Hobbit races became one. The\ninfluential Took clan had distinct Fallohide traces both in appearance\nand character, as did the _Oldbuck_ and later Brandybuck clan. Both\nBilbo Baggins and Frodo Baggins were part Fallohide, due to their Took\nand Brandybuck mothers respectively. Other famous Fallohides included\nBandobras Bullroarer Took, who slew an Orc leader, and Peregrin Took as\nson of the Thain was a Fallohide.",
    "locations": "Upper Anduin, Bree, The Shire",
    "languages": "Hobbitish, Westron",
    "members": "Marcho, Blanco, the Bolgers, the Tooks, the Brandybucks",
    "lifespan": "c. 96 years",
    "distinctions": "Least numerous of the three branches of hobbits",
    "average height": "Taller than the other hobbits",
    "hair color": "Fair",
    "skin color": "Fair"
  },
  {
    "title": "Harfoots",
    "page_id": "2853",
    "text": "The HARFOOTS are one of the three races of Hobbits.\n\nHarfoots were the most common type of Hobbits, and in their earliest\nknown history they lived in the lower foothills of the Misty Mountains,\nin the Vale of Anduin, in an area roughly bounded by the Gladden River\nin the south and the small forested region where later was the Eagles\nEyrie near the High Pass to the north.\n\nThey were browner of skin than the other Hobbits, had no beards, and did\nnot wear any footwear. They lived in holes they called _Smials_, a habit\nwhich they long preserved, and were on very friendly terms with the\nDwarves, who travelled through the High Pass on the Great Road.\n\nThe Harfoots were the first to migrate westward into Arnor, and it was\nto them that the name _Periannath_ or _Halflings_ was first applied by\nthe Dúnedain when they were first recorded in Arnorian records around TA\n1050 of the Third Age. They tended to settle down for long times, and\nfounded numerous villages as far as Weathertop.\n\nBy the 1300s of the Third Age they had reached Bree, which long was the\nmost western village of any Hobbits.\n\nThe Harfoots were joined between TA 1150 and TA 1300 by the Fallohides\nand some Stoors. The Harfoots took Fallohides, a bolder race, as their\nleaders.\n\nWhen The Shire was colonized in TA 1601 most of its people were\nHarfoots.\n\nit:Pelopiedi nl:Bruivels pl:Harfootowie ru:Мохноноги",
    "origins": "A group of Hobbits",
    "locations": "Vales of Anduin, Bree, The Shire",
    "languages": "Hobbitish",
    "lifespan": "c. 96 years",
    "average height": "Shorter than the other Hobbits",
    "hair color": "No beards",
    "skin color": "Browner skin",
    "clothing": "No footwear"
  },
  {
    "title": "Stoor",
    "page_id": "2852",
    "text": "The STOORS are one of the three races of Hobbits, they mostly inhabited\nswampy areas.\n\nIn their earliest recorded history the Stoors, like the other Hobbits,\nlived in the Vales of Anduin. They were a riverside people that dwelt in\nthe Gladden Fields, and were fishermen.\n\nOne of the most infamous Stoors was Smeagol, who would later become a\ncreature known as the Gollum.\n\n\nCharacteristics\n\nThey were heavier and broader in build than the other Hobbits, and had\nlarge hands and feet. Among the Hobbits, the Stoors most resembled Men\nand were most friendly to them. Stoors were the only Hobbits who\nnormally grew facial hair.\n\nA habit which set them apart from the Harfoots who lived in the mountain\nfoothills, and the Fallohides who lived in forests far to the north, was\nthat Stoors preferred flat lands and riversides. Only Stoors used boats,\nfished, and could swim. They also wore boots in muddy weather.\n\nStoorish characteristics and appearances remained amongst the Hobbits of\nthe Eastfarthing, Buckland (such as the Brandybucks) and the\nBree-hobbits\n\nThe Stoors also had their own dialect of Hobbitish, owing to the fact\nthat they spent some time in Dunland and adopted many strange words and\nnames which they took to the Shire, and retained even until the late\nThird Age.\n\n\nHistory\n\nThe Stoors are believed to live in the southern vales of Anduin. During\nthe Hobbit Wandering Days, after the Harfoots had migrated westward in\nThird Age 1050, and the Fallohides followed them about a century later,\nthe Stoors long remained back in the vale of Anduin, but between T.A.\n1150 and 1300 they, too migrated west.\n\nUnlike the other Hobbit-kinds they took the Redhorn Pass and followed a\nsouthern route, where many Stoors branched off and moved south to the\nAngle of Eriador, south of Rivendell and mingled with the Harfoots and\nFallohides that lived there; but most went to Dunland (Swanfleet near\nTharbad) which most resembled their old lands. There they came into\ncontact with the Dunlendings. This contact altered their speech\nslightly, mostly by picking up a few Dunlending words.\n\nA hundred years later Angmar began to threaten Eriador and many Stoors\nof the Angle fled south to their kin in Dunland where they became a\nwoodland people; others returned to Rhovanion and settled the Gladden\nFields, becoming riverland people Déagol and Sméagol belonged to (c.\nT.A. 2430). There they had a matriarchal society. What became of\nthose Stoors and whether they rejoined their folk in Eriador, no history\ntells.\n\nThe Stoors of Dunland moved back north to join the other Hobbits in\ncolonizing the Shire about T.A. 1630 and settled mostly in the\nEastfarthing and Southfarthing. The result was that places that were\nsettled by Stoors have some slight linguistic oddities due to their time\nof separation and contact with the Dunlendings. The three original\nHobbit-kinds merged and blended in the centuries since the settlement of\nthe Shire, but regional variations remained.\n\nSome of these villages might have survived until the War of the Ring,\nwhen they were sought out by the Ringwraiths.\n\nHowever, most Stoors fled to the north and west, ending up in the newly\nfounded Shire around 1630. There they mingled with the Harfoots and\nFallohides, becoming the Shire-folk however they predominantly stayed in\nEastfarthing and then migrated to Buckland.\n\n\nEtymology\n\nStoor is supposed to be a special Hobbitish word that did not exist in\nWestron during the War of the Ring.\n\nEarly English stor, stoor means “large, strong”, referring to the fact\nthat these Hobbits were of heavier build",
    "origins": "A group of Hobbits",
    "locations": "Vales of Anduin, Gladden Fields, Dunland, The Shire",
    "languages": "numerous; eventually Hobbitish",
    "members": "Gollum, Déagol",
    "lifespan": "c. 96 years",
    "distinctions": "Heavier and broader than the other Hobbits; large hands and feet; only\nHobbits who normally grew facial hair; used boats, fished, and could\nswim"
  },
  {
    "title": "Longbeards",
    "page_id": "3038",
    "text": "Durin's Folk (Longbeards of the 2nd and 3rd age, one of the seven\n    houses of the Dwarves)\n\n&nbsp;\n-   Indravangs (Indrafangs) (Long Beards of Belegost during the 1st Age,\n    sometimes associated with the Wicked dwarves and Nauglath)",
    "other names": "Longbeards",
    "origins": "Descendants of Durin the Deathless",
    "affiliation": "Last Alliance of Elves and Men",
    "rivalries": "Elves",
    "languages": "Khuzdul, Westron, Sindarin",
    "lifespan": "c. 250 years",
    "members": "DURIN, Thorin, Balin, Dáin Ironfoot, Gimli",
    "distinctions": "Oldest of the Dwarven clans",
    "locations": "Mount Gundabad, Khazad-dûm, Erebor, Grey Mountains, Iron Hills, Blue\nMountains, Thorin's Halls, Glittering Caves"
  },
  {
    "title": "Falmari",
    "page_id": "3226",
    "text": "The FALMARI, also known as the SEA-ELVES, were those of the Teleri who\ndeparted from Middle-earth, migrating into the West where they remained.\n\n\nHistory\n\nOrigins\n\nDuring the Great Journey of the Elves of Cuiviénen, the Teleri had two\nlords: Elwë Singollo and his brother Olwë. While crossing Beleriand,\nhowever, Elwë became lost in the forests, and thus many of the Teleri\nrefused to continue into the West.\n\nWhen Ulmo came to them with an island, the Teleri had come to love the\nsea. The island was brought towards the Bay of Eldamar. They settled on\nTol Eressëa (the former island ferry) and later in Alqualondë, which\nthey built on the shores of Aman between the Calacirya and Araman.\n\n\n\nThe High King of the Falmari was Olwë, and the Princess of the Falmari\nwas Eärwen, Olwë's daughter.\n\nRebellion of the Ñoldor\n\nDuring rebellion of the Ñoldor led by Fëanor, the Sea-elves refused to\njoin the rebellion and to yield their swanships. This led to the\nKinslaying at Alqualondë.\n\n\nEtymology\n\nThe term _Falmari_ means “Wave-folk”, from the Quenya root _fala_\n(“foam”) and the word _falma_ (“wave as it breaks”).",
    "origins": "Teleri who reached Aman",
    "locations": "Alqualondë, Tol Eressëa",
    "languages": "Telerin",
    "members": "Olwë, Eärwen, Teleporno",
    "lifespan": "Immortal",
    "distinctions": "Singers, mariners",
    "hair color": "Dark, sometimes silver",
    "gallery": "IMAGES OF FALMARI"
  },
  {
    "title": "Men of Dale",
    "page_id": "3202",
    "text": "The MEN OF DALE were the inhabitants of the city state of Dale. They\ncame from the area around the Lonely Mountain.\n\n\n\n\nHistory\n\nThe Men of Dale were descendants of the Northmen who populated Rhovanion\nthroughout the many ages. Their capital was the city state of Dale and\nlater remnants fled to Laketown. The Men of Dale were allied with the\nDwarves in TA 2456 when Orcs from Mordor attacked.\n\nIn TA 2770, Smaug descended upon both Lonely Mountain and Dale probably\nfrom somewhere in Grey Mountains. He attacked and burned much of their\ntown. Over two-hundred years after the destruction of Dale in TA 2941,\none particular man named Bard the Bowman shot Smaug through a gap in his\nscaly armor with his Black Arrow with information from a Thrush that had\ncontact with Thorin and Company. Thereafter, the Men of Dale's symbol\nwas a Black Arrow so honoring the famous bowman. In TA 3019 during the\nWar of the Ring, they aided the Dwarves in defending the Lonely Mountain\nfrom the Easterling Empire.\n\nIn addition to many of them being competent in Westron, they also spoke\ntheir own language, generally termed “Dalish” and resembling the North\nGermanic languages.\n\n\nNames\n\nThe Men of Dale are named after their home city of DALE, which is\nderived from the English word meaning “valley”, in turn derived from\nProto-Germanic _*dalan_, with cognates in Old Norse (_dalr_), Gothic and\nDutch (_dal_), and German (_Thal_). Another common name for them\ntowards the end of the Third Age was BARDINGS, meaning “followers of\nBard”, _-ing_ being a patrynomic suffix and Bard meaning Bard the\nBowman, the first restored king of Dale and the slayer of Smaug.\n",
    "affiliation": "Dwarves of Erebor",
    "locations": "Dale, Esgaroth, Kingdom of Dale",
    "gallery": "IMAGES OF MEN OF DALE",
    "origins": "Northmen",
    "languages": "Westron, Dalish",
    "members": "Girion, Bardings (Bard, Brand)"
  },
  {
    "title": "Falathrim",
    "page_id": "3248",
    "text": "The FALATHRIM were the Elves living on coasts of the western Beleriand\nduring the First Age of the Sun in Middle-earth. They are called the\n'Coast People', 'Elves of the Falas' or 'Elves of the Havens'.\n\n\nHistory\n\nThe Falathrim were Sindarin Elves living in the Falas of Beleriand were\nrelated to the Teleri who were persuaded to stay in Middle-earth by\nOssë, but in the course of the Battles of the Beleriand their ranks were\nswelled by Sindar and Ñoldor fleeing the armies of Morgoth. They were\nthe first mariners and shipwrights of Middle-earth. Under their lord,\nCírdan, they prospered for many years, although the Falas was invaded by\nOrcs of Morgoth between the first and second battles of the Beleriand,\nand the Falathrim were forced to withdraw to their walled havens.\nThroughout the First Age, the Falathrim built all the ships sailed by\nMen or Elves of Beleriand. They sent a force to fight with the Union of\nMaedhros.\n\nWhen the Falas was overrun in FA 474 after the lost of the Nírnaeth\nArnoediad, the surviving Falathrim removed to the Isle of Balar, where\nthey continued to build ships and aid the Elves and Men of Arvernien.\nWhen the Beleriand was destroyed after the War of Wrath, the remnant of\ntheir people and culture survived into the Second Age and Third Ages\nsettling in Lindon and the Grey Havens.\n\n\nLord\n\n-   Círdan the Shipwright\n\n\nRealms\n\nFirst Age\n\n-   Falas- overrun in the First Age.\n    -   Haven of Eglarest\n    -   Haven of Brithombar\n-   Isle of Balar\n-   Havens of Sirion (in the land Arvernien) - destroyed by the Sons of\n    Fëanor\n\nSecond Age and Third Age\n\n-   Lindon\n    -   Forlindon\n    -   Harlindon\n    -   Grey Havens",
    "members": "Círdan, Voronwë",
    "lifespan": "Immortal",
    "locations": "Falas, Grey Havens",
    "languages": "Falathrin"
  },
  {
    "title": "Petty-Dwarves",
    "page_id": "3435",
    "text": "The PETTY-DWARVES (named in Sindarin NOEGYTH NIBIN or NIBIN-NOEG, part\nof an older and longer word BAR-EN-NIBIN-NOEG) were a diminutive race of\ndwarves that lived in the Beleriand in Middle-earth during the First\nAge. They differed from normal dwarves in various ways: they were\nsmaller, far more unsociable, and they freely gave away their names;\nother dwarves kept their Khuzdul names and language a secret.\n\n\nHistory\n\n The Petty-dwarves were dwarves of\nseveral houses, which had been exiled for reasons unknown in very\nancient times during the Peace of Arda. They were the first to cross the\nBlue Mountains (Ered Luin) in the First Age, and established strongholds\nin Beleriand before the building of Nogrod and Belegost in the Blue\nMountains, and before the elves arrived. They delved the very ancient\nsettlements of Nulukkizdin (Nargothrond) and Amon Rûdh but they dwindled\nbefore the Ñoldor returned to Middle-earth.\n\nThe Sindar, not yet acquainted with dwarves, thought the Petty-dwarves\nwere animals, and hunted them. Not until the dwarves of the Ered Luin\nestablished contact with the Sindar did the latter realize what the\nPetty-dwarves were. Afterwards they were mostly left alone, but not\nbefore the Petty-dwarves came to hate all elves with a passion.\n\nBy the time of the War of the Jewels, after the Return of the Ñoldor,\nthe Petty-dwarves had nearly died out. By the fifth Century of the First\nAge, the last remnant of their people were Mîm and his two sons, who\nlived at Amon Rûdh. Túrin and his men shot at the dwarves, mistaking\nthem for animals or orcs. Mim survived, but an arrow had killed one of\nhis sons, Khîm. Mim's other son had been killed by orcs, leaving Mim the\nlast of his kind. Mîm was killed by Húrin after the latter's release\nfrom Angband, and the Petty-dwarves were no more.\n\n\nOrigin in Tolkien's writings\n\nThe Petty-dwarves were created from remnant ideas based on the Nauglath\nin Tolkien's earliest writings in the _The Book of Lost Tales_. They\nwere more or less created to explain the difference between the dwarves\nlater writings such as The Hobbit in comparison to the wicked dwarves\nfrom his earlier stories which he hadn't yet completely abandoned.\nHowever, some of the ideas of the Nauglath were reincorporated into the\nNaugrim (Dwarves) by J.R.R. Tolkien or his son in the published\nSilmarillion and separate from the Petty-dwarves (such as the history of\nBelegost and Nogrod, and the Sack of Doriath events).\n\n''_'Niwennog_ '''was their first ascribed name (preceding the change to\n_Nibin-noeg_), as told of in the index of _The War of the Jewels._\n\nes:Bar-en-Nibin-noeg it:Nanerottoli pl:Bar-en-Nibin-noeg ru:Малые гномы",
    "other_names": "Petty-dwarves",
    "dominions": "Nulukkizdîn\nAmon Rûdh",
    "languages": "Khuzdul\nSindarin",
    "members": "Mîm\nIbun\nKhîm",
    "lifespan": "Shorter than other Dwarves",
    "distinctions": "Exiled Dwarves of several Houses; they were smaller, far more\nunsociable, and they freely gave away their names",
    "height": "Shorter than the other Dwarves"
  },
  {
    "title": "Olog-hai",
    "page_id": "4463",
    "text": "The OLOG-HAI were a more advanced breed of troll that appeared in the\nlast days of the War of the Ring in Sauron's service in Middle-earth.\n\n\nHistory\n\n\n\nThe Olog-hai are not mentioned by name in _The Lord of the Rings_; the\nterm appears only in the appendices. They were bred by Sauron in the\nlate Third Age, possibly for the same reason Saruman bred the Uruk-hai,\nfor improvement and less vulnerability to sunlight. They lived primarily\nin Mordor and in southern Mirkwood. However, they are described as being\nin the Battle of the Black Gate, where Pippin saves his friend Beregond\nfrom one. It is possible that some Olog-hai were also present at the\nBattle of the Pelennor Fields.\n\nThe Olog-hai are described as being taller than a Man, covered in spiky\nscales, carrying war hammers, large swords, or spiked maces, and\nbucklers, and having claws and, on occasion, tusks. It is mentioned that\nafter the War of the Ring, all Olog-hai were killed.\n\n\nEtymology\n\n_Olog-hai_ was a Black Speech word that meant simply 'troll-folk'. They\nseldom spoke and never in any language other than the Black Tongue of\nMordor. 'Olog' meant 'troll' in Black speech and 'hai' meant 'folk.\nUruk-hai meant 'orc-folk', and we can recognize the word 'hai' in both\nnames because they both have the same word in English (folk).\n\n\nBehavior\n\nOlog-hai lacked typical troll vulnerabilities: they were very\nintelligent and able to move under the Sun, unlike their other\ncounterparts. For this reason they were seen by some to be Orcs like the\nUruk-hai, but of troll-stock.\n",
    "name": "Olog-hai",
    "dominions": "Mordor, Dol Guldur (films only), Mount Gundabad (films only)",
    "languages": "Black Speech",
    "distinctions": "Tall, muscular, powerful, intelligent, destructive",
    "height": "Taller than a Man (books)\nAbout 10 - 15 feet or 3.5 - 5 meters tall (Lord of the Rings films)\nAbout 25 - 30 feet or 7 - 10 meters tall (The Hobbit films)",
    "skin_color": "Varying shades of grey and tan"
  },
  {
    "title": "Firebeards",
    "page_id": "6439",
    "text": "The FIREBEARDS were a tribe of Dwarves who came from the Blue Mountains.\nThey were paired in habitat with the Broadbeams,  but each tribe had\nits own mansion. Tolkien, however never specified if the Firebeards\nlived in Nogrod or Belegost.\n\nAfter the host of dwarves from Nogrod was defeated by the elves of\nOssiriand and the Ents led by Beren there is no more mention of Nogrod\nand Belegost in the Silmarillion but in Appendix A of Return of the King\nit is stated their people fled with the dwarves of Belegost to\nKhazad-dum and swelled its ranks. At the start of the War of the Dwarves\nand Orcs, the houses of the other Fathers of the Dwarves were called\nupon by Durin's Folk. Since they had been joined with Durin's folk after\nthe ruin of Beleriand and Thrain II Durin's Heir made his home in the\nremains of the ancient halls of the Firebeards in the Blue Mountains\nthey were among the first to heed the summons. When Gandalf goes to the\nhalls of Thorin Oakenshield they are in the ruins of Nogrod and\nBelegost.",
    "affiliation": "Broadbeams",
    "members": "Either Azaghâl or Telchar and Gamil Zirak",
    "languages": "Khuzdul, Sindarin",
    "locations": "Mount Dolmed, either Belegost or Nogrod or both, Khazad-dûm[1], Blue\nMountains"
  },
  {
    "title": "Broadbeams",
    "page_id": "6606",
    "text": "The BROADBEAMS were a tribe of Dwarves who came from the Blue Mountains.\nThey were paired with the Firebeards, but each tribe had its own\nmansion. Tolkien, however, never specified if the Broadbeams lived in\nNogrod or Belegost. At the start of the War of the Dwarves and Orcs, the\nhouses of the other Fathers of the Dwarves were called upon by Durin's\nFolk. It is probable that Broadbeams were one of the houses summoned.",
    "languages": "Khuzdul, Sindarin",
    "members": "Either Azaghâl or Telchar and Gamil Zirak",
    "affiliation": "Firebeards",
    "locations": "Mount Dolmed, either Belegost or Nogrod or both, Khazad-dûm[1], Blue\nMountains"
  },
  {
    "title": "Galadhrim",
    "page_id": "7556",
    "text": "The GALADHRIM, or\nthe TREE-PEOPLE, were elves of mixed descent (Sindar, Silvan, and\nÑoldor) living in the forest of Lórien that was ruled by Galadriel and\nCeleborn.\n\n\nHistory\n\nThe Galadhrim had gone undisturbed since the founding of Lórien in the\nSecond Age until TA 1980, when the Balrog in Khazad-Dûm was freed. Upon\nthis event, many of them fled south to Dol Amroth, while many other\nGaladhrim sailed over the sea. The Galadhrim that remained lived happily\nin Lórien until the end of the Third Age. With the departure of\nGaladriel to the Undying Lands, Lórien was deserted. The remaining\nGaladhrim went with Celeborn to East Lórien. \n\nTheir language was a dialect of Sindarin.\n\n_Galadhrim_ was also the name of the royal Lothlórien army.",
    "pronunciation": "_gal-ATH-rim_",
    "other names": "Elves of Lórien, Elves of Lórinand, Tree-people",
    "origins": "Silvan Elves of Lothlórien",
    "lifespan": "Immortal",
    "languages": "Silvan Elvish, Sindarin, Westron",
    "locations": "Lothlórien",
    "members": "Haldir, Rúmil, Orophin, Amdír, Amroth, Nimrodel, Mithrellas, Celeborn,\nGaladriel"
  },
  {
    "title": "Men of the West",
    "page_id": "8299",
    "text": "The term MEN OF THE WEST is a general term that refers to the Edain or\nAtani, the men who were friends with the Elves Lullaby in the First and\nSecond Age of Middle-earth.\n\n\nHistory\n\nIn the Third and Fourth Age, this term refers to several groups of Men,\nincluding men of Rohan and Gondor. Other Men included in this general\ndesignation include the men of Bree-land, the Men of Dale and may also\nbe applicable to Hobbits, as Hobbits are considered a race of Men.\nDuring the War of the Ring, this term was used to refer to the Edain who\nventured forth to challenge the armies of Mordor.\n\nMore specifically, MEN OF THE WEST may also refer to men who are\ndescended from the survivors of Númenor. But overall, any person who is\ndescended from the houses of Haleth, Bëor or Hador may claim this title.\n\nAssorted lands of the Edain\n\n-   Gondor\n-   Arnor\n-   Rohan\n-   Dale\n-   Lake-town\n-   The Shire\n-   Drúadan Forest\n-   Bree-land\n-   Dunland",
    "origins": "Descendants of the Númenóreans",
    "locations": "Eriador, Arnor, Gondor",
    "rivalries": "Sauron",
    "average height": "Taller than other Men",
    "languages": "Quenya, Westron, Sindarin, Gondor Sindarin",
    "lifespan": "Three times the life of a regular man but later diminished (not so much\nin Arnor however)[1]",
    "gallery": "IMAGES OF DÚNEDAIN",
    "hair color": "Dark",
    "distinctions": "Superior to the other men of Middle-earth in nobility of spirit and body",
    "members": "Amandil, Tar-Palantir, Argeleb I, Aragorn II"
  },
  {
    "title": "Gondolindrim",
    "page_id": "10573",
    "text": "The GONDOLINDRIM, sometimes called the HIDDEN PEOPLE, were the Elves of\nGondolin, the people of Turgon.\n\nThey were made up of both Noldorin exiles from Valinor and Sindarin\nElves. They were strong in mind, body, and spirit and became highly\nskilled in the arts and crafts and were well cultured.\n\n\nHistory\n\nFor nearly five hundred years, they lived in peace and prosperity\ntrusting in the secrecy of their hidden city and refusing to take part\nin the affairs and Battles of the Beleriand, save for the Nirnaeth\nArnoediad where fortunately for them, the secret of Gondolin was\npreserved thanks to the bravery of the Men of Dor-lómin. However, their\nsecret would not remain a secret for long as others such as Húrin were\nused in finding its location, and then later from a threat from\nwithin.\n\nIt was Maeglin, son of Eöl who bitterly resented the fact that he could\nnot win the affection of the woman he desired and jealous of the one\nwho did, betrayed the people of Gondolin after being captured by\nMorgoth. This led to the Fall of Gondolin and the near destruction of\nits people; however, a group of them were saved by Tuor and Idril and\nthe bravery of Glorfindel.\n\nThe remaining Gondolindrim fled to the Havens of Sirion where they\nmourned greatly for the loss of their great city. There they lived in\npeace under the lordship of Tuor and Idril and later their son Eärendil\nuntil the deadly attack on the refuge by the Sons of Fëanor who were\nseeking the recovery of the Silmaril. Most all the Gondolindrim were\nslain and if any did survive they probably went over the Great Sea to\nthe Undying Lands.\n\n\nEtymology\n\n_GONDOLINDRIM_ was a Sindarin word that meant “Gondolin-people”.",
    "origins": "Descendants of Noldor",
    "locations": "Gondolin",
    "languages": "Quenya, Sindarin",
    "pronunciation": "_gon-do-LIN-drim_",
    "members": "Turgon, Idril, Tuor, Maeglin, Ecthelion, Glorfindel",
    "lifespan": "Immortal",
    "gallery": "IMAGES OF GONDOLINDRIM"
  },
  {
    "title": "Stonefoots",
    "page_id": "11440",
    "text": "The STONEFOOTS were one of Houses of the seven Fathers of the Dwarves\nthat dwelt in the mountains of the East. They were originally paired\nwith the Blacklocks.\n\nIt is possible that the Stonefoots were among the “Houses of other\nFathers” who sent troops to help Durin's folk in the War of the Dwarves\nand Orcs.",
    "other_names": "Stonefoots",
    "dominions": "Mountains of the East",
    "languages": "Khuzdul"
  },
  {
    "title": "Blacklocks",
    "page_id": "11439",
    "text": "The BLACKLOCKS were a relatively unmentioned clan of dwarves in\nTolkien's writings. They presumably had black hair (hence their name)\nand might have had relations with other Dwarven clans. They most likely\noriginated in the southern part of the Orocarni, being the only far\neastern mountain range. The Blacklocks were among the “_Houses of other\nFathers_” who sent troops to help Durin's Folk in the War of the Dwarves\nand Orcs.",
    "other_names": "Blacklocks",
    "dominions": "Mountains of the East",
    "languages": "Khuzdul"
  },
  {
    "title": "Ironfists",
    "page_id": "11438",
    "text": "The IRONFISTS were one of the Houses of the seven Fathers of the Dwarves\nin Middle-earth. Presumably, as they do not appear in any of the tales,\nthey lived far to the east in the northern range of the\nOrocarni mountains where they were paired with the Stiffbeards. The\nIronfists sent troops to fight in the War of the Dwarves and Orcs during\nthe Third Age. For it is said that Durin's Folk called for aid from\nhouses of other fathers of the Dwarves.",
    "other_names": "Ironfists",
    "dominions": "Mountains of the East",
    "languages": "Khuzdul"
  },
  {
    "title": "Stiffbeards",
    "page_id": "12340",
    "text": "The STIFFBEARDS were among the Houses of the seven Fathers of the\nDwarves in Middle-earth that dwelt in the mountains of the East, near\nOrocarni. They were originally paired with the Ironfists. It is\npossible that the Stiffbeards were among the “_Houses of other Fathers_”\nwho sent troops to help Durin's Folk in the War of the Dwarves and Orcs.",
    "other_names": "Stiffbeards",
    "dominions": "Mountains of the East",
    "languages": "Khuzdul"
  },
  {
    "title": "Gundabad Orcs",
    "page_id": "15910",
    "text": "The_' Gundabad Orcs _' were the Orcs inhabiting Mount Gundabad. They had\nattacked the mountain and took it from the Dwarves of Durin dwelling\nthere. They were the servants of the Witch-king of Angmar before they\nhad seized Gundabad.\n\n\nHistory\n\nSome time during the Second Age, the orcs that had survived the\ndestruction of Angband were forced to wander the Northern Waste and find\na new home. This was when they attacked the mountain and took it from\nthe Dwarves. In the Third Age, the Orcs of Angmar officially stated\nGundabad as their capital, which angered the Dwarves greatly. \nGundabad remained an Orc stronghold, until it was cleared of orcs in TA\n2799, after the War of the Dwarves and Orcs. However, small groups of\norcs must have returned and fortified it anew during the events of _The\nHobbit_, menacing Wilderland once again. It was from here that the\nGoblins present at the Battle of Five Armies came from in their marching\nnumbers. Their leader, Bolg, son of Azog, was the supreme commander of\nthe orcs from Mount Gundabad and presumably the northern Misty\nMountains, and was killed by Beorn, the skin-changer. It is unknown what\nbecame of the orcs after that or who their leader was, but they\neventually became a threat again. In battle, they were armed with orcish\nscitimars, spears and axes.\n",
    "name": "Gundabad Orcs",
    "dominions": "Misty Mountains, Mount Gundabad",
    "languages": "Orkish, Westron",
    "height": "Between 4-5'",
    "skin_color": "Swarthy"
  },
  {
    "title": "Black Uruks",
    "page_id": "19161",
    "text": "The BLACK URUKS or “MORDOR URUK-HAI” were an elite breed of Orc that\nmade up part of Sauron's vast, ground-bred army, and thus _Black Uruk_\nis the term used to refer to any Uruk of Mordor.\n\n\nHistory\n\nBlack Uruks were the first Orc-kind of Middle-earth to be named _uruk_,\nfor they originated before the Great Years, and first appeared in\nassaults upon Ithilien that took place in the year 2475 of the Third\nAge. (It was almost a millennium later that Saruman in Isengard bred the\nmore familiar _Uruk-hai_.)\n\n\n\n\nNotable Uruks of Mordor\n\n-   Shagrat, Captain of the tower of Cirith Ungol\n-   Gorbag, Captain of the tower of Cirith Ungol\n",
    "name": "Black Uruks",
    "dominions": "Mordor",
    "languages": "Native dialects, Black Speech, Westron",
    "notable_members": "Shagrat",
    "distinctions": "Uruk-hai",
    "skin_color": "Dark"
  },
  {
    "title": "Moria Orcs",
    "page_id": "27877",
    "text": "“MORIA ORCS” refers to the orcs who in TA 2480  came to inhabit the\nDwarven realm of Khazad-dum, at the time Sauron populated “Moria with\nhis creatures”, long after the Dwarves had fled there in 1981.\n\nThree centuries later, Azog was their leader. When Thror came to reclaim\nMoria with Nar, Azog slew Thror, and this initiated The War of Dwarves\nand Orcs. The Dwarves hunted down Azog until he was killed by Dain II\nIronfoot at the Battle of Azanulbizar. (After Azog's death, his son Bolg\nwould lead an army of Orcs to Erebor, where they lost terribly, and Bolg\nwas killed.)\n\nWhen the Dwarves, led by Balin, returned to Moria in TA 2989, they came\nupon bands of orcs who eventually invaded and overtook Khazad-dum, and\nBalin was slain. These orcs were not large in number or well-armed,\nbut sufficient to keep out any enemies.\n\nThe Fellowship of the Ring came upon a large group of Moria Orcs, led by\nan unknown large orc chieftain, who ambushed them in Balin's Tomb. After\nthe Fellowship left the chamber they came upon other orcs and\nCave-trolls who attempted to kill them as they neared the Bridge of\nKhazad-dûm. The Moria Orcs stopped due to the arrival of Durin's Bane,\nthe ancient Balrog of the old kingdom. After the Balrog's defeat, Moria\nOrcs continued their hunt for the Fellowship to Lothlórien where they\nwere killed by the Elves living there.\n\nWhile most Moria Orcs served Sauron, some of them fell under the\ninfluence of the wizard Saruman or acted on their own behalf. Several of\nthe Moria Orcs in the service of Saruman along fellow Mordor Orcs and\nUruk-hai were sent by the old Istari to capture Frodo Baggins and get\nthe One Ring. The orcs however took Meriadoc Brandybuck and Peregrin\nTook in place of Baggins and began their journey back to Isengard. At\nsome point during this journey, the orcs of the Black Pit grew hungry\nand began arguing with Uglúk about eating the two hobbits. Uglúk had to\nprevent any riot so he killed several of the traitorous orcs and warned\nthe others. The surviving Moria Orcs were killed either on the road by\nthe Riders of Rohan or at night near Fangorn Forest by Eomer's Rohirrim\ngroup.\n\nAfter the destruction of Isengard, these orcs were driven out of Moria\nand the Dwarves reclaimed it.\n",
    "name": "Moria Orcs, Moria Goblins",
    "dominions": "Moria, Misty Mountains",
    "languages": "Black speech",
    "height": "Between 3-5",
    "skin_color": "Swarthy, black"
  },
  {
    "title": "Lesser Dúnedain",
    "page_id": "41849",
    "text": "LESSER DÚNEDAIN, also known as the Southern Dunedain, were the Dunedain\nwho intermarried with “Middle Men”.\n\n\nHistory\n\nThe DÚNEDAIN OF THE SOUTH were the Sindarin speaking descendants of the\noriginal Númenórean settlers who had founded the Kingdom of\nGondor.Though the lower urban classed quickly intermixed with the rural\nindigenous population and were considered Gondorian commoners or Tarkils\nthe high nobility and royal house long preserved a relatively pure\nnúmenórean lineage They were also known as “lesser Dúnedain”. Most\nGondorians and Arnorians would be considered Tergil. They settled mainly\nin Arnor and Gondor, but during the Third Age only in the Gondor-region.\nThese were the TERGIL (Sgl.“Targil” Q.“Tarkil”) or TORFIRIATH were the\ndescendants of Dúnedain\n\n\nDescription and Historical accounts\n\nBeing mostly of Númenórean stock and ruled by exiled Númenórean\noverlords, the people continued most of the customs and traditions of\nNúmenór. However, over the centuries, they mixed more and more with the\nmen of Middle-earth. One of these peoples was the Northmen who lived in\nRhovanion, and Gondor, ever needing allies as well as friends, began\nacquainting themselves with these men by the mid Third Age. Brave and\nvaliant but by the standards of the Dúnedain shorter-lived, the Northmen\ngradually had more and more to do with Gondor, and one of its heirs to\nthe throne Valacar, who lived and worked with them in their own land as\nan ambassador, married one of their noble ladies setting the stages for\nthe Kin-strife.",
    "name": "Lesser Dúnedain",
    "dominions": "Colonies of Númenor (early); Gondor and Arnor (later)",
    "languages": "Westron, Sindarin",
    "notable_members": "Men of Gondor",
    "lifespan": "Normal human lifespan",
    "distinctions": "Mortality",
    "skin_color": "Fair, brown, dark",
    "hair_color": "Black, brown, blonde, grey, or white (in later years)"
  },
  {
    "title": "Men of Númenor",
    "page_id": "42597",
    "text": "NÚMENÓREANS were the Men of Númenor, descendants of the Edain of the\nFirst Age, who were granted the island of Elenna as a dwelling place.\nThey turned against the Valar, and their island home was destroyed in\nthe last years of the Second Age.\n\n\nHistory\n\nThe NÚMENÓREANS (Ad._Adûnai_) were the men of Númenór, those descendants\nof the three houses of the Edain who had settled the Island Realm of\nNúmenór in the second Age.Those Númenóreans of the Elendili who settled\nthe coasts of the Westlands and founded the kingdoms of Arnor and Gondor\nwere also known as the Dúnedain and they continued to speak Sindarin as\ntheir formal speech of etiquette although they used Adûnaic as their\nlingua franca, and later its descendant Westron.The King's Men or\nAruwanai who settled the coastlands south of Umbar were called Black\nNúmenóreans by their northern brethren\n\n\nAppearance\n\nThe Adûnai regarded the pale skin of the Eldar as prestigious, however\nmany among the hard working rural population and the sun-tanned mariners\nhad ruddy or darker skin, so pale skin became the ideal of the upper\nclasses. In later times it was was seen as a symbol of pure-blooded\nnúmenórean descend, as the former free working classes rose to the\nstatus of urban citizens and the lower classes were replaced by unfree\nslaves imported from all over Middle-Earth and a mixed-blooded class of\nunfree and semi-unfree freedmen evolved. The original Adûnai were a tall\nfolk, 6 feet, 4 inches being not uncommon among them, although their\nlater descendants used to be smaller in statue. Most common Adûnai were\nblack or brown haired, being largely descendants of the Beorians and\nHalethrim, but in the royal line there also were some flaxen or\ngolden-haired families, offspring of the house of Hador. Adûnai were\nusually grey-eyed, though brown or blue eyes were not uncommon.\n\n\nReligion\n\nThe Adûnai revered the One-god Êru and his subject-spirits the Avalôi or\nÊru-bêni, especially Gimilnitîr or Avradî and Amân or Adûnakhôr, but\nalso Abâr, Agân, Azâr and Magân.Later under Zigurûn's tutelage they\nlargely abolished the reverence of Êru and made the cult of Alkar or\nMulkhêr their imperial religion, the few remaining faithful or Elendili\nmostly left Númenór for the colonies of the northwest.\n\n\nCulture\n\nThe Adûnai were the greatest Seamen and Scholars among the mortals and\ncertainly also the most skilled artificians and warriors.However with\nthe drowning of Númenór much of the Adûnai's knowledge was lost forever\nand their Dúnadan and Aruwanai descendants only inherited a shadow of\ntheir forefathers' former glory.\n\n\nLifespan\n\nWhile the early half-elven royal line of the númenórean Kings lived up\nto 400 years and even the lesser Númenoreans often lived up to 200\nyears, their Elendili and Aruwanai descendants of the late third age\nonly came to live for no longer than 100 years, 150 years being a sign\nof royal descent, with the notable exception of Elessar I who died at\nthe age of 210.",
    "dominions": "Númenór(early) Eriador, Harad, Umbar, Pelargir, later Arnor and Gondor",
    "languages": "Adûnaic, Western and Sindarin",
    "notable_members": "Elros, Aldarion, Ar-Pharazôn, Elendil, Isildur",
    "lifespan": "150-180 years of average except Kings of the Dúnadan live longer",
    "distinctions": "Mortality",
    "height": "Nine and seven feet tall",
    "skin_color": "Fair, brown, dark",
    "hair_color": "Black, brown, blonde, grey or white (in later years)"
  },
  {
    "title": "Men of Arnor",
    "page_id": "42611",
    "text": "MEN OF ARNOR, or ARNORNIANS, describes the Men of Arnor. They were the\npeoples of the Kingdom of Arnor.  They were descended from the\nNúmenórean colonists who settled there throughout most of the Second Age\nand their noble kin who escaped the destruction of Númenór in SA 3319.\nBeing mostly of Númenórean stock and ruled by exiled Númenórean\noverlords, the people continued most of the customs and traditions of\nNúmenór.\n\n\nHistory\n\nBefore the foundation of Arnor there was already a sizable Númenórean\npopulation living in Eriador, a result of the slow emigration of\nNúmenóreans which had started under Tar-Meneldur and Tar-Aldarion. The\nregion was home to Middle Men of Edainstock, and the early colonists\nsoon interbred with the indigenous population.\n\nThe people of Arnor, the North-kingdom founded by Elendilin Middle-earth\nafter the Downfall of Númenor. Elendil was its first King, and was held\nas High King over both the North- and South-kingdoms (hence the name\n_Arnor_, which means 'Land of the King').\n\nThe Men of Arnor were severely depleted by the War of the Last Alliance,\nin which many of them fell. Nonetheless, the land of Arnor survived for\nnearly a thousand years under ten different Kings. The eldest son,\nAmlaith, claimed Kingship over all Arnor but was reduced to only ruling\nthe region of Arthedainas his kingdom, while the other sons founded the\nkingdoms of Cardolanand Rhudaur. The largest part of the populace were\nEriadorian Commoners, who were ruled by an upper class of Northern\nDúnedain, though there was a broad mixed-blooded middle-class,\nespecially in the urban centers and the lesser Nobility or Gentry.\n\nTheir realms were lost during the Third Age, and for the millennium\nbefore the War of the Ring, they were a wandering people. Their leader,\nwho took the title 'Chieftain', was the descendant of the ancient King,\nIsildur.\n\nAfter the War of the Ring, Aragornwas crowned the King of Gondor, and he\nwas also crowned as the King of Arnor, and thus, he became the first\nHigh King of the Reunited Kingdom of Arnor and Gondor.\n\n\nGalleries\n\nUntitled2.png\n\nUntitled3.png Untitled4.png Untitled5.png Untitled6.png Untitled7.png\nHalbarad.jpg\n\nElendil11.jpg|Elendil the Tall Arador card.jpg Arathorn\nlo-rez.jpg|Arathorn in _Born of Hope_ King Aragorn.PNG|Aragone, the\nfirst High King of the Reunited Kingdom Eldarion.jpg",
    "name": "High Men\n\nDúnadan( Faithful Númenóreans)",
    "dominions": "Arnor",
    "languages": "Westron, Sindarin, Adûnaic",
    "notable_members": "Elgarain, King Aragorn II Elessar",
    "lifespan": "150-180 years of average except Kings of the Dúnadan live longer",
    "distinctions": "Mortality",
    "skin_color": "Fair, brown, dark"
  },
  {
    "title": "Mordor Orcs",
    "page_id": "45713",
    "text": "MORDOR ORCS were the Orcs bred by the Dark Lord Sauron in the Land of\nthe Shadow. They formed Sauron's main host during the Second Age and\nThird Age.\n\nDuring the War of the Ring, Sauron and his ally Saruman sent a band of\nUruk-hai, Mordor Orcs and Moria Orcs. The Mordor Orcs were led by\nGrishnákh, an orc captain tasked with taking the hobbits back to Mordor.\nThe orcs managed to kill the Gondorian warrior Boromir and to capture\nMerry and Pippin who they had mistaken for Frodo and Sam. However, as\nthey left Amon Hen the orcs began to quarrel over where to take the two\nhobbits. The Mordor Orcs had received orders to take them to their\nmaster Sauron while the Uruk-hai wanted to take them to Saruman in\nIsengard. Since the orcs of Isengard were more numerous than the ones\nfrom Mordor, Grishnákh's band was forced to follow the Uruks. The orc\ncaptain secretly planned his next move and left the group to call\nreinforcements. At night near Fangorn Forest, the orcs were all killed\nby the Riders of Rohan.\n\nOther orcs were led by the Witch-king against the forces of Gondor at\nthe battle near Pelennor Fields. The rest of the Mordor Orcs perished at\nthe Battle of the Black Gate or during the destruction of the Dark\nTower.\n",
    "name": "Mordor Orcs",
    "dominions": "Mordor",
    "languages": "Black Speech, Orkish, Westron",
    "notable_members": "Grishnakh, Snaga (Grishnákh's band), Snaga, Radbug",
    "lifespan": "Unknown"
  },
  {
    "title": "Dwarves of the Iron Hills",
    "page_id": "45926",
    "text": "The DWARVES OF THE IRON HILLS were Dwarves belonging to the house of the\nLongbeards, otherwise known as Durin's Folk, who lived in the Iron\nHills.\n\n\nHistory\n\nEarly history\n\nThe Longbeard Dwarves of Khazad-dûm colonized the Iron Hills in the\nFirst Age. The Hills were their primary source of iron-ore. The\nDwarf-road of Mirkwood ran north-east from Khazad-dûm to the Hills for\nuse by dwarf-traders and merchants.\n\nAfter Sauron destroyed Eregion in the Second Age, the Longbeards sealed\nKhazad-dûm and Orcs took control of the northern Misty Mountains and the\nGrey Mountains. This ended communication between the Iron Hills and\nKhazad-dûm for some time.\n\nThird Age\n\nFounding of Grór's Realm\n\nIn the Third Age, many Longboard Dwarves lived in the Grey Mountains,\nbut they were greatly troubled by Dragons in that region. After King\nDáin I was slain by one of these dragons, his surviving sons led an\nexodus into the east. Dáin's elder son Thrór recreated the Kingdom under\nthe Mountain at Erebor, while his younger brother Grór led a part of the\npeople further into the east to join their kindred living in the Iron\nHills.\n\nGrór settled in the Iron Hills in the year TA 2590 and became Lord of\nthe Iron Hills. During his reign, the realm became the strongest in the\nNorth, being the only realm standing between Sauron and his plans to\ndestroy Rivendell and taking back the lands of Angmar. Also, following\nthe Sack of Erebor many of Durin's folk fleeing from Smaug and those\nwandering in exile, except for Thrór and his small company of family and\nfollowers, came to the Iron Hills, bolstering their numbers.\n\nWar of the Dwarves and Orcs\n\nDuring the War of the Dwarves and Orcs, many Dwarves from the Iron Hills\nfought several battles, but they are mostly remembered from the Battle\nof Azanulbizar in the year TA 2799. Naín and his army came to the battle\nin the most crucial moment when the main Dwarven army was being\ndecimated by the great host of Orcs. With these fresh reinforcements,\nthe Dwarves were able to route and destroy their opponents, fighting\ntheir way all up to the steps of the East-gate of Moria. There, Nain\ndueled with Azog, the Orc commander, resulting in his death. Later in\nthe battle, Dáin II Ironfoot killed Azog out of vengeance for his\nfather, achieving recognition because he was very young by dwarven\nstandards. After this battle, Dain led his Dwarves back to Grór's Halls.\n\nDáin's Reign\n\nGrór ruled the Dwarves of the Iron Hills for 215 years, and he died in\nTA 2805 at 241 years of age. Dáin Ironfoot became the next Lord of the\nIron Hills. During his reign, the Iron Hills evolved to the mightiest\nDwarf-realm of its time.\n\nYears later, Dáin's cousin Thorin attempted to restore the kingdom at\nErebor, but he was trapped by the Elves of Mirkwood and Northmen of\nEsgaroth and sent to the Iron Hills for aid. Dáin arrived with over 500\narmored Dwarves and as events developed, the Dwarves of the Iron Hills\nproved crucial in winning the ensuing Battle of Five Armies against the\nOrcs of the Misty Mountains. Thorin died in that battle, and with him\nthe royal line of Thrór. Through his ancestor Grór, the Kingship of\nDurin's Folk then fell on Dáin. Dáin II Ironfoot removed from the Iron\nHills and re-established a kingdom under the Lonely Mountain. It is\npossible that both Iron Hills and Erebor were ruled by him and later by\nhis son Thorin III Stonehelm.\n\nThe Dwarves of the Iron Hills fought alongside the Dwarves of Erebor in\nthe Battle of Dale against the Easterlings during the War of the Ring.\n\n\nOther information\n\nThey became well-known for making a metal mesh that could be used for\nmaking flexible items like leg-coverings.\n\nThese Dwarves of Durin's folk were known for being some of the most\nfierce and elite of all Dwarf armies capable of matching Sauron's army\non equal footing. Their main weapon of choice seemed to have been the\nmattocks, though they also carried a short broad sword with a round\nshield.\n\nNot much is said on whom were enemies of these dwarves, but it seems\nlikely that the Easterlings were one of them since their empire was near\nand around the Iron Hills, and possibly the Dragons that lived nearby in\nthe northern wastes.",
    "other_names": "Dwarves of the Iron Hills",
    "dominions": "Iron Hills",
    "languages": "Khuzdul, Westron",
    "members": "Dáin II Ironfoot, Grór, Náin",
    "lifespan": "c. 250 years",
    "distinctions": "Among the fiercest warriors in Middle-earth",
    "height": "Five feet or less"
  },
  {
    "title": "Dwarves of Erebor",
    "page_id": "46057",
    "text": "The DWARVES OF EREBOR or DWARVES OF THE LONELY MOUNTAIN were those\nDwarves who who dwelt in the halls of Erebor, beneath the Lonely\nMountain.\n\n\nHistory\n\nKingdom\n\nThráin I established the Kingdom under the Mountain fleeing from Moria.\nDuring his time the Arkenstone was discovered, the most prized\npossession of the Kingdom. His son, Thorin I, later became King under\nthe Mountain but after seeing the wealth of the Dwarves of the Grey\nMountains, he abandoned Erebor.\n\nWhen the Cold-drakes invaded the Grey Mountains, they drove most of the\nDwarves out. Thrór, a descendant of Thorin I, took some of his people\nand flew the Grey Mountains for Erebor. His brother Grór continued east\nwith a great following of Durin's folk to the Iron Hills while himself\nrefounded the kingdom of Erebor in TA 2590.\n\nSecond Kingdom\n\nThe Dwarves gained the friendship of the Northmen along the Celduin and\nhad much trade of goods, beautiful trinkets, and weapons with the town\nof Dale. The Dwarves of Erebor also had much traffic of ores with their\nkinsmen in the Iron Hills and the region had peace and prosperity for\nmany years.\n\nThe Dwarves were properous, and made great wealth for themselves until\nthey were dispossessed of their immense wealth by Smaug the Dragon, who\nflew south from the Ered Mithrin and sacked their kingdom in TA 2770.\n\nThe Dwarves reclaimed their inheritance many years later under the\nleadership of Thorin II. But it was the descendants of Dáin II Ironfoot\nthat ruled there ever after.\n\nThird Kingdom\n\nAfter the restoration thanks to Thorin and Company, the Dwarves became\nagain rich and prosperous under Dáin's rule, as the Dwarves exceeded\ntheir ancestors in masonry and mining. Dale was rebuilt as a kingdom and\nthey had a close friendship with the Elves of Mirkwood.\n\nBalin and other Dwarves set out to reclaim Moria in TA 2989. Dáin did\nnot give his blessing when Balin, but could not dissuade them. It was\nonly later learned the colony was destroyed after five years.\n\nWar of the Ring\n\nIn TA 3018, a messenger came from Mordor, enquiring about “Baggins” from\n“Shire”, promising the last three Dwarf-rings to Dáin. The King asked\ntime to think and he sent Glóin and his son Gimli to Elrond for council,\nand to warn Bilbo.\n\nThe War of the Ring reached the North; King Brand fighting the\nEasterlings retreated from the River Carnen and was given aid by Dwarves\nin the Battle of Dale. After three days of fighting Dwarves and Men were\ndriven back, and Brand was slain, followed by Dáin. Several days\nlater the Easterlings learned that the War was lost. When the new King\nThorin III Stonehelm, son of Dáin, and Brand's Bard II saw this they\ncame out of the mountain and routed their enemies.\n\nLittle is known of the reign of Thorin III, other than the Dwarves\nhelped rebuild the cities of Minas Tirith and the fortress of Helm's\nDeep. Some of the Dwarves colonized the Glittering Caves.\n\n\nLanguage and writing\n\nThe Dwarves of Erebor spoke Khuzdul but used the Language of Dale for\ntheir public names.\n\nComing from Moria, the Dwarves brought with them the Angerthas Moria,\nwhich however was modified further. For some reason some runes of\nAngerthas Moria were reverted back to their Elvish values in Angerthas.\nThe resulting variation was known as Angerthas Erebor.\n\n\nMembers\n\nNoted Dwarves from Erebor were:\n\n-   THRÁIN I\n-   THORIN I\n-   THRÓR\n-   Thráin II\n-   Thorin\n-   Balin, Dwalin\n-   Dori, Nori, Ori\n-   Óin, Glóin\n-   Bifur, Bofur, Bombur\n-   Kíli and Fíli\n-   Gimli\n-   Dáin II Ironfoot\n-   Thorin III Stonehelm\n-   Floi, Loni, Nali, Frár\n-   Dís\n-   Frerin\n-   Fundin\n",
    "other_names": "Dwarves of Erebor",
    "dominions": "Lonely Mountain\nMoria\nGlittering Caves",
    "languages": "Khuzdul\nWestron",
    "members": "Gimli\nThorin II Oakenshield",
    "lifespan": "c. 250 - 350 years",
    "height": "Five feet or less"
  },
  {
    "title": "Dwarves of Nogrod",
    "page_id": "46046",
    "text": "The DWARVES OF NOGROD were the Dwarven House who dwelled at Nogrod in\nthe First Age.\n\n\nHistory\n\nDuring the Years of the Trees the western Fathers of the Dwarves awoke\nfrom beneath Mount Dolmed creating the lines of the Broadbeams and the\nFirebeards. These two houses built the great Dwarven cities of Nogrod\nand Belegost in the Blue Mountains. It is not clear whether they\nshared the two cities or whether each house dwelt in its own.\n\nThey were initially friendly to the Elves of Beleriand, renowned as\ncraftsmen and jewelers, such as Gamil Zirak whose works were to be found\nin the treasuries of King Thingol of Doriath, and Telchar known for\nthe forging of weapons. Dwarves from the Blue Mountains, perhaps also\nthose of Nogrod, aided the Noldor in the building of Nargothrond.\n\nDwarves of Nogrod, as well as their kinsmen of Belegost, participated in\nthe Union of Maedhros supplying them with soldiers and weapons.\n\nSome craftsmen from Nogrod stayed in Menegroth and were asked by King\nThingol of Doriath to set the Silmaril in the Nauglamir. But they\ncoveted the Nauglamir they made and killed Thingol in his treasury, and\nfled, only to be slaughtered by the avenging Elves who killed all but\ntwo. The survivors returned to Nogrod, and lied to their kinsmen saying\nthat Thingol refused to pay the craftsmen and for their work and killed\nthem.\n\nAlthough the Dwarves of Belegost refused to aid them, they formed a\ngreat host which passed over Sarn Athrad intimidating the Sindar who\nfled before them. In the sack the Menegroth they ravaged the Caves and\nThingol's treasures. But on their return home they were hunted down by\nBeren Erchamion and killed by his army of Green-elves and a group of\nEnts at the Battle of Sarn Athrad as they were crossing the river.\n\nNogrod was ruined due to the War of Wrath by the Valar which marked the\nend of the First Age. Most of the Dwarves of Nogrod would later go to\nKhazad-dûm.\n"
  }
]