[
  {
    "title": "Tom Bombadil's Songs",
    "page_id": "6074",
    "text": "TOM BOMBADIL'S SONGS are in the index of The Lord of the Rings, all\nlisted as one continuous song. The first part is what Frodo Baggins and\nSam Gamgee hear while Meriadoc Brandybuck and Peregrin Took are stuck in\nOld Man Willow in the Old Forest:\n\n    _Hey dol! merry dol! ring a dong dillo!_\n    _Ring a dong! hop along! Fal lal the willow!_\n    _Tom Bom, jolly Tom, Tom Bombadillo!_\n\n1. The hobbits then hear a string of apparently nonsense-words followed\nby:\n\n    _Hey! Come merry dol! derry dol! My darling!_\n    _Light goes the weather-wind and the feathered starling._\n    _Down along under Hill, shining in the sunlight,_\n    _Waiting on the doorstep for the cold starlight,_\n    _There my pretty lady is, River-woman's daughter,_\n    _Slender as the willow-wand, clearer than the water._\n    _Old Tom Bombadil water-lilies bringing_\n    _Comes hopping home again. Can you hear him singing?_\n    _Hey! Come merry dol! derry dol! and merry-o!_\n    _Goldberry__, Goldberry, merry yellow berry-o!_\n    _Poor old Willow-man, you tuck your roots away!_\n    _Tom's in a hurry now. Evening will follow day._\n    _Tom's going home again water-lilies bringing._\n    _Hey! Come derry dol! Can you hear me singing?_\n\n2. After Tom has freed Merry and Pippin, he goes on ahead to his house,\noutdistancing the hobbits. He sings this back to them:\n\n    _Hop along, my little friends, up the Withywindle!_\n    _Tom's going on ahead candles for to kindle._\n    _Down west sinks the Sun: soon you will be groping._\n    _When the night-shadows fall, then the door will open,_\n    _Out of the window-panes light will twinkle yellow._\n    _Fear no alder black! Heed no hoary willow!_\n    _Fear neighter root nor bough! Tom goes on before you._\n    _Hey now! merry dol! We'll be waiting for you!_\n\n3. Once the hobbits can see the house, they hear:\n\n    _Hey! Come derry dol! Hop along, my hearties!_\n    _Hobbits! Ponies all! We are fond of parties._\n    _Now let the fun begin! Let us sing together!_\n\n4. At this point, Goldberry joins in with:\n\n    _Now let the song begin! Let us sing together!_\n    _Of sun, stars, moon and mist, rain and cloudy weather,_\n    _Light on the budding leaf, dew on the feather,_\n    _Wind on the open hill, bells on the heather,_\n    _Reeds by the shady pool, lilies on the water:_\n    _Old  Tom Bombadil and the River-daughter!_\n\n5. While Tom is taking care of the ponies, he sings:\n\n    _Old Tom Bombadil is a merry fellow;_\n    _Bright blue his jacket is, and his boots are yellow._\n\n6. After supper, Tom explains why he was down by Old Man Willow:\n\n    _I had an errand there: gathering water-lilies,_\n    _green leaves and lilies white to please my pretty lady,_\n    _the last ere the year's end to keep them from the winter,_\n    _to flower by her pretty feet till the snows are melted._\n    _Each year at summer's end I go to find them for her,_\n    _in a wide pool, deep and clear, far down the Withywindle;_\n    _there they open first in spring and there they linger latest._\n    _By that pool long ago I found the River-daughter,_\n    _fair young Goldberry sitting in the rushes._\n    _Sweet was her singing then, and her heart was beating!_\n    _And that proved well for you-- for now I shall no longer_\n    _go down deep again along the forest-water,_\n    _not while the year is old. Nor shall I be passing_\n    _Old Man Willow's house this side of spring-time,_\n    _not till the merry spring, when the River-daughter_\n    _dances down the withy-path to bathe in the water._\n\n7. Tom teaches the hobbits what to sing if they get into trouble:\n\n    _Ho! Tom Bombadil, Tom Bombadillo!_\n    _By water, wood and hill, by the reed and willow,_\n    _By fire, sun and moon, hearken now and hear us!_\n    _Come, Tom Bombadil, for our need is near us!_\n\n8. After Frodo calls out the lines above, he hears Tom Bombadil singing\nthe following:\n\n    _Old Tom Bombadil is a merry fellow,_\n    _Bright blue his jacket is, and his boots are yellow._\n    _None has ever caught him yet, for Tom, he is the master:_\n    _His songs are stronger songs, and his feet are faster._\n\n9. Tom sings a sort of exorcism to banish the Barrow-wight:\n\n    _Get out, you old wight! Vanish in the sunlight!_\n    _Shrivel like the cold mist, like the winds go wailing,_\n    _Out into the barren lands far beyond the mountains!_\n    _Come never here again! Leave your barrow empty!_\n    _Lost and forgotten be, darker than the darkness,_\n    _Where gates stand for ever shut, till the world is mended._\n\n10. In order to revive Merry, Pippin, and Sam after getting them out of\nthe barrow, Tom chants:\n\n    _Wake now my merry lads! Wake and hear me calling!_\n    _Warm now be heart and limb! The cold stone is fallen;_\n    _Dark door is standing wide; dead hand is broken._\n    _Night under Night is flown, and the Gate is open!_\n\n11. Tom Bombadil then goes looking for the hobbits' ponies, calling:\n\n    _Hey! now! Come hoy now! Wither do you wander?_\n    _Up, down, near or far, here, there or yonder?_\n    _Sharp-ears, Wise-nose, Swish-tail and Bumpkin,_\n    _White-socks my little lad, and old Fatty Lumpkin!_\n\n12. Once Tom has led the hobbits to the Road, he declines to accompany\nthem further, saying:\n\n    _Tom's country ends here: he will not pass the borders._\n    _Tom has his house to mind, and Goldberry is waiting!_\n\nit:Aiuto Tom Bombadil!"
  },
  {
    "title": "Wight's Chant",
    "page_id": "6083",
    "text": "The WIGHT'S CHANT is an incantation sung by the Barrow-wight when Frodo\nBaggins, Meriadoc Brandybuck, Peregrin Took, and Sam Gamgee are trapped\nin its barrow. When Frodo first hears it, it's a song of horrible sounds\nand cold words that chill him to the bones.\n\nThe reference near the end to the “dark lord” refers to Sauron and his\nassumed dominion-to-come, who, sensibly, therefore must have had power\nover the wights.\n"
  },
  {
    "title": "Aldunenië",
    "page_id": "16741",
    "text": "The ALDUNENIË, otherwise known as The ALDUDENIË, is an Elven song. \nA work created by the Vanya Elemmírë to commemorate the destruction of\nthe Two Trees and the Darkening of Valinor , as well as the other\nfateful deeds of that pivotal day in the World's history. The sad tale,\nwhose name translates from Quenya as 'Lament for the Two Trees', was\nsaid to be known by all the Eldar.\n\nIt is not known for sure whether Elemmírë witnessed the darkening with\nhis own eyes, but as a Vanya he was most likely present on the slopes of\nTaniquetil when the light of Valinor was extinguished."
  },
  {
    "title": "Sam's Rhyme of the Troll",
    "page_id": "6161",
    "text": "Sam's Rhyme of the Troll is sung to an old tune by Sam Gamgee when he,\nFrodo Baggins, Meriadoc Brandybuck, Peregrin Took, and Strider find the\ntrolls that were changed into stone in The Hobbit, when they were caught\nby the sun arguing over how to cook thirteen dwarves and one hobbit. Sam\ndoesn't tell the others where he learned the song but Frodo maintains\nthat Sam made it up himself.\n\nTolkien himself made a RECORDING of the song, with a slight variation on\nthe lyrics.\n\n\nLyrics\n\n    _Trolls sat alone on thier seats of stone,_\n    _And munched and mumbled a bare old bone;_\n\n        _For many a year they had gnawed it near,_\n\n            _For meat was hard to come by._\n\n                _Done by! Gum by!_\n\n        _In a cave in the hills they dwelt alone,_\n\n            _And meat was hard to come by._\n\n&nbsp;\n\n    _Up came Tom with his big boots on._\n    _Said he to Troll: 'Pray, what is yon?_\n\n        _For it looks like the shin o' my nuncle Tim,_\n\n            _As should be a-lyin' in graveyard._\n\n                _Caveyard! Paveyard!_\n\n        _This many a year has Tom been gone,_\n\n            _And I thought he were lyin' in graveyard.'_\n\n&nbsp;\n\n    _'My lad,' said Troll, 'this bone I stole._\n    _But what be bones that lie in hole?_\n\n        _Thy nuncle was dead as a lump o' lead,_\n\n            _Afore I found his shinbone._\n\n                _Tinbone! Thinbone!_\n\n        _He can spare a share for a poor old troll,_\n\n            _For he don't need his shinbone.'_\n\n&nbsp;\n\n    _Said Tom, 'I don't see why the likes o' thee_\n    _Without axin' leave should go makin' free_\n\n        _With the shank or the shin o' my father's kin;_\n\n            _So hand the old bone over!_\n\n                _Rover! Trover!_\n\n        _Though dead he be, it belongs to he;_\n\n            _So hand the old bone over!'_\n\n&nbsp;\n\n    _'For a couple of pins,' says Troll, and grins,_\n    _'I'll eat thee too, and gnaw thy shins._\n\n        _A bit o' fresh meat will go down sweet!_\n\n            _I'll try my teeth on thee now._\n\n                _Hee now! See now!_\n\n        _I'm tired o' gnawing old bones and skins;_\n\n            _I've a mind to dine on thee now.'_\n\n&nbsp;\n\n    _But just as he thought his dinner was caught,_\n    _He found his hands had hold of naught._\n\n        _Before he could mind, Tom slipped behind_\n\n            _And gave him the boot to larn him._\n\n                _Warn him! Darn him!_\n\n        _A bump o' the boot on the seat, Tom thought,_\n\n            _Would be the way to larn him._\n\n&nbsp;\n\n    _But harder than stone is the flesh and bone_\n    _Of a troll that sits in the hills alone._\n\n        _As well set your boot to the mountain's root,_\n\n            _For the seat of a troll don't feel it._\n\n                _Peel it! Heal it!_\n\n        _Old Troll laughed, when he heard Tom groan,_\n\n            _And he knew his toes could feel it._\n\n&nbsp;\n\n    _Tom's leg is game, since home he came,_\n    _And his bootless foot is lasting lame;_\n\n        _But Troll don't care, and he's still there_\n\n            _With the bone he boned from its owner._\n\n                _Doner! Boner!_\n\n        _Troll's old seat its still the same,_\n\n            _And the bone he boned from its owner!"
  },
  {
    "title": "Frodo's Lament for Gandalf",
    "page_id": "6383",
    "text": "Frodo's Lament for Gandalf was Frodo Baggins' attempt to put his grief\nat Gandalf's death into words while at Lórien. When he recited it to Sam\nGamgee, it didn't seem as lovely as it had in his mind, when he was\ninspired by elven voices. Sam was enthusiastic about it, however, he\nthought a verse about Gandalf's fireworks should have been added. He\ncomposed the last verse, which is why its rhyme-pattern is different.\n\nIn _The Fellowship of the Ring (film)_, the last verse, spoken by Sam,\nis the only part that's included.\n\n\nThe Song\n\n When evening in the Shire was grey his footsteps on the Hill were\nheard; before the dawn he went away on journey long without a word.\n\nFrom Wilderland to Western shore, from northern waste to southern hill,\nthrough dragon-lair and hidden door and darkling woods he walked at\nwill.\n\nWith Dwarf and Hobbit, Elves and Men, with mortal and immortal folk,\nwith bird on bough and beast in den, in their own secret tongues he\nspoke.\n\nA deadly sword, a healing hand, a back that bent beneath its load; a\ntrumpet-voice, a burning brand, a weary pilgrim on the road.\n\nA lord of wisdom throned he sat, swift in anger, quick to laugh; an old\nman in a battered hat who leaned upon a thorny staff.\n\nHe stood upon the bridge alone and Fire and Shadow both defied; his\nstaff was broken on the stone, in Khazad-dûm his wisdom died.\n\n    The finest rockets ever seen:\n    they burst in stars of blue and green,\n    or after thunder golden showers\n    came falling like a rain of flowers."
  },
  {
    "title": "Journey's End",
    "page_id": "45335",
    "text": "JOURNEY'S END (also known as _IN WESTERN LANDS_) was a song sung by\nSamwise Gamgee as he searched for Frodo in the Tower of Cirith Ungol.\n\n\nLyrics\n\n In western lands beneath the Sun the flowers may rise in Spring, the\ntrees may bud, the waters run, the merry finches sing. Or there maybe\n'tis cloudless night and swaying beeches bear the Elven-stars as jewels\nwhite amid their branching hair.\n\nThough here at journey's end I lie in darkness buried deep, beyond all\ntowers strong and high, beyond all mountains steep, above all shadows\nrides the Sun and Stars for ever dwell: I will not say the Day is done,\nnor bid the Stars farewell.\n"
  },
  {
    "title": "Bilbo's Last Song",
    "page_id": "281",
    "text": "BILBO'S LAST SONG is a poem by J. R. R. Tolkien.\n\n\nLyrics\n\n Day is ended, dim my eyes, but journey long before me lies. Farewell,\nfriends! I hear the call. The ship's beside the stony wall. Foam is\nwhite and waves are grey; beyond the sunset leads my way. Foam is salt,\nthe wind is free; I hear the rising of the Sea.\n\nFarewell, friends! The sails are set, the wind is east, the moorings\nfret. Shadows long before me lie, beneath the ever-bending sky, but\nislands lie behind the Sun that I shall raise ere all is done; lands\nthere are to west of West, where night is quiet and sleep is rest.\n\nGuided by the Lonely Star, beyond the utmost harbour-bar I'll find the\nhavens fair and free, and beaches of the Starlit Sea. Ship, my ship! I\nseek the West, and fields and mountains ever blest. Farewell to\nMiddle-earth at last. I see the Star above your mast!\n\n\nHistory\n\nBilbo's Last Song was given by Tolkien as a gift to his secretary Joy\nHill in 1966. After Tolkien's death in 1973, Hill showed the poem to\nDonald Swann, who liked the poem so much that he set it to music and\nincluded it in the second edition of The Road Goes Ever On in 1978. The\npoem was also illustrated by Pauline Baynes, and published as a poster\nin 1974. In 1990, the text was finally published in book form,\nre-illustrated by Baynes. Its original publisher was Houghton\nMifflin, then Allen & Unwin in 1992, and then by Dragonfly Books in\n1992. and a few others like Riverwood Publishing Inc.\n\nBilbo Baggins sings the poem at the harbours of the Grey Havens, as\nhe is about to set sail on the sea following the Straight Road to the\nUndying Lands. Although it was never written in _The Grey Havens_, the\nThe Lord of the Rings's last chapter, this places the reading of this\npoem by Bilbo at this point in the story."
  },
  {
    "title": "Blunt the Knives",
    "page_id": "27912",
    "text": "BLUNT THE KNIVES is sung by Thorin and Company after eating at Bilbo\nBaggins's house.\n\n\nSong\n\nThe original version of this song is sung by the Company of Thorin\nOakenshield while they clean up for Bilbo after supper.\n\n Chip the glasses and crack the plates! Blunt the knives and bend the\nforks! That's what Bilbo Baggins hates- Smash the bottles and burn the\ncorks! Cut the cloth and tread on the fat! Pour the milk on the pantry\nfloor! Leave the bones on the bedroom mat! Splash the wine on every\ndoor! Dump the crocks in a boiling bowl; Pound them up with a thumping\npole; And when you've finished, if any are whole, Send them down the\nhall to roll! That's what Bilbo Baggins hates! So, carefully! carefully\nwith the plates!\n"
  },
  {
    "title": "Fifteen birds in five fir-trees",
    "page_id": "45336",
    "text": "FIFTEEN BIRDS IN FIVE FIR-TREES is a song sung by the Goblins as they\nset fire to the trees that Bilbo, Gandalf and the Thirteen Dwarves are\nsheltering in, following their escape from the clutches of the Great\nGoblin.\n\n\nLyrics\n\n Fifteen birds in five fir-trees, their feathers were fanned in a fiery\nbreeze! what funny little birds, they had no wings! Oh what shall we do\nwith the funny little things? Roast 'em alive, or stew them in a pot;\nfry them, boil them and eat them hot?\n\nBurn, burn tree and fern! Shrivel and scorch! A fizzling torch To light\nthe night for our delight,\n\n       Ya hey!\n\nBake and toast 'em, fry and roast ’em! till beards blaze, and eyes\nglaze; till hair smells and skins crack, fat melts, and bones black\n\n        in cinders lie\n        beneath the sky!\n        So dwarves shall die,\n\nand light the night for our delight,\n\n        Ya hey!\n        Ya-harri-hey!\n        Ya hoy!\n"
  },
  {
    "title": "Old fat spider spinning in a tree!",
    "page_id": "45337",
    "text": "OLD FAT SPIDER SPINNING IN A TREE! was a song sung by Bilbo in\nMirkwood while trying to distract the giant Spiders in order to save\nThorin and the other Dwarves.\n\n\nLyrics\n\n Old fat spider spinning in a tree! Old fat spider can’t see me!\n\n         Attercop! Attercop!\n              Won't you stop,\n\nStop your spinning and look for me!\n\nOld Tomnoddy, all big body, Old Tomnoddy can’t spy me!\n\n         Attercop! Attercop!\n               Down you drop!\n\nYou'll never catch me up your tree!\n\nLazy Lob and crazy Cob are weaving webs to wind me. I am far more sweet\nthan other meat, but still they cannot find me!\n\nHere am I, naughty little fly; you are fat and lazy. You cannot trap me,\nthough you try, in your cobwebs crazy.\n"
  },
  {
    "title": "The King Beneath the Mountains",
    "page_id": "45387",
    "text": "THE KING BENEATH THE MOUNTAINS was a song sung by the people of\nLake-town upon the arrival of Thorin Oakenshield and the Company. It was\na prophecy made after the fall of Erebor and Dale about Thrór and\nThráin.\n\n\nLyrics\n\n The King beneath the mountains,\n\n   The King of carven stone,\n\nThe lord of silver fountains\n\n   Shall come into his own!\n\nHis crown shall be upholden,\n\n   His harp shall be restrung,\n\nHis halls shall echo golden\n\n   To songs of yore re-sung.\n\nThe woods shall wave on mountains\n\n   And grass beneath the sun;\n\nHis wealth shall flow in fountains\n\n   And the rivers golden run.\n\nThe streams shall run in gladness,\n\n   The lakes shall shine and burn,\n\nAll sorrow fail and sadness\n\n   At the Mountain-king's return!\n"
  },
  {
    "title": "Tom Bombadil's Songs",
    "page_id": "6074",
    "text": "TOM BOMBADIL'S SONGS are in the index of The Lord of the Rings, all\nlisted as one continuous song. The first part is what Frodo Baggins and\nSam Gamgee hear while Meriadoc Brandybuck and Peregrin Took are stuck in\nOld Man Willow in the Old Forest:\n\n    _Hey dol! merry dol! ring a dong dillo!_\n    _Ring a dong! hop along! Fal lal the willow!_\n    _Tom Bom, jolly Tom, Tom Bombadillo!_\n\n1. The hobbits then hear a string of apparently nonsense-words followed\nby:\n\n    _Hey! Come merry dol! derry dol! My darling!_\n    _Light goes the weather-wind and the feathered starling._\n    _Down along under Hill, shining in the sunlight,_\n    _Waiting on the doorstep for the cold starlight,_\n    _There my pretty lady is, River-woman's daughter,_\n    _Slender as the willow-wand, clearer than the water._\n    _Old Tom Bombadil water-lilies bringing_\n    _Comes hopping home again. Can you hear him singing?_\n    _Hey! Come merry dol! derry dol! and merry-o!_\n    _Goldberry__, Goldberry, merry yellow berry-o!_\n    _Poor old Willow-man, you tuck your roots away!_\n    _Tom's in a hurry now. Evening will follow day._\n    _Tom's going home again water-lilies bringing._\n    _Hey! Come derry dol! Can you hear me singing?_\n\n2. After Tom has freed Merry and Pippin, he goes on ahead to his house,\noutdistancing the hobbits. He sings this back to them:\n\n    _Hop along, my little friends, up the Withywindle!_\n    _Tom's going on ahead candles for to kindle._\n    _Down west sinks the Sun: soon you will be groping._\n    _When the night-shadows fall, then the door will open,_\n    _Out of the window-panes light will twinkle yellow._\n    _Fear no alder black! Heed no hoary willow!_\n    _Fear neighter root nor bough! Tom goes on before you._\n    _Hey now! merry dol! We'll be waiting for you!_\n\n3. Once the hobbits can see the house, they hear:\n\n    _Hey! Come derry dol! Hop along, my hearties!_\n    _Hobbits! Ponies all! We are fond of parties._\n    _Now let the fun begin! Let us sing together!_\n\n4. At this point, Goldberry joins in with:\n\n    _Now let the song begin! Let us sing together!_\n    _Of sun, stars, moon and mist, rain and cloudy weather,_\n    _Light on the budding leaf, dew on the feather,_\n    _Wind on the open hill, bells on the heather,_\n    _Reeds by the shady pool, lilies on the water:_\n    _Old  Tom Bombadil and the River-daughter!_\n\n5. While Tom is taking care of the ponies, he sings:\n\n    _Old Tom Bombadil is a merry fellow;_\n    _Bright blue his jacket is, and his boots are yellow._\n\n6. After supper, Tom explains why he was down by Old Man Willow:\n\n    _I had an errand there: gathering water-lilies,_\n    _green leaves and lilies white to please my pretty lady,_\n    _the last ere the year's end to keep them from the winter,_\n    _to flower by her pretty feet till the snows are melted._\n    _Each year at summer's end I go to find them for her,_\n    _in a wide pool, deep and clear, far down the Withywindle;_\n    _there they open first in spring and there they linger latest._\n    _By that pool long ago I found the River-daughter,_\n    _fair young Goldberry sitting in the rushes._\n    _Sweet was her singing then, and her heart was beating!_\n    _And that proved well for you-- for now I shall no longer_\n    _go down deep again along the forest-water,_\n    _not while the year is old. Nor shall I be passing_\n    _Old Man Willow's house this side of spring-time,_\n    _not till the merry spring, when the River-daughter_\n    _dances down the withy-path to bathe in the water._\n\n7. Tom teaches the hobbits what to sing if they get into trouble:\n\n    _Ho! Tom Bombadil, Tom Bombadillo!_\n    _By water, wood and hill, by the reed and willow,_\n    _By fire, sun and moon, hearken now and hear us!_\n    _Come, Tom Bombadil, for our need is near us!_\n\n8. After Frodo calls out the lines above, he hears Tom Bombadil singing\nthe following:\n\n    _Old Tom Bombadil is a merry fellow,_\n    _Bright blue his jacket is, and his boots are yellow._\n    _None has ever caught him yet, for Tom, he is the master:_\n    _His songs are stronger songs, and his feet are faster._\n\n9. Tom sings a sort of exorcism to banish the Barrow-wight:\n\n    _Get out, you old wight! Vanish in the sunlight!_\n    _Shrivel like the cold mist, like the winds go wailing,_\n    _Out into the barren lands far beyond the mountains!_\n    _Come never here again! Leave your barrow empty!_\n    _Lost and forgotten be, darker than the darkness,_\n    _Where gates stand for ever shut, till the world is mended._\n\n10. In order to revive Merry, Pippin, and Sam after getting them out of\nthe barrow, Tom chants:\n\n    _Wake now my merry lads! Wake and hear me calling!_\n    _Warm now be heart and limb! The cold stone is fallen;_\n    _Dark door is standing wide; dead hand is broken._\n    _Night under Night is flown, and the Gate is open!_\n\n11. Tom Bombadil then goes looking for the hobbits' ponies, calling:\n\n    _Hey! now! Come hoy now! Wither do you wander?_\n    _Up, down, near or far, here, there or yonder?_\n    _Sharp-ears, Wise-nose, Swish-tail and Bumpkin,_\n    _White-socks my little lad, and old Fatty Lumpkin!_\n\n12. Once Tom has led the hobbits to the Road, he declines to accompany\nthem further, saying:\n\n    _Tom's country ends here: he will not pass the borders._\n    _Tom has his house to mind, and Goldberry is waiting!_\n\nit:Aiuto Tom Bombadil!"
  },
  {
    "title": "Sam's Rhyme of the Troll",
    "page_id": "6161",
    "text": "Sam's Rhyme of the Troll is sung to an old tune by Sam Gamgee when he,\nFrodo Baggins, Meriadoc Brandybuck, Peregrin Took, and Strider find the\ntrolls that were changed into stone in The Hobbit, when they were caught\nby the sun arguing over how to cook thirteen dwarves and one hobbit. Sam\ndoesn't tell the others where he learned the song but Frodo maintains\nthat Sam made it up himself.\n\nTolkien himself made a RECORDING of the song, with a slight variation on\nthe lyrics.\n\n\nLyrics\n\n    _Trolls sat alone on thier seats of stone,_\n    _And munched and mumbled a bare old bone;_\n\n        _For many a year they had gnawed it near,_\n\n            _For meat was hard to come by._\n\n                _Done by! Gum by!_\n\n        _In a cave in the hills they dwelt alone,_\n\n            _And meat was hard to come by._\n\n&nbsp;\n\n    _Up came Tom with his big boots on._\n    _Said he to Troll: 'Pray, what is yon?_\n\n        _For it looks like the shin o' my nuncle Tim,_\n\n            _As should be a-lyin' in graveyard._\n\n                _Caveyard! Paveyard!_\n\n        _This many a year has Tom been gone,_\n\n            _And I thought he were lyin' in graveyard.'_\n\n&nbsp;\n\n    _'My lad,' said Troll, 'this bone I stole._\n    _But what be bones that lie in hole?_\n\n        _Thy nuncle was dead as a lump o' lead,_\n\n            _Afore I found his shinbone._\n\n                _Tinbone! Thinbone!_\n\n        _He can spare a share for a poor old troll,_\n\n            _For he don't need his shinbone.'_\n\n&nbsp;\n\n    _Said Tom, 'I don't see why the likes o' thee_\n    _Without axin' leave should go makin' free_\n\n        _With the shank or the shin o' my father's kin;_\n\n            _So hand the old bone over!_\n\n                _Rover! Trover!_\n\n        _Though dead he be, it belongs to he;_\n\n            _So hand the old bone over!'_\n\n&nbsp;\n\n    _'For a couple of pins,' says Troll, and grins,_\n    _'I'll eat thee too, and gnaw thy shins._\n\n        _A bit o' fresh meat will go down sweet!_\n\n            _I'll try my teeth on thee now._\n\n                _Hee now! See now!_\n\n        _I'm tired o' gnawing old bones and skins;_\n\n            _I've a mind to dine on thee now.'_\n\n&nbsp;\n\n    _But just as he thought his dinner was caught,_\n    _He found his hands had hold of naught._\n\n        _Before he could mind, Tom slipped behind_\n\n            _And gave him the boot to larn him._\n\n                _Warn him! Darn him!_\n\n        _A bump o' the boot on the seat, Tom thought,_\n\n            _Would be the way to larn him._\n\n&nbsp;\n\n    _But harder than stone is the flesh and bone_\n    _Of a troll that sits in the hills alone._\n\n        _As well set your boot to the mountain's root,_\n\n            _For the seat of a troll don't feel it._\n\n                _Peel it! Heal it!_\n\n        _Old Troll laughed, when he heard Tom groan,_\n\n            _And he knew his toes could feel it._\n\n&nbsp;\n\n    _Tom's leg is game, since home he came,_\n    _And his bootless foot is lasting lame;_\n\n        _But Troll don't care, and he's still there_\n\n            _With the bone he boned from its owner._\n\n                _Doner! Boner!_\n\n        _Troll's old seat its still the same,_\n\n            _And the bone he boned from its owner!"
  },
  {
    "title": "Frodo's Lament for Gandalf",
    "page_id": "6383",
    "text": "Frodo's Lament for Gandalf was Frodo Baggins' attempt to put his grief\nat Gandalf's death into words while at Lórien. When he recited it to Sam\nGamgee, it didn't seem as lovely as it had in his mind, when he was\ninspired by elven voices. Sam was enthusiastic about it, however, he\nthought a verse about Gandalf's fireworks should have been added. He\ncomposed the last verse, which is why its rhyme-pattern is different.\n\nIn _The Fellowship of the Ring (film)_, the last verse, spoken by Sam,\nis the only part that's included.\n\n\nThe Song\n\n When evening in the Shire was grey his footsteps on the Hill were\nheard; before the dawn he went away on journey long without a word.\n\nFrom Wilderland to Western shore, from northern waste to southern hill,\nthrough dragon-lair and hidden door and darkling woods he walked at\nwill.\n\nWith Dwarf and Hobbit, Elves and Men, with mortal and immortal folk,\nwith bird on bough and beast in den, in their own secret tongues he\nspoke.\n\nA deadly sword, a healing hand, a back that bent beneath its load; a\ntrumpet-voice, a burning brand, a weary pilgrim on the road.\n\nA lord of wisdom throned he sat, swift in anger, quick to laugh; an old\nman in a battered hat who leaned upon a thorny staff.\n\nHe stood upon the bridge alone and Fire and Shadow both defied; his\nstaff was broken on the stone, in Khazad-dûm his wisdom died.\n\n    The finest rockets ever seen:\n    they burst in stars of blue and green,\n    or after thunder golden showers\n    came falling like a rain of flowers."
  },
  {
    "title": "Down the swift dark stream you go",
    "page_id": "7778",
    "text": "DOWN THE SWIFT DARK STREAM YOU GO is a song from J.R.R. Tolkien's _The\nHobbit_, it is sung by the Mirkwood Elves as they send barrels down the\nriver back to Lake-town. This song can also be heard in the animated\nversion of _The Hobbit_.\n\n\nLyrics\n\n    _Roll-roll-roll-roll,_\n    _roll-roll-rolling down the hole!_\n    _Heave ho! Splash plump!_\n    _Down they go, down they bump!_\n\n&nbsp;\n\n    _Down the swift dark stream you go_\n    _Back to lands you once did know!_\n    _Leave the halls and caverns deep,_\n    _Leave the northern mountains steep,_\n    _Where the forest wide and dim_\n    _Stoops in shadow grey and grim!_\n    _Float beyond the world of trees_\n    _Out into the whispering breeze,_\n    _Past the rushes, past the reeds,_\n    _Past the marsh’s waving weeds,_\n    _Through the mist that riseth white_\n    _Up from mere and pool at night!_\n    _Follow, follow stars that leap_\n    _Up the heavens cold and steep;_\n    _Turn when dawn comes over land_\n    _Over rapid, Over sand,_\n    _South away! And South away!_\n    _Seek the sunlight and the day,_\n    _Back to pasture, back to mead,_\n    _Where the kine and oxen feed!_\n    _Back to gardens on the hills_\n    _Where the berry swells and fills_\n    _Under sunlight, under day!_\n    _South away! and South away!_\n    _Down the swift dark stream you go_\n    _Back to lands you once did know!_"
  },
  {
    "title": "I Sit Beside the Fire and Think",
    "page_id": "7789",
    "text": "I SIT BESIDE THE FIRE AND THINK is a song found in J.R.R Tolkien's _The\nFellowship of the Ring_. Bilbo Baggins sings it in Rivendell, a few days\nbefore Frodo leaves.\n\n\nLyrics\n\n_I sit beside the fire and think_\n_of all that I have seen,_\n_of meadow-flowers and butterflies_\n_in summers that have been;_\n_Of yellow leaves and gossamer_\n_in autumns that there were,_\n_with morning mist and silver sun_\n_and wind upon my hair._\n\n_I sit beside the fire and think_\n_of how the world will be_\n_when winter comes without a spring_\n_that I shall ever see_\n_For still there are so many things_\n_that I have never seen:_\n_in every wood in every spring_\n_there is a different green._\n_I sit beside the fire and think_\n_of people long ago,_\n_and people who will see a world_\n_that I shall never know._\n_But all the while I sit and think_\n_of times there were before,_\n_I listen for returning feet_\n_and voices at the door._"
  },
  {
    "title": "Journey's End",
    "page_id": "45335",
    "text": "JOURNEY'S END (also known as _IN WESTERN LANDS_) was a song sung by\nSamwise Gamgee as he searched for Frodo in the Tower of Cirith Ungol.\n\n\nLyrics\n\n In western lands beneath the Sun the flowers may rise in Spring, the\ntrees may bud, the waters run, the merry finches sing. Or there maybe\n'tis cloudless night and swaying beeches bear the Elven-stars as jewels\nwhite amid their branching hair.\n\nThough here at journey's end I lie in darkness buried deep, beyond all\ntowers strong and high, beyond all mountains steep, above all shadows\nrides the Sun and Stars for ever dwell: I will not say the Day is done,\nnor bid the Stars farewell.\n"
  },
  {
    "title": "A Drinking Song",
    "page_id": "6070",
    "text": "A Drinking Song is sung by Frodo Baggins, Samwise Gamgee, and Peregrin\nTook after lunch the day after they meet Gildor and the Elves on their\nway to Crickhollow. The Elves had filled the hobbits' water bottles with\na honey-scented, pale gold drink that was very invigorating. Just after\nthe song, they first hear the calls of the Black Riders.\nA few lines of this song are sung by Merry and Pippin in The Green\nDragon Inn in the expanded version of The Fellowship of the Ring (film).\n\n\nLyrics\n\n    Ho! Ho! Ho! to the bottle I go\n    To heal my heart and drown my woe.\n    Rain may fall and wind may blow,\n    And many miles be still to go,\n    But under a tall tree I will lie,\n    And let the clouds go sailing by."
  },
  {
    "title": "The Bath Song",
    "page_id": "6071",
    "text": "The Bath Song, apparently one of Bilbo's favorite bath-songs, is sung by\nPeregrin Took in Crickhollow while he, Sam Gamgee, and Frodo Baggins are\nbathing.\nThree lines from the second verse are sung by Merry and Pippin in The\nGreen Dragon Inn in the expanded version of The Fellowship of the Ring\n(film).\n\n    Sing hey! for the bath at close of day\n    that washes the weary mud away!\n    A loon is he that will not sing:\n    O! Water Hot is a noble thing!\n\n&nbsp;\n\n    O! Sweet is the sound of falling rain,\n    and the brook that leaps from hill to plain;\n    but better than rain or rippling streams\n    is Water Hot that smokes and steams.\n\n&nbsp;\n\n    O! Water cold we may pour at need\n    down a thirsty throat and be glad indeed;\n    but better is Beer if drink we lack,\n    and Water Hot poured down the back.\n\n&nbsp;\n\n    O! Water is fair that leaps on high\n    in a fountain white beneath the sky;\n    but never did fountain sound so sweet\n    as splashing Hot Water with my feet!\n\n(Apparently Pippin added visual effects to the last verse, creating his\nown fountain of bath water and startling Frodo.)"
  },
  {
    "title": "Song in the Woods",
    "page_id": "6073",
    "text": "The SONG IN THE WOODS is sung by Frodo Baggins as he, Meriadoc\nBrandybuck, Peregrin Took, and Sam Gamgee are making their way through\nthe Old Forest on the edge of the Shire. The trees of the Old Forest\ndidn't seem to like the song.\n\n\nThe Song\n\n O! Wanderers in the shadowed land despair not! For though dark they\nstand, all woods there be must end at last, and see the open sun go\npast: the setting sun, the rising sun, the day's end, or the day begun.\nFor east or west all woods must fail...\n"
  },
  {
    "title": "Song of Beren and Lúthien",
    "page_id": "6085",
    "text": "The SONG OF BEREN AND LÚTHIEN was sung by Aragorn at the camp at\nWeathertop to distract Frodo Baggins, Meriadoc Brandybuck, Peregrin\nTook, and Sam Gamgee from their fears. Aragorn tells the hobbits that\nthe song is in the _ann-thennath_ mode in the Elvish tongue and that the\nWestron version is nowhere near as lovely. He also says that no one,\nexcept Elrond, remembers the end of the tale correctly anymore.\n\n\nThe Song\n\n The leaves were long, the grass was green, The hemlock-umbels tall and\nfair, And in the glade a light was seen Of stars in shadow shimmering.\nTinúviel was dancing there To music of a pipe unseen, And light of stars\nwas in her hair, And in her raiment glimmering.\n\nThere Beren came from mountains cold, And lost he wandered under leaves,\nAnd where the Elven-river rolled He walked alone and sorrowing. He\npeered between the hemlock-leaves And saw in wonder flowers of gold Upon\nher mantle and her sleeves, And her hair like shadow following.\n\nEnchantment healed his weary feet That over hills were doomed to roam;\nAnd forth he hastened, strong and fleet, And grasped at moonbeams\nglistening. Through woven woods in Elvenhome She lightly fled on dancing\nfeet, And left him lonely still to roam In the silent forest listening.\n\nHe heard there oft the flying sound Of feet as light as linden-leaves,\nOr music welling underground, In hidden hollows quavering. Now withered\nlay the hemlock-sheaves, And one by one with sighing sound Whispering\nfell the beechen leaves In the wintry woodland wavering.\n\nHe sought her ever, wandering far Where leaves of years were thickly\nstrewn, By light of moon and ray of star In frosty heavens shivering.\nHer mantle glinted in the moon, As on a hilltop high and far She danced,\nand at her feet was strewn A mist of silver quivering.\n\nWhen winter passed, she came again, And her song released the sudden\nspring, Like rising lark, and falling rain, And melting water bubbling.\nHe saw the elven-flowers spring About her feet, and healed again He\nlonged by her to dance and sing Upon the grass untroubling.\n\nAgain she fled, but swift he came. Tinúviel! Tinúviel! He called her by\nher elvish name, And there she halted listening. One moment stood she,\nand a spell His voice laid on her: Beren came, And doom fell on Tinúviel\nThat in his arms lay glistening.\n\nAs Beren looked into her eyes Within the shadows of her hair, The\ntrembling starlight of the skies He saw there mirrored shimmering.\nTinúviel the elven-fair, Immortal maiden elven-wise, About him cast her\nshadowy hair And arms like silver glimmering.\n\nLong was the way that fate them bore, O'er stony mountains cold and\ngrey, Through halls of iron and darkling door, And woods of nightshade\nmorrowless. The Sundering Seas between them lay, And yet at last they\nmet once more, And long ago they passed away In the forest singing\nsorrowless.\n"
  },
  {
    "title": "Song of Eärendil",
    "page_id": "6248",
    "text": "SONG OF EÄRENDIL is a song written primarily by Bilbo Baggins, though\nhis friend Aragorn helps with a few lines. He sings it in Rivendell's\nHall of Fire after the feast celebrating Frodo Baggins's recovery from\nhis Weathertop wound. Apparently, Bilbo had asked his listeners to guess\nwhich parts he wrote and which were Aragorn's work; the Elves gathered\naround request a second recital of the song in order to make their\nguess, as “It is not easy for us to tell the difference between two\nmortals,” much to Bilbo's dismay. He later tells Frodo that Aragorn\nmerely insisted on putting in a green stone and that the rest was his\nown work. Aragorn also commented that “if I (Bilbo) had the cheek to\nmake verses about Eärendil in the house of Elrond, it was my (Bilbo's)\naffair.”\n\n\nThe Song\n\n Eärendil was a mariner that tarried in Arvernien; he built a boat of\ntimber felled in Nimbrethil to journey in; her sails he wove of silver\nfair, of silver were her lanterns made, her prow was fashioned like a\nswan, and light upon her banners laid.\n\nIn panoply of ancient kings, in chainéd rings he armoured him; his\nshining shield was scored with runes to ward all wounds and harm from\nhim; his bow was made of dragon-horn, his arrows shorn of ebony, of\nsilver was his habergeon, his scabbard of chalcedony; his sword of steel\nwas valiant, of adamant his helmet tall, an eagle-plume upon his crest,\nupon his breast an emerald.\n\nBeneath the Moon and under star he wandered far from northern strands,\nbewildered on enchanted ways beyond the days of mortal lands. From\ngnashing of the Narrow Ice where shadow lies on frozen hills, from\nnether heats and burning waste he turned in haste, and roving still on\nstarless waters far astray at last he came to Night of Naught, and\npassed, and never sight he saw of shining shore nor light he sought. The\nwinds of wrath came drving him, and blindly in the foam he fled from\nwest to east and errandless, unheralded he homeward sped.\n\nThere flying Elwing came to him, and flame was in the darkness lit; more\nbright than light of diamond the fire upon her carcanet. The Silmaril\nshe bound on him and crowned him with the living light and dauntless\nthen with burning brow he turned his prow; and in the night from\nOtherworld beyond the Sea there strong and free a storm arose, a wind of\npower in Tarmenel; by paths that seldom mortal goes his boat it bore\nwith biting breath as might of death across the grey and long-forsaken\nseas distressed: from east to west he passed away.\n\nThrough Evernight he back was borne on black and roaring waves that ran\no'er leagues unlit and foundered shores that drowned before the Days\nbegan, until he heard on strands of pearl where ends the world the music\nlong, where ever-foaming billows roll the yellow gold and jewels wan.\n\nHe saw the Mountain silent rise where twilight lies upon the knees of\nValinor, and Eldamar beheld afar beyond the seas. A wanderer escaped\nfrom night to haven white he came at last, to Elvenhome the green and\nfair where keen the air, where pale as glass beneath the Hill of Ilmarin\na-glimmer in a valley sheer the lamplit towers of Tirion are mirrored on\nthe Shadowmere.\n\nHe tarried there from errantry, and melodies they taught to him, and\nsages old him marvels told, and harps of gold they brought to him. They\nclothed him then in elven-white, and seven lights before him sent, as\nthrough the Calacirian to hidden land forlorn he went. He came unto the\ntimeless halls where shining fall the countless year, and endless reigns\nthe Elder King in Ilmarin on Mountain sheer; and words unheard were\nspoken then of folk of Men and Elven-kin, beyond the world were visions\nshowed forbid to those that dwell therein.\n\nA ship then new they built for him of mithril and of elven-glass with\nshining prow; no shaven oar nor sail she bore on silver mas: the\nSilmaril as lantern light and banner bright with living flame to gleam\nthereon by Elbereth herself was set, who thither came and wings immortal\nmade for him, and laid on him undying doom, to sail the shoreless skies\nand come behind the Sun and light of Moon.\n\nFrom Evereven's lofty hills where softly silver fountains fall his wings\nhim bore, a wandering light, beyond the mighty Mountain Wall. From\nWorld's End then he turned away, and yearned again to find afar his home\nthrough shadow journeying, and burning as an island star on high above\nthe mists he came, a distant flame before the Sun, a wonder ere the\nwaking dawn where grey the Norland waters run.\n\nAnd over Middle-earth he passed and heard at last the weeping sore of\nwomen and of elven-maids in Elder Days, in years of yore. But on him\nmighty doom was laid, till Moon should fade, an orbéd star to pass, and\ntarry never more on Hither Shores where mortals are; for ever still a\nherald on an errand that should never rest to bear his shining lamp\nafar, the Flammifer of Westernesse."
  },
  {
    "title": "Bregalad's Song",
    "page_id": "6263",
    "text": "Bregalad's Song is sung by the Ent Bregalad, who was also called\nQuickbeam. The song is a lament for the rowan trees that he loved which\nwere cut down by Orcs. He sings Meriadoc Brandybuck and Peregrin Took to\nsleep the first night of the Entmoot with this song.\nA few lines of this song are given to Treebeard in The Two Towers\n(film). He is reciting poetry to Merry and Pippin as he carries them to\nhis home, Wellinghall, and they fall asleep in his branches.\n\n    O Orofarnë, Lassemista, Carnimírië!\n    O rowan fair, upon your hair how white the blossom lay!\n    O rowan mine, I saw you shine upon a summer's day,\n    Your rind so bright, your leaves so light, your voice so cool and\n    soft:\n    Upon your head how golden-red the crown you bore aloft!\n    O rowan dead, upon your head your hair is dry and grey;\n    Your crown is spilled, your voice is stilled for ever and a day.\n    O Orofarnë, Lassemista, Carnimírië!"
  },
  {
    "title": "The Ents' Marching Song",
    "page_id": "6267",
    "text": "THE ENTS' MARCHING SONG is what the Ents sang as they came out of\nFangorn Forest heading off to assault Isengard. They kept time with\ntheir hands, and marched to the beat. A few of the words are in the\nEntish language.\n\n    We come, we come with roll of drum: ta-runda runda runda rom!\n    We come, we come with horn and drum: ta-rūna rūna rūna rom!\n    To Isengard! Though Isengard be ringed and barred with doors of\n    stone;\n    Though Isengard be strong and hard, as cold as stone and bare as\n    bone,\n    We go, we go, we go to war, to hew the stone and break the door;\n    For bole and bough are burning now, the furnace roars - we go to\n    war!\n    To land of gloom with tramp of doom, with roll of drum, we come, we\n    come;\n    To Isengard with doom we come!\n    With doom we come, with doom we come!"
  },
  {
    "title": "Gandalf's Song of Lórien",
    "page_id": "6307",
    "text": "GANDALF'S SONG OF LÓRIEN is Gandalf the White's retort to Gríma\nWormtongue after Gríma Wormtongue insults Galadriel, referring to her as\n“the Sorceress of the Golden Wood” and saying that “webs of deceit were\never woven” there. Immediately after singing his response, Gandalf\ntosses aside his cloak and revealing that he is now Gandalf the White,\nrather than Gandalf the Grey.\n\n In Dwimordene, in Lórien Seldom have walked the feet of Men, Few mortal\neyes have seen the light That lies there ever, long and bright.\nGaladriel! Galadriel! Clear is the water of your well; White is the star\nin your white hand; Unmarred, unstained is leaf and land In Dwimordene,\nin Lórien More fair than thoughts of Mortal Men.\n"
  },
  {
    "title": "Song of Durin",
    "page_id": "6414",
    "text": "The Song of Durin was sung by Gimli to the Fellowship of the Ring as\nthey journeyed through Moria. It was the second night of their trip\nthrough Moria and Sam Gamgee had just referred to it as “darksome\nholes.” Gimli sang the Song of Durin, extolling the history of\nKhazad-dûm, in response.\n\n    The world was young, the mountains green,\n    No stain yet on the Moon was seen,\n    No words were laid on stream or stone\n    When Durin woke and walked alone.\n    He named the nameless hills and dells;\n    He drank from yet untasted wells;\n    He stooped and looked in Mirrormere,\n    And saw a crown of stars appear,\n    As gems upon a silver thread,\n    Above the shadows of his head.\n\n&nbsp;\n\n    The world was fair, the mountains tall,\n    In Elder Days before the fall\n    Of mighty kings in Nargothrond\n    And Gondolin, who now beyond\n    The Western Seas have passed away:\n    The world was fair in Durin's Day.\n\n&nbsp;\n\n    A king he was on carven throne\n    In many-pillared halls of stone\n    With golden roof and silver floor,\n    And runes of power upon the door.\n    The light of sun and star and moon\n    In shining lamps of crystal hewn\n    Undimmed by cloud or shade of night\n    There shone for ever fair and bright.\n\n&nbsp;\n\n    There hammer on the anvil smote,\n    There chisel clove, and graver wrote;\n    There forged was blade, and bound was hilt;\n    The delver mined, the mason built.\n    There beryl, pearl, and opal pale,\n    And metal wrought like fishes' mail,\n    Buckler and corslet, axe and sword,\n    And shining spears were laid in hoard.\n\n&nbsp;\n\n    Unwearied then were Durin's folk;\n    Beneath the mountains music woke:\n    The harpers harped, the minstrels sang,\n    And at the gates the trumpets rang.\n\n&nbsp;\n\n    The world is grey, the mountains old,\n    The forge's fire is ashen-cold;\n    No harp is wrung, no hammer falls:\n    The darkness dwells in Durin's halls;\n    The shadow lies upon his tomb\n    In Moria, in Khazad-dûm.\n    But still the sunken stars appear\n    In dark and windless Mirrormere;\n    There lies his crown in water deep,\n    Till Durin wakes again from sleep.\n\nno:No Durin's Sang\n\nit:Canto di Durin"
  },
  {
    "title": "Song of Gondor",
    "page_id": "22227",
    "text": "The SONG OF GONDOR was sung by Aragorn on his quest to rescue Merry and\nPippin from the Orcs. He sings it after the death of Boromir (who\nperished at Amon Hen whilst battling Uruk-Hai), and it showcases his\ngreat regard for Gondor. It is unknown whether or not the song is a\ncommon one amongst the Men of Gondor, or whether Aragorn developed it\nhimself.\n\n Gondor! Gondor, between the Mountains and the Sea! West Wind blew\nthere; the light upon the Silver Tree Fell like bright rain in gardens\nof the Kings of old. O proud walls! White towers! O winged crown and\nthrone of gold! O Gondor, Gondor! Shall Men behold the Silver Tree, Or\nWest Wind blow again between the Mountains and the Sea?\n"
  },
  {
    "title": "Legolas' Song of the Sea",
    "page_id": "31610",
    "text": "LEGOLAS' SONG OF THE SEA is sung by Legolas after the Battle of the\nBlack Gate about his longing for the Sea. He adds that if his Elven-lord\nThranduil allows, he will lead a part of his people to Ithilien. After\nthe song, Legolas went down the hill, followed by the rest of the\nFellowship.\n\n\nSong\n\n To the Sea, to the Sea! The white gulls are crying, The wind is\nblowing, and the white foam is flying. West, west away, the round sun is\nfalling. Grey ship, grey ship, do you hear them calling, The voices of\nmy people that have gone before me? I will leave, I will leave the woods\nthat bore me; For our days are ending and our years failing. I will pass\nthe wide waters lonely sailing. Long are the waves on the Last Shore\nfalling, Sweet are the voices in the Lost Isle calling, In Eressëa, in\nElvenhome that no man can discover, Where the leaves fall not: land of\nmy people for ever!\n"
  },
  {
    "title": "Éomer's Song",
    "page_id": "31614",
    "text": "ÉOMER'S SONG is a stave recited by Éomer upon the arrival of the\nCorsairs of Umbar arrived during the Battle of the Pelennor Fields.\n\n Out of doubt, out of dark to the day’s rising I came singing in the\nsun, sword unsheathing. To hope’s end I rode and to heart’s breaking:\nNow for wrath, now for ruin and a red nightfall!\n"
  },
  {
    "title": "Song of Nimrodel",
    "page_id": "31615",
    "text": "The SONG OF NIMRODEL is sung by Legolas on the banks of the river\nNimrodel. He said the song is sung in the woodland tongue, and some in\nRivendell sing it also. It is implied that the song does not end here\nwhen Legolas states he cannot sing anymore.\n\n\nThe Song\n\n An Elven-maid there was of old, A shining star by day: Her mantle white\nwas hemmed with gold, Her shoes of silver-grey.\n\nA star was bound upon her brows, A light was on her hair As sun upon the\ngolden boughs In Lórien the fair.\n\nHer hair was long, her limbs were white, And fair she was and free; And\nin the wind she went as light As leaf of linden-tree.\n\nBeside the falls of Nimrodel, By water clear and cool, Her voice as\nfalling silver fell Into the shining pool.\n\nWhere now she wanders none can tell, In sunlight or in shade; For lost\nof yore was Nimrodel And in the mountains strayed.\n\nThe elven-ship in haven grey Beneath the mountain-lee Awaited her for\nmany a day Beside the roaring sea.\n\nA wind by night in Northern lands Arose, and loud it cried, And drove\nthe ship from elven-strands Across the streaming tide.\n\nWhen dawn came dim the land was lost, The mountains sinking grey Beyond\nthe heaving waves that tossed Their plumes of blinding spray.\n\nAmroth beheld the fading shore Now low beyond the swell, And cursed the\nfaithless ship that bore Him far from Nimrodel.\n\nOf old he was an Elven-king, A lord of tree and glen, When golden were\nthe boughs in spring In fair Lothlórien.\n\nFrom helm to sea they saw him leap, As arrow from the string, And dive\ninto the water deep, As mew upon the wing.\n\nThe wind was in his flowing hair, The foam about him shone; Afar they\nsaw him strong and fair Go riding like a swan.\n\nBut from the West has come no word, And on the Hither Shore No tidings\nElven-folk have heard Of Amroth evermore."
  },
  {
    "title": "Song to Goldberry",
    "page_id": "31616",
    "text": "The SONG TO GOLDBERRY is sung by Frodo Baggins to Goldberry upon\narriving at the house of Tom Bombadil.\n\n O slender as a willow-want! O clearer than clear water! O reed by the\nliving pool! Fair river-daughter! O spring-time and summer-time, and\nspring again after! O wind on the waterfall, and the leaves’ laughter!\n"
  },
  {
    "title": "Song of Lebenin",
    "page_id": "31622",
    "text": "The SONG OF LEBENNIN is a song which recounts to Merry and Pippin about\nthe travels of Aragorn, Legolas, and Gimli over the plains of Lebennin.\nIt is sung by Legolas while in Minas Tirith.\n\n Silver flow the streams from Celos to Erui In the green fields of\nLebennin! Tall grows the grass there. In the wind from the Sea The white\nlilies sway, And the golden bells are shaken of mallos and alfirin In\nthe green fields of Lebennin, In the wind from the Sea!\n"
  },
  {
    "title": "Hobbits' Battle Song",
    "page_id": "33354",
    "text": "Book: _The Return of the King_\n\nChapter: _The Field of Cormallen_\n\n_'Long live the Halflings! Praise them with great praise!_\n\n_Cuio i Pheriain anann! Aglar'ni Pheriannath!_\n\n_Praise them with great praise, Frodo and Samwise!_\n\n_Daur a Berhael, Conin en Annû'n! Eglerio!_\n\n_Praise them!_\n\n_Eglerio!_\n\n_A laita te, laita te! Andave laituvalmet!_\n\n_Praise them!_\n\n_Cormacolindor, a laita tá'rienna!_\n\n_Praise them! The Ring-bearers, praise them with great praise!_'"
  },
  {
    "title": "Song of the Mounds of Mundburg",
    "page_id": "38437",
    "text": "The SONG OF THE MOUNDS OF MUNDBURG is a poem that was written by an\nunnamed poet of Rohan a few years after the Battle of the Pelennor\nFields. It was a memorial song written for those who fought and died in\nthe battle, and were buried in Mounds of Mundburg.\n\n\nLyrics\n\n  We heard of the horns in the hills ringing,\n  the swords shining in the South-kingdom,\n  Steeds went striding to the Stoningland\n  as wind in the morning. War was kindled.\n  There Théoden fell, Thengling mighty,\n  to his golden halls and green pastures\n  in the Northern fields never returning,\n  high lord of the host. Harding and Guthláf,\n  Dúnhere and Déorwine, doughty Grimbold,\n  Herefara and Herubrand, Horn and Fastred,\n  fought and fell there in a far country:\n  in the Mounds of Mundburg under mould they lie\n  with their league-fellows, lords of Gondor.\n  Neither Hirluin the Fair to the hills by the sea,\n  nor Forlong the Old to the flowering vales\n  ever, to Arnach, to his own country\n  returned in triumph; nor the tall bowmen,\n  Derufin and Duilin, to their dark waters,\n  meres of Morthond under mountain-shadows.\n  Death in the morning and at day's ending\n  lords took and lowly. Long now they sleep\n  under grass in Gondor by the Great River\n  Grey now as tears, gleaming silver,\n  red then it rolled, roaring water:\n  foam dyed with blood flamed at sunset;\n  as beacons mountains burned at evening;\n  red fell the dew in Rammas Echor.\n\nit:I Tumuli di Mundburg"
  },
  {
    "title": "Galadriel's Song of Lorien",
    "page_id": "40976",
    "text": "This is the song that Galadriel sang on the swan-ship before giving the\nFellowship their gifts.\n\n\nLyrics\n\n I sang of leaves, of leaves of gold, and leaves of gold there grew: Of\nwind i sang, a wind there came, and in the branches blew. Beyond the\nSun, beyond the Moon, the foam was on the Sea, And by the strands of\nIlmarin there grew a golden tree. Beneath the stars of Ever-eve in\nEldamar it shone, In Eldamar beside the walls of Elven Tirion. There\nlong the golden leaves have grown upon the branching years, While here\nbeyond the Sundering Seas now fall the Even-tears. O Lorien! The Winter\ncomes, the bare and leafless Day; The leaves are falling in the stream,\nthe River flows away. O Lorien! Too long I have dwelt upon this Hither\nShore And in a fading crown have twined the golden elanor. But if of\nships I now should sing, what ship would come to me, What ship would\nbear me ever back across so wide a Sea?"
  },
  {
    "title": "Farewell song of Merry and Pippin",
    "page_id": "44549",
    "text": "FAREWELL SONG OF MERRY AND PIPPIN was a song sung by by Merry and\nPippin.\n\nAfter it was settled at the cottage in Crickhollow that Merry, Pippin,\nand Sam knew of Frodo's quest and would be going with him, Merry and\nPippin began a song about the company's brief stay at Crickhollow before\nleaving the Shire. The song is described as _“made on the model of the\ndwarf-song that started Bilbo on his adventure long ago, and went to the\nsame tune.”_\n\nThough begun by Merry and Pippin, also Frodo, and possibly Sam, joined\nin the singing, as Frodo himself makes up the last sentence.\n\n\nWords\n\nFarewell we call to hearth and hall!\n\nThough wind may blow and rain may fall,\n\nWe must away ere break of day\n\nFar over the wood and mountain tall.\n\nTo Rivendell, where Elves yet dwell\n\nIn glades beneath the misty fell,\n\nThrough moor and waste we ride in haste,\n\nAnd whither then we cannot tell.\n\nWith foes ahead, behind us dread,\n\nBeneath the sky shall be our bed,\n\nUntil at last our toil be passed,\n\nOur journey done, our errand sped.\n\nWe must away! We must away!\n\nWe ride before the break of day!\n"
  },
  {
    "title": "Gollum's Song (book versions)",
    "page_id": "46249",
    "text": "'''Gollum's Song _'is a song written by J.R.R. Tolkien. It was sung by\nGollum in _The Lord of the Rings__ ''and _The Hobbit._\n\n\nLyrics\n\n“Gollum's Song” is sung by Gollum on several occasions. Part of\n“Gollum's song”''' '''can be found in _The Hobbit_. Gollum used it as a\nriddle when he and Bilbo had a riddle contest.\n\nAlive without breath; As cold as death; Never thirsting, ever drinking;\nClad in mail never clinking. Drowns on dry land, Thinks an island Is a\nmountain; Thinks a fountain Is a puff of air. So sleek, so fair! What a\njoy to meet! We only wish To catch a fish, So juicy-sweet!\n\nThe following lines were added to the beginning, probably made up on the\nspot, as Gollum led Frodo and Sam out of the Emyn Muil:\n\nThe cold hard lands, They bites our hands, They gnaws our feet. The\nrocks and stones Are like old bones All bare of meat. But stream and\npool Is wet and cool: So nice for feet! And now we wish--\n\nIn the films, an alternate but similar version is heard when Gollum\ncatches a fish in the Forbidden Pool:\n\nThe rock and pool Is nice and cool, So juicy-sweet! Our only wish, To\ncatch a fish, So juicy-sweet!"
  },
  {
    "title": "The Man in the Moon Stayed Up Too Late",
    "page_id": "3390",
    "text": "THE MAN IN THE MOON STAYED UP TOO LATE was a song composed by Bilbo\nBaggins. The title of this version is given in _The Adventures of Tom\nBombadil_.\n\n\nHistory\n\nIn the Inn at Bree, Frodo jumps on a table and recites this song, only\nreferred to as “a ridiculous song invented by Bilbo”.\n\n\nForm\n\nThere follows the tale, in thirteen ballad-like five-line stanzas,\nintroducing each element in turn: “the Man in the Moon” himself, the\nostler's “tipsy cat/that plays a five-stringed fiddle”, the little dog,\nthe “hornéd cow”.\n\nAs with many ballads of this form, it scans rather well to the tune of\nthe theme from “Gilligan's Island.” Which can be played to the guitar\nline of “Stairway to Heaven.” Such are the dangers of the folk form.\n\n\nLyrics\n\n There is an inn, a merry old inn beneath an old grey hill, And there\nthey brew a beer so brown That the Man in the Moon himself came down One\nnight to drink his fill.\n\nThe ostler has a tipsy cat that plays a five-stringed fiddle; And up and\ndown he runs his bow, Now squeaking high, now purring low, Now sawing in\nthe middle.\n\nThe landlord keeps a little dog that is mighty fond of jokes; When\nthere's good cheer among the guests, He cocks an ear at all the jests\nAnd laughs until he chokes.\n\nThey also keep a hornéd cow as proud as any queen; But music turns her\nhead like ale, And makes her wave her tufted tail and dance upon the\ngreen.\n\nAnd O! the rows of silver dishes and the store of silver spoons! For\nSunday there's a special pair, And these they polish up with care on\nSaturday afternoons.\n\nThe Man in the Moon was drinking deep, and the cat began to wail; A dish\nand a spoon on the table danced, The cow in the garden madly pranced,\nand the little dog chased his tail.\n\nThe Man in the Moon took another mug, and then rolled beneath his chair;\nAnd there he dozed and dreamed of ale, Till in the sky the stars were\npale, and dawn was in the air.\n\nThen the ostler said to his tipsy cat: 'The white horses of the Moon,\nThey neigh and champ their silver bits; But their master's been and\ndrowned his wits, and the Sun'll be rising soon!'\n\nSo the cat on his fiddle played hey-diddle-diddle, a jig that would wake\nthe dead: He squeaked and sawed and quickened the tune, While the\nlandlord shook the Man in the Moon: 'It's after three!' he said.\n\nThey rolled the Man slowly up the hill and bundled him into the Moon,\nWhile his horses galloped up in rear, And the cow came capering like a\ndeer, and a dish ran up with the spoon.\n\nNow quicker the fiddle went deedle-dum-diddle; the dog began to roar,\nThe cow and the horses stood on their heads; The guests all bounded from\ntheir beds and danced upon the floor.\n\nWith a ping and a pong the fiddle-strings broke! the cow jumped over the\nMoon, And the little dog laughed to see such fun, And the Saturday dish\nwent off at a run with the silver Sunday spoon.\n\nThe round Moon rolled behind the hill as the Sun raised up her head. She\nhardly believed her fiery eyes; For though it was day, to her surprise\nthey all went back to bed!\n"
  },
  {
    "title": "Athelas",
    "page_id": "3756",
    "text": "ATHELAS is a healing herb, also known as KINGSFOIL or ASËA ARANION,\nthat grew throughout Middle-earth.\n\n\nHistory\n\nAthelas was first brought to Middle-earth by Númenóreans, but by the end\nof the Third Age the knowledge of its healing properties was lost among\nall but the Rangers of the North and the Elves, and was commonly\nconsidered by most men and hobbits to be a useless weed. According to\nfolklore in Gondor, it is especially powerful in the hands of the king.\nIt was used by Aragorn when he secretly entered Minas Tirith upon his\nreturn to Gondor to heal those (such as Frodo) who had been touched by\nthe Black Breath, an act that enhanced his reputation and strengthened\nhis claim to the crown. The rhyme of Gondorian lore about athelas is:\n\n    _When the Black Breath blows_\n    _and death's shadow grows_\n    _and all lights pass,_\n    _come athelas! Come athelas!_\n    _Life to the dying_\n    _In the king's hand lying!_\n\nAragorn also uses athelas to ease the pain of Frodo's wound when he is\nstabbed by a Morgul-blade at the Weathertop camp. The scent of the\nleaves also calms the minds of the other hobbits. Athelas is also used\nafter Moria when Aragorn tends Frodo's and Sam's injuries. After the\nBattle of the Pelennor Fields, Aragorn used athelas in The Houses of\nHealing to revive Faramir, Lady Éowyn, and the hobbit Merry, who were\nall under the shadow of the Black Breath. Some Men of Gondor use an\ninfusion of athelas for headaches.\n\n\nEtymology\n\nThe term _Athelas_ consists of the Sindarin terms _athaya_ (“helpful,\nbeneficial”) and _lass_ (“leaf”). In Quenya, the term _lasse_ also means\n“leaf”.\n\nIn other languages: the Anglosaxon æðele (“noble”) and the Old French\n_foil_ (“leaf”).\n\n\nOther versions of the legendarium\n\nAthelas was also used by Huan and Lúthien to heal wounded Beren,\naccording to the early _Lay of Leithian_. This contradicts the\ninformation from _The Lord of the Rings_ of it being brought to\nMiddle-earth by Númenóreans, so it was either changed by Tolkien in\nlater versions of his legendarium, or else athelas had grown in\nBeleriand before it was destroyed, and then brought _back_ to\nMiddle-earth by Númenóreans in the Second Age.\n\n\nOther mentions in literature\n\nKingsfoil is also mentioned in Ursula K. Le Guin's _A Wizard of\nEarthsea_, as one of the herbs in the witch of Gont's hut.\n\nde:Athelas es:Athelas fr:Athelas it:Athelas pl:Athelas ru:Ацелас\nuk:Ацелас"
  },
  {
    "title": "All that is Gold Does Not Glitter",
    "page_id": "4445",
    "text": "ALL THAT IS GOLD DOES NOT GLITTER was a poem written by Bilbo Baggins to\ndescribe Aragorn, used to help convince Frodo and company to trust him\nin his guise as “Strider”. Gandalf includes the poem in his letter to\nFrodo, which he leaves at The Prancing Pony for Barliman Butterbur to\ndeliver. Aragorn recites the first two lines when he is attempting to\nget Frodo to trust him enough to journey with him. The poem reads:\n\n    _All that is gold does not glitter,_\n    _Not all those who wander are lost;_\n    _The old that is strong does not wither,_\n    _Deep roots are not reached by the frost._\n    _From the ashes a fire shall be woken,_\n    _A light from the shadows shall spring;_\n    _Renewed shall be blade that was broken,_\n    _The crownless again shall be king._\n\nIt is recited again by Bilbo at the Council of Elrond. He whispers\nto Frodo that he had written it many years before, when Aragorn first\nrevealed who he was.\n\n\nhttp://en.wikipedia.org/w/index.php?title=All_that_is_gold_does_not_glitter&action=edit&section=1 editOlder version\n\nEarly versions of the poem are recorded in _The Treason of Isengard_,\npart of _The History of Middle-earth_ by Christopher Tolkien. The first\ndraft of the poem, which at that stage of composition was the only\ncontent of Gandalf's letter, reads:\n\n    _All that is gold does not glitter;_\n    _all that is long does not last;_\n    _All that is old does not wither;_\n    _not all that is over is past._\n\nThe second quatrain was added during the following revision:\n\n    _Not all that have fallen are vanquished;_\n    _a king may yet be without crown,_\n    _A blade that was broken be brandished;_\n    _and towers that were strong may fall down._\n\nThe lines were changed in stages, with many experimental forms rejected.\nChristopher Tolkien also suggested that “the Sword that was Broken\n actually emerged from the verse 'All that is gold does not\nglitter': on this view, in  the words _a\nking may yet be without crown, A blade that was broken be\nbrandished_ were no more than a further exemplification of the general\nmoral.”"
  },
  {
    "title": "Elven Hymn to Elbereth",
    "page_id": "6069",
    "text": "ELVEN HYMN TO ELBERETH is the song that the traveling Elves, lead by\nGildor, are singing when Frodo Baggins, Peregrin Took, and Sam Gamgee\npass through. The book says that the song is in the elven tongue,\nSindarin, but the sound shapes itself in their heads into words.\n\n\nSong\n\n Snow-white! Snow-white! O Lady clear! O Queen beyond the Western Seas!\nO light to us that wander here Amid the world of woven trees!\n\nGilthoniel! O Elbereth! Clear are thy eyes and bright thy breath!\nSnow-white! Snow-white! We sing to thee In a far land beyond the sea.\n\nO Stars that in the Sunless Year With shining hand by her were sown, In\nwindy fields now bright and clear We see you silver blossom blown!\n\nO Elbereth! Gilthoniel! We still remember, we who dwell In this far land\nbeneath the trees, Thy starlight on the Western Seas."
  },
  {
    "title": "The Fall of Gil-galad",
    "page_id": "6084",
    "text": "THE FALL OF GIL-GALAD was a poem sung by Sam Gamgee before he and the\nthree other Hobbits, led by Strider, reached Weathertop. The lay known\nas “The Fall of Gil-galad” had been written in ancient times, and spoke\nof the death of the Elven High King Gil-galad, who was in battle with\nSauron during the Battle of Mordor. Sometime during his stay in\nRivendell, Bilbo translated it from an older tongue, probably Quenya.\nThe song is incomplete, as Sam didn't want to learn the rest of the\nverses, as they dealt with Mordor and the war.\n\n\nLyrics\n\n Gil-galad was an Elven-king. Of him the harpers sadly sing; the last\nwhose realm was fair and free between the Mountains and the Sea.\n\nHis sword was long, his lance was keen. His shining helm afar was seen;\nthe countless stars of heaven's field were mirrored in his silver\nshield.\n\nBut long ago he rode away, and where he dwelleth none can say; for into\ndarkness fell his star in Mordor where the shadows are."
  },
  {
    "title": "Lament for the Rohirrim",
    "page_id": "6160",
    "text": "LAMENT FOR THE ROHIRRIM is sung by Aragorn as he, Gandalf, Legolas, and\nGimli approach Edoras. He originally chants it in the language of Rohan,\nthen translates it for Gimli and Legolas. A poet in Rohan had originally\nwritten it about Eorl the Young and his horse Felaróf.\n\n\nWords\n\n Where now the horse and the rider? Where is the horn that was blowing?\nWhere is the helm and the hauberk, and the bright hair flowing? Where is\nthe hand on the harpstring, and the red fire glowing? Where is the\nspring and the harvest and the tall corn growing? They have passed like\nrain on the mountain, like a wind in the meadow; The days have gone down\nin the West behind the hills into shadow. Who shall gather the smoke of\nthe dead wood burning, Or behold the flowing years from the Sea\nreturning?\n"
  },
  {
    "title": "Warning of Winter",
    "page_id": "6247",
    "text": "Warning of Winter is a poem Bilbo Baggins recites when he, Frodo\nBaggins, Peregrin Took, Meriadoc Brandybuck, Sam Gamgee, and Gandalf are\ndiscussing the Council of Elrond and the upcoming journey to Mordor.\nBilbo observes that they will be travelling in the winter because Frodo\nwaited until his birthday to start his journey to Rivendell.\n\n    When winter first begins to bite\n\n        and stones crack in the frosty night,\n\n    when pools are black and trees are bare,\n\n        'tis evil in the Wild to fare."
  },
  {
    "title": "The Long List of the Ents",
    "page_id": "6264",
    "text": "THE LONG LIST OF THE ENTS is a list of living creatures that the Ent\nTreebeard, and presumably other Ents as well, learned when he was young.\nWhen he first meets Meriadoc Brandybuck and Peregrin Took, he is puzzled\nby them because Hobbits are not in the list.\n\n Learn now the Lore of Living Creatures! First name the four, the free\npeoples: Eldest of all, the elf-children; Dwarf the delver, dark are his\nhouses; Ent the earthborn, old as mountains; Man the mortal, master of\nhorses: Beaver the builder, buck the leaper, Bear bee-hunter, boar the\nfighter; Hound is hungry, hare is fearful, Eagle in eyrie, ox in\npasture, Hart horn-crownéd; hawk is swiftest, Swan the whitest, serpent\ncoldest...\n\nTreebeard doesn't finish the list but Merry and Pippin suggest a line to\nbe added after Man:\n\n Half-grown Hobbits, the hole-dwellers.\n\nLater, after the fall of Isengard, Treebeard says he has put new lines\ninto the list for Ents to remember:\n\n Ents the earthborn, old as mountains, the wide walkers, water drinking;\nand hungry as hunters, the Hobbit children, the laughing-folk, the\nlittle people"
  },
  {
    "title": "The Ent and the Entwife",
    "page_id": "6266",
    "text": "The Ent and the Entwife is an Elvish song that Treebeard sings to\nMeriadoc Brandybuck and Peregrin Took. It is about the Ents' desire that\ntheir wives come back to them, and the prophecy that that they might\nfind a land where both Ents and Entwives can be happy together, though\nthis will only be found after both have lost everything. The verses\nalternate points- of-view between the Ent and the Entwife.\nSeveral lines from the Ent's point-of-view are recited by Treebeard to\nMerry and Pippin as he takes them to his home in The Two Towers (film).\n\n    ENT:\n    When Spring unfolds the beechen leaf, and sap is in the bough;\n    When light is on the wild-wood stream, and wind is on the brow;\n    When stride is long, and breath is deep, and keen the mountain-air,\n    Come back to me! Come back to me, and say my land is fair!\n\n&nbsp;\n\n    ENTWIFE:\n    When Spring is come to garth and field, and corn is in the blade;\n    When blossom like a shining snow is on the orchard laid;\n    When shower and Sun upon the Earth with fragrance fill the air,\n    I'll linger here, and will not come, because my land is fair.\n\n&nbsp;\n\n    ENT:\n    When Summer lies upon the world, and in a noon of gold\n    Beneath the roof of sleeping leaves the dreams of trees unfold;\n    When woodland halls are green and cool, and wind is in the West,\n    Come back to me! Come back to me, and say my land is best!\n\n&nbsp;\n\n    ENTWIFE:\n    When Summer warms the hanging fruit and burns the berry brown;\n    When Straw is gold, and ear is white, and harvest comes to town;\n    When honey spills, and apple swells, though wind be in the West,\n    I'll linger here beneath the Sun, because my land is best!\n\n&nbsp;\n\n    ENT:\n    When Winter comes, the winter wild that hill and wood shall slay;\n    When trees shall fall and starless night devour the sunless day;\n    When wind is in the deadly East, then in the bitter rain\n    I'll look for thee, and call to thee; I'll come to thee again!\n\n&nbsp;\n\n    ENTWIFE:\n    When Winter comes, and singing ends; when darkness falls at last;\n    When broken is the barren bough, and light and labour past;\n    I'll look for thee, and wait for thee, until we meet again:\n    Together we will take the road beneath the bitter rain!\n\n&nbsp;\n\n    BOTH:\n    Together we will take the road that leads into the West,\n    And far away will find a land where both our hearts may rest."
  },
  {
    "title": "Call-to-Arms of the Rohirrim",
    "page_id": "6306",
    "text": "CALL-TO-ARMS OF THE ROHIRRIM is what Théoden chants after Gandalf has\nhealed him of Saruman's influence and Éomer has offered him his sword,\nGúthwinë. Théoden chants it in the language of the Rohirrim and his\nguards come running, thinking that he has called them.\n\n\nPoem\n\n Arise now, arise, Riders of Théoden! Dire deeds awake, dark is it\neastward. Let horse be bridled, horn be sounded!\n\n    Forth Eorlingas!"
  },
  {
    "title": "The Green Dragon (song)",
    "page_id": "6642",
    "text": "This tribute to The Green Dragon Inn is sung by Meriadoc Brandybuck and\nPeregrin Took while they dance on a table at the Rohirric\nvictory-celebration in Edoras, in the 2003 film _The Return of the\nKing_. Some of the lines are sung slightly off rhythm with each other,\nalmost as if the Hobbits were starting to sing a round; but being a\nHobbit-song, the song is meant to sound as such because that gives it\nthe quality of delivering a message. This song showeth how great the\nbeer of the Green Dragon Inn is.\n\n_\"Oh you can search far and wide,\nYou can drink the whole town dry,\nBut you'll never find a beer so brown,_\n\n_Oh you'll never find a beer so brown,_\n\n_As the one we drink in our hometown,\nAs the one we drink in our hometown.\n_ _You can drink your fancy ales,\nYou can drink them by the flagon,\nBut the only brew for the brave and true...\n..Comes from the Green Dragon!_!\""
  },
  {
    "title": "Elves Lullaby",
    "page_id": "21922",
    "text": "ELVES LULLABY is a lullaby which the Elves of Rivendell sang to Bilbo\nBaggins on his return journey from the Lonely Mountain.\n\n\nLyrics\n\n Sing all ye joyful, now sing all together! The wind’s in the tree-top,\nthe wind's in the heather; The stars are in blossom, the moon is in\nflower, And bright are the windows of Night in her tower.\n\nDance all ye joyful, now dance all together! Soft is the grass, and let\nfoot be like feather! The river is silver, the shadows are fleeting;\nMerry is May-time, and merry our meeting.\n\nSing we now softly, and dreams let us weave him! Wind him in slumber and\nthere let us leave him! The wanderer sleepeth. Now soft be his pillow!\nLullaby! Lullaby! Alder and Willow! Sigh no more Pine, till the wind of\nthe morn!\n\n    Fall Moon! Dark be the land!\n    Hush! Hush! Oak, Ash, and Thorn!\n\nHushed be all water, till dawn is at hand!"
  },
  {
    "title": "Down in Goblin Town",
    "page_id": "27439",
    "text": "DOWN IN GOBLIN TOWN is a song performed by the Goblin King and the\ngoblins in The Hobbit when Thorin and company are captured. The\nlyrics are as follows: _Clap! Snap! the black crack!_ _Grib, grab!\nPinch, nab!_ _And down, down to Goblin town_\n\n    _You go, my lad!_\n\n_Clash, crash! Crush, smash!_ _Hammer and tongs! Knocker and gongs!_\n_Pound, pound, down underground!_\n\n    _Ho, ho! my lad!_\n\n_Swish, smack! Whip crack!_ _Batter and beat! Yammer and bleat!_ _Work,\nwork! Nor dare to shirk,_ _While Goblins quaff, and Goblins laugh,_\n_Round and round far underground_\n\n    _Below, my lad!_\n"
  },
  {
    "title": "Down in the Valley",
    "page_id": "45329",
    "text": "DOWN IN THE VALLEY is a song sung by the Elves as Bilbo, Gandalf and the\nDwarves enter Rivendell, on their journey to the Lonely Mountain.\n\n\nLyrics\n\n O! What are you doing, And where are you going? Your ponies need\nshoeing! The river is flowing!\n\n  O! tra-la-la-lally\n       here down in the valley!\n\nO! What are you seeking, And where are you making? The faggots are\nreeking, The bannocks are baking!\n\n   O! tril-lil-lil-lolly\n       the valley is jolly,\n            ha! ha!\n\nO! Where are you going With beards all a-wagging? No knowing, no knowing\nWhat brings Mister Baggins,\n\n  And Balin and Dwalin\n      down into the valley\n           in June\n           ha! ha!\n\nO! Will you be staying, Or will you be flying? Your ponies are straying!\nThe daylight is dying!\n\nTo fly would be folly, To stay would be jolly\n\n    And listen and hark \n    Till the end of the dark\n       to our tune\n       ha! ha!\n\nBilbo hears the Elves singing a different version of the song as he\nre-enters Rivendell, on his journey back to the Shire.\n\n The dragon is withered, His bones are now crumbled; His armour is\nshivered, His splendour is humbled! Though sword shall be rusted, And\nthrone and crown perish With strength that men trusted And wealth that\nthey cherish, Here grass is still growing, And leaves are yet swinging,\nThe white water flowing, And elves are yet singing\n\n    Come! Tra-la-la-lally!\n    Come back to the valley!\n\nThe stars are far brighter Than gems without measure, The moon is far\nwhiter Than silver in treasure: The fire is more shining On hearth in\nthe gloaming Than gold won by mining, So why go a-roaming?\n\n    O! Tra-la-la-lally \n    Come back to the Valley.\n\nO! Where are you going, So late in returning? The river is flowing, The\nstars are all burning! O! Whither so laden, So sad and so dreary? Here\nelf and elf-maiden Now welcome the weary\n\n    With Tra-la-la-lally\n    Come back to the Valley,\n         Tra-la-la-lally\n         Fa-la-la-lally\n              Fa-la!\n"
  }
]