[
  {
    "title": "Dragon-spell",
    "page_id": "43600",
    "text": "The “DRAGON-SPELL” is a power possessed by Dragons that allows them to\nhypnotize their victims for various purposes.\n\n\nHistory\n\nThe Dragon-spell power is known to have originated with Glaurung, the\nfirst dragon, who employed it against Túrin and others.\n\n\nApplications\n\nAs with much of tolkiens work, little detail is given into the limits\nand uses of this power. Glaurung is known to have used it against Túrin\n, using it to paralyze him, preventing him from acting despite hundreds\nof people being dragged away. He also used it to influence Túrin ,\nmaking him think Niënor was suffering despite being perfectly fine.\nGlaurung would also use it to induce total amnesia in Niënor, and later\nreturning all her memories to her, all with words.\n\nSmaug would also use an ability similar to this. Bilbo would notice a\nbeam of light coming from smaug's eyes (likely due to his senses being\nenhanced by the ring). Whenever this beam passed over bilbo he would\nhave a strong desire to remove the one ring from his fingers."
  },
  {
    "title": "Fire of Orthanc",
    "page_id": "10725",
    "text": "The FIRE OF ORTHANC was an explosive craft of the wizard Saruman that\nwas used by his army to destroy large fortifications. It was referred to\nalso as “Blasting Fire”, when Aragorn explains it to King Théoden.\n\nSaruman first used the Fire of Orthanc at the Battle of the Hornburg, at\nwhich the fortress' strong walls were successfully breached, and again\nat Isengard during the Last March of the Ents, as a weapon against the\nrampaging Ents. It burnt and killed Beechbone and made the other Ents\ndouble their effort to destroy the place. It is possible that the\nweapon, or something similar, was used by Sauron during the Battle of\nthe Pelennor Fields, as the books state that by magic or technology the\nammunition of his catapults caught fire while in mid-air.\n\nThe exact composition of the Fire of Orthanc is unknown.\n"
  },
  {
    "title": "Flood",
    "page_id": "15095",
    "text": "The FLOOD, '''Flood of Bruinen '''or ELVEN FLOOD was a mass of Water in\nthe shape of Horses at the Ford of Bruinen. It can wash out enemies as\nwas done when Elrond summoned it."
  },
  {
    "title": "Black Breath",
    "page_id": "4923",
    "text": "The BLACK BREATH, also known as the BLACK SHADOW, was a serious and\noften fatal condition, resulting from contact with a Nazgûl.\n\nRather than actually being the breath of the unseen wraiths, it is more\nof an aura they can produce at will to incapacitate their foes. This\npower was used extensively in the Battle of the Pelennor Fields, though\nnot during their confrontations with Frodo and his companions in\nEriador. A condition named similarly was also known during the First\nAge, but it is not known what was spreading it during that age.\n\n\nEffects and Treatment\n\nIn a mild form, the Black Breath may cause a brief period of\nunconsciousness, accompanied by bad dreams, and a state of agitation\nupon being woken.\n\nA severe case of the Black Breath, by contrast, can be fatal if not\ntreated. It may initially manifest as deep despair and extreme\ndrowsiness, with the victim gradually losing consciousness. In other\ncases, loss of consciousness occurs immediately. A period of\nhallucination-like nightmares progresses to deep unconsciousness and\nhypothermia, and the victim dies after a few days. These cases can,\nhowever, be treated using the healing herb Athelas.\n\n\nKnown victims\n\n-   Aragorn\n-   Éowyn\n-   Faramir\n-   Frodo\n-   Merry"
  },
  {
    "title": "Flame of Anor",
    "page_id": "2669",
    "text": "During Gandalf's fight with the Balrog in _The Lord of the Rings_, he\nsays of himself that he is the wielder of the Flame of Anor. It is\nnowhere else referred to in the trilogy, so its particular meaning\nremains unclear. _Anor_ is the Elvish word for the Sun, so literally the\n_flame of Anor_ would have alluded to the light of the Sun, which had\noriginated in the fiery fruit of Laurelin, one of the Two Trees of\nValinor. Thus, Gandalf may have meant the power he gained as a servant\n(a Maia) of the Lords of the West, in defiance to the corrupted darkness\nof the Balrog.\n\nAlternatively, Gandalf may have been referring to Narya, the Ring of\nFire, which he wore and wielded, but it seems unlikely that Gandalf\nwould want to reveal his ownership of a Ring of Power —a matter of\nutmost secrecy—to one of his greatest enemies. However, considering that\nthe Balrog owed no allegiance to Sauron at that time, Gandalf may have\nbeen merely attempting to scare it away.\n\nIn Tolkien's earliest drafts, forms of this passage were variations on:\n“I am the master of White Flame. The Red Fire cannot come this way” (and\none variation mixes in the idea of Black Shadow, too). These terms seem\nto be symbolic - _white_ for the powers of good, but _red_ or _black_\nfor Sauron and his servants. As the text developed, the _Red Fire_ and\n_Black Shadow_ were lost. The _White Flame_ remained, but developed into\nthe more poetic _flame of Anor._ On this reading, then, the 'flame of\nAnor' doesn't refer to a specific thing, but is Gandalf's way of\nannouncing what he stands for, or perhaps his power as a servant of the\nValar."
  },
  {
    "title": "Dark sorcery",
    "page_id": "28085",
    "text": "DARK SORCERY, more commonly known as “witchcraft” or “Morgul magic” by\nthe Free People of Middle-earth, was art of practicing dark magic for\nevil purposes. Famous practitioners of dark sorcery are mostly dark\nservants of the infamous Dark Lords Melkor and Sauron. Its users, as\nwell as all human practitioners of magic, were called Sorcerers. The\nIstari used light magic, similar to the Elves and the Ainur in Valinor\nand outside of Arda, rather than dark sorcery.\n\n\nHistory\n\n\n\nBefore his defeat, the Dark Lord Morgoth (Melkor) had used dark sorcery\nin his fortress of Utumno and later Angband. He was most infamous for\nhis experiments in creating and mutilating monsters, including the orcs,\nWargs and Dragons and used much of his powers to corrupt Arda.\n\nDark sorcery was also used in the Second and the Third Age by the Black\nNúmenóreans, a group of corrupted Númenóreans who grew during the later\nperiod of Númenor (especially after the arrival of Sauron) and who\nsurvived in the Númenórean colonies south of Gondor. Originally the\nstyled themselves as “King's Men” and persecuted The “Elf-friends”\nbecause of their loyalty to the Valar (The King's Men had grown jealous\nof the elves' immortality). After Sauron's arrival at Númenor they begun\nworshipping Melkor and the darkness they so feared, bringing human\nsacrifices to him. After the fall of Númenor the Black Númenóreans\ncontinued to serve Sauron. Two Black Númenóreans who were infamous for\nusing sorcery within Sauron's armies were the Witch-king of Angmar and\nthe Mouth of Sauron.\n\nAt around the late Third Age, in the fortress of Dol Guldur, the\nNecromancer (Sauron in disguise) was believed to be an Úlairi. He was\neventually forced out by the White Council, but he returned to his\nformer kingdom of Mordor and publicly declared himself alive, shown as\nMount Doom erupted once again.\n\nAfter Sauron's final destruction that began the Fourth Age, a Man by the\nname of Herumor had rose to power and was rumored to have established a\ncult that worshipped the Dark Powers in Gondor.\n\n\nPowers and Abilities\n\nDark sorcery included a variety of spells, potions (alchemy) and other\nghastly things that belonged to the Dark Arts. Dark sorcery was\nfrequently used as a weapon, shown by the Witch-king's bewitched sword\nat the Battle of the Pelennor Fields.\n\nMorgul-blades were noted to have been enchanted with dark sorcery, so\nthat a victim would go through the Shadow World and turn into a wraith\nif stabbed.\n\nThe Fires of Orthanc were said to be sorcery invented or created by\nSaruman.\n\nMany of the Rings of Power (the only known exception being the three\nElf-rings) amplified the wearers abilities as a sorcerer and warrior and\nwhere presumably forged with the help of Dark Magic. The fortresses of\nDol Guldur and Minas Morgul were enchanted with sorcery, hence their\ntranslated names in Sindarin. \n\n\nKnown Practitioners\n\nPractitioners of dark sorcery were named 'Sorcerers' and these included:\n\n-   All the Dark Powers\n    -   Melkor\n    -   Sauron\n        -   Dark Servants of Sauron\n            -   Mouth of Sauron\n            -   Herumor\n            -   Saruman\n            -   Nazgûl\n                -   Witch-king of Angmar"
  }
]