[
  {
    "name": "Lefnui",
    "lotr_page_id": "3364",
    "text": "The river LEFNUI was counted as first of the Seven Rivers of Gondor.\n\nLefnui began in the south-western valleys of the _Starkhorn_ peak of the\nWhite Mountains, and flowed south-west parallel to the mountain range.\nBecoming a great and wide river, it entered the Bay of Belfalas at the\nend of the Anfalas region of Gondor, in a bay of its own. West of the\nriver's mouth lay the long cape of Andrast.\n\nAccording to Karen Wynn Fonstad's _The Atlas of Middle-earth_, the river\nis over two-hundred miles in length."
  },
  {
    "name": "Little Gelion",
    "lotr_page_id": "3375",
    "text": "The LITTLE GELION was one of the lesser sources of the River Gelion.\n\nIt came from the Hill of Himring and ran down into the southeast until\nit met the River Gelion about fifty miles away.\n\nIts overall length was around seventy-five miles.\n"
  },
  {
    "name": "Legolin",
    "lotr_page_id": "3365",
    "text": "LEGOLIN was one of the rivers of the Ossiriand in the eastern Beleriand.\n\nOriginating in the Blue Mountains, it is just one of the six tributaries\nto the great river Gelion.\n\nAccording to Karen Wynn Fonstad's _The Atlas of Middle-earth_, it\nappears to have been about seventy-five miles in length.\n\n\nEtymology\n\n_Legolin_ was a Sindarin word."
  },
  {
    "name": "Mindeb",
    "lotr_page_id": "3400",
    "text": "The MINDEB was a river of Beleriand, a northern tributary to Sirion.\n\nThe Mindeb began in the Ered Gorgoroth near the Pass of Anarch, and was\nmet by a tributary coming from the Crissaegrim. It formed the boundary\nbetween Dimbar and Nan Durgotheb. It formed the western border of the\nforest of Neldoreth in Doriath and was part of the Girdle of Melian.\nAccording to Karen Wynn Fonstad's _The Atlas of Middle-earth_, the river\nwas about fifty miles in length.\n\n\nEtymology\n\nMindeb was a Sindarin word."
  },
  {
    "name": "Aros River",
    "lotr_page_id": "3752",
    "text": "The Aros River was a river that ran through Beleriand in Middle-earth\nduring the First Age.\n\nThe Aros River was a tributary of the river Sirion. The Aros River runs\non and it rises in the northern lands around Himring. Then it meets the\nSiron at Aelin-uial. The Aros River formed the eastern and southern\nborders of the Kingdom of Doriath and joined the Sirion at the Kingdom's\nsouthwest corner.\n\n\nReal Life\n\nAros is also the original name of Aarhus, the second largest city in\nDenmark."
  },
  {
    "name": "Withywindle",
    "lotr_page_id": "4451",
    "text": "The WITHYWINDLE was the lesser tributary of the Brandywine River that\nflowed through theBarrow-downs and the Old Forest and passed into\nBuckland on the borders of The Shire. The Withywindle valley was said to\nbe the source of all the strange occurrences in the Old Forest. Tom\nBombadil lived here in his house on top of a hill between the\nBarrow-downs and Old Forest.\n\n\nHistory\n\nLong ago in an unknown age, Tom Bombadil met Goldberry, the\nRiver-daughter, in a pool down the Withywindle. He later brought her to\nhis home north of the river and every summer would gather water-lilies\nfor her along the river side. He was on his last trip of the year when\nhe met Frodo Baggins and the rest of his company on September 26, 3018. \n\nWhen Frodo, Sam, Merry andPippin were passing through the valley of the\nWithywindle, they encountered Old Man Willow, an ancient tree who showed\nbitter hatred to all other living creatures in Middle-earth people and\ntrees alike. The Hobbits were lulled to sleep under his spell all except\nFrodo and Sam who regained consciousness in time to save Merry and\nPippin who had been trapped inside the old willow's trunk. Tom Bombadil\nhappened to be strolling along the river at the time and rescued them\nall by demanding that he let them go. He was the only person that could\ncontrol the evil tree's temper.\n\n\nGeography\n\nAccording to _The Atlas of Middle-earth_, it was about three miles in\nlength and began at a waterfall that probably cut into the cliff at the\nedge of the Barrow-downs near the house of Tom Bombadil. \n\nAt the mouth of the Withywindle there was a haven in the north bank\ncalled Grindwall. The Grindwall was not under the protection of the High\nHay therefore it was guarded by a fence that was built extending into\nthe waters shallows. There was a small village called Breredon on the\nother side of the Grindwall between the Brandywine and the High Hay.\n\n\nEtymology\n\nThe word _withy_ means'' 'willow''' (common element in English\nplace-names) and _windle_ meaning SPINDLE or REEL and is supposed to be\ntranslated from Hobbitish."
  },
  {
    "name": "Ciril",
    "lotr_page_id": "4458",
    "text": "The river CIRIL (also spelled KIRIL) is the third of the Seven Rivers of\nGondor.\n\nIt arose in an isolated peak south of the White Mountains in the north\nof the Gondorian region of Lamedon, and flowed south past the city of\nCalembel until it met the river Ringló, and as part of that river flowed\ntowards Edhellond."
  },
  {
    "name": "The Water",
    "lotr_page_id": "4949",
    "text": "THE WATER was a river in The Shire and a tributary to the Brandywine\nriver.\n\nIt began in the Northfarthing, located in the North Moors near Long\nCleeve and then passed into the Eastfarthing where it joined the River\nBrandywine. As The Water passed the village of Bywater, it formed\nBywater pool before heading on its way towards Budge ford and then\nBridgefields before striking the Brandywine.\n\nAccording to the _The Atlas of Middle-earth_, it was approximately\ntwo-hundred miles long."
  },
  {
    "name": "Thalos",
    "lotr_page_id": "5029",
    "text": "THALOS was a river of the Ossiriand and the second most northern of the\nseven rivers of that land between the Ascar and the Legolin.\n\nAccording to Karen Wynn Fonstad's _The Atlas of Middle-earth_, it\nstarted from the springs of Blue Mountains and was over sixty miles in\nlength.\n\n\nEtymology\n\n_Thalos_ was a Sindarin word."
  },
  {
    "name": "Redwater",
    "lotr_page_id": "6962",
    "text": "REDWATER, also known as CARNEN, was a river in the region of Rhovanion\nin Middle-earth.\n\nThe Redwater originated in the Iron Hills and was east of the Lonely\nMountain. It flowed southward before emptying into the River Running,\nwhich is about 250 Númenórean miles to the south. This river, in turn,\nflowed into the Sea of Rhûn and then past the land of Dorwinion.\n\n\nHistory\n\nDuring the War of the Ring, in the year TA 3018, a large force of\nEasterlings under Sauron's command crossed and forded this river on\ntheir way to attack the Dwarvish realm of Lonely Mountain and the\nMannish kingdom of Dale.\n\n\nEtymology\n\nThe word _CARNEN_ is the Sindarin equivalent of Redwater, the name for\nthe river in the common tongue."
  },
  {
    "name": "Esgalduin",
    "lotr_page_id": "7670",
    "text": "ESGALDUIN was the main river of Doriath. The Esgalduin flowed from the\nhills of Dorthonion through Doriath past the caves of Menegroth under\nthe Stone Bridge leading to the gates of the city, and finally meeting\nup with the River Sirion in the west.\n\nThe Esgalduin had two unnamed upper branches of its own in Ered\nGorgoroth. One ran along the border between Dor Dínen and Nan\nDungortheb, and the other ran west for about 20 miles from the mountains\ninto Nan Dungortheb and further south-east until merging with the\nfirst.\n\n\nEtymology\n\nIn a manuscript dating from the late 1950s and early 1960s, Tolkien\nwrote that _Esgalduin_ is a Sindarin name meaning “the river under\nshade”.\n\nIn the earlier Etymologies, the name _Esgalduin_ was said to be Ilkorin\nfor “River under Veil (of )”, consisting of the elements\n_esgal_ (“screen, hiding, roof of leaves”) + _duin_ (“water, river”).:"
  },
  {
    "name": "Enchanted river",
    "lotr_page_id": "8151",
    "text": "The ENCHANTED RIVER was a black river in Mirkwood that flowed north from\nits source in the Mountains of Mirkwood towards the Forest River, which\nit joined about ten miles before (west of) the Elven-king's Halls. It\nhad fast and strong currents, but was not too wide at least in the area\nnear the Forest Path where Thorin and Company crossed it.\n\nThe river's enchantment (or pollution) made it so that anyone who drank\nor bathed in the water fell into a deep sleep, and suffered amnesia when\nthey finally awoke.\n\n\nHistory\n\nSignificance in The Hobbit\n\nBilbo Baggins and the Dwarves of Thorin and Company had to cross the\nEnchanted River while traveling through Mirkwood on their quest to the\nLonely Mountain. One of the Dwarves, Bombur, clumsily fell backwards\ninto the river while trying to get out of a boat they used in the\ncrossing. He fell asleep for many days and dreamt of Elvish feasts. When\nhe finally awoke, he could not remember anything since the party at\nBilbo's house before they left."
  },
  {
    "name": "Poros",
    "lotr_page_id": "9231",
    "text": "POROS was a small river in the South-eastern corner of Gondor flowing\ninto the Anduin. Estimated at being at least 400 Númenórean miles long,\nit began in the Ephel Dúath (Mountains of Shadow). It then flowed\nsouth-west for approximately 300 miles when it made a right turn heading\nfor the Anduin delta.\n\nIt formed the northern border of the disputed land of Harondor and\nthe southern boundary of Ithilien. It could be forded at the Crossings\nof Poros (Haudh in Gwanûr) where the Harad Road was. It was the site in\nwhich the great Battle of the Crossings of Poros which occurred between\nGondor and the Haradrim in TA 2885."
  },
  {
    "name": "Nimrodel (river)",
    "lotr_page_id": "9673",
    "text": "NIMRODEL was a small river near the eastern foothills of the Misty\nMountains in Rhovanion.\n\n\nDescription\n\nThis river began in the foothills of the Misty Mountains under the\nmountain Celebdil, and then flowed through Lórien until it met the\nCelebrant (river Silverlode).\n\n\nHistory\n\nWhen both Nimrodel and Amroth were lost, the river was named after her.\nAfter leaving Moria, the Fellowship of the Ring crossed the river and\nrested near its shore before entering the Elven realm of Lórien."
  },
  {
    "name": "Ringwil",
    "lotr_page_id": "10383",
    "text": "RINGWIL was a river of Beleriand during the First Age; a tributary of\nthe Narog river.\n\nThe Ringwil flowed through Taur-en-Faroth from its beginning in the\nhills surrounding the hidden city of Nargothrond running approximately\ntwenty-five miles in length, according to the _The Atlas of\nMiddle-earth_.\n\n\nHistory\n\nAt the place it met the Narog, there was built a secret door that\nLúthien used to escape the city when Celegorm and Curufin imprisoned\nher. It was lost with destruction of the Beleriand at the end of the\nFirst Age."
  },
  {
    "name": "Greater Gelion",
    "lotr_page_id": "12355",
    "text": "The GREATER GELION was the larger of the two sources of the River\nGelion in Beleriand.\n\nThe Greater Gelion's origin was Mount Rerir and it ran southeast near\nMaglor's Gap until it joined the River Gelion about seventy-five miles\nfrom its source.\n\n\nEtymology\n\nThe Greater Gelion was a Sindarin word.\n"
  },
  {
    "name": "Adurant",
    "lotr_page_id": "2536",
    "text": "The ADURANT runs from southern Blue Mountains into the river Gelion,\nmarking the southern boundary of Ossiriand.\n\nAccording to Karen Wynn Fonstad's _The Atlas of Middle-earth_, it was\nover one-hundred and fifty miles in length.\n\nThe small island of Tol Galen lied in its midst.\n\n\nEtymology\n\nThe name means _“Double-course”_ in Sindarin, referring to a parting of\nthe river about the isle of Tol Galen.",
    "location": "Beleriand, Ossiriand",
    "type": "River",
    "description": "Southernmost of the seven rivers of Ossiriand",
    "inhabitants": "Laiquendi; Beren, Lúthien, Dior",
    "regions": "Island: Tol Galen"
  },
  {
    "name": "Siril",
    "lotr_page_id": "2571",
    "text": "The SIRIL was the chief river of Númenor.\n\nIt rose in springs from the Meneltarma and flowed southwards to find the\nsea in a sandy delta which formed the border between the provinces of\nHyarrostar and Hyarnustar.\n\n\nEtymology\n\nThe word '''Siril '''is Quenyan and means “rivulet”. It came from the\nword SIR, meaning 'river', though the origin of the second element IL is\nunclear.",
    "location": "Southern Númenor",
    "type": "River",
    "major_towns": "Nindamos",
    "inhabitants": "Fisher-folk at its lower course"
  },
  {
    "name": "Celon",
    "lotr_page_id": "2659",
    "text": "The CELON was a long river in the East Beleriand during the First Age of\nMiddle-earth.\n\nThe Celon began in the Hill of Himring and flowed southwest between the\nlands of Estolad and Himlad and went by the borders of Nan Elmoth and\nDoriath. It was a tributary of the river Aros.\n\n\nHistory\n\nOrcs attacked Menegroth during the First Battle of Beleriand from their\ncamps between the Celon and Gelion rivers. Celon, being in Himlad was\nthe land of Amrod and Amras, the twin Sons of Fëanor. Aredhel passed\nover Celon on her journey to meet the Sons of Fëanor before becoming\nlost in Nan Elmoth. Later when she and her son Maeglin left Eöl to live\nin Gondolin, they passed over Celon before entering Himlad. Bëor and\nhis people settled on the eastern banks of the Celon after being given\nleave to settle there after being advised by Finrod. Haleth led her\npeople across the Celon and Aros on their hard journey to the Forest of\nBrethil. Deadly Orc raiders followed the Celon down through into\nDoriath taking captives, just after the Dagor Bragollach.\n\n\nEtymology\n\nCelon was a Sindarin word that meant 'Stream flowing down the\nheights'.",
    "type": "River",
    "description": "Slender stream",
    "inhabitants": "Orcs, then Elves",
    "location": "Northern part of East Beleriand",
    "pronunciation": "_KEH-lon_"
  },
  {
    "name": "Nenning",
    "lotr_page_id": "3425",
    "text": "NENNING was a river of the West Beleriand.\n\nIt had its wells in the hills lying north-west in West Beleriand south\nof the Ered Wethrin, near the Woods of Núath.\n\nIt ran to the bay of Eglarest where it met the sea Belegaer and also\nserved as a the border between the Havens of the Falas and Finrod's\nrealm of Nargothrond.\n\nAccording to _The Atlas of Middle-earth_, it approximately 100 miles in\nlength.\n\n\nEtymology\n\n_NENNING_ was a Sindarin word.",
    "type": "River",
    "inhabitants": "Elves",
    "location": "West Beleriand, from south of Nevrast to Eglarest",
    "events": "Morgoth's attack upon the Falas"
  },
  {
    "name": "Morthond",
    "lotr_page_id": "3886",
    "text": "The river Morthond, also known as the BLACKROOT, was one of the Rivers\nof Gondor and was located in the province of Lamedon near the Stone of\nErech.\n\nIts source was the Dwimorberg in the White Mountains.\n\nAragorn and the Grey Company, after coming out of the Paths of the Dead,\nfollowed the river to Erech and then on to Southern Gondor.",
    "other_names": "Blackroot",
    "location": "In Anfalas in Gondor, south of the White Mountains",
    "type": "River",
    "inhabitants": "Elves, Gondorians",
    "events": "Aragorn's ride toErech"
  },
  {
    "name": "Celebros",
    "lotr_page_id": "2470",
    "text": "The CELEBROS was a river of the Beleriand, a tributary to Taeglin that\nflowed past the Forest of Brethil.\n\nAccording Karen Wynn Fonstad's _The Atlas of Middle-earth_, the Celebros\nwas approximately twenty to twenty-five miles long.\n\n\nHistory\n\nGlaurung was slain by Túrin Turambar near where this river met Taeglin,\nand Nienor Níniel committed suicide by jumping into it, in a state of\nutter despair.\n\n\nEtymology\n\n_Celebros_ is a Sindarin word that meant 'Silver-foam'.",
    "description": "A tumbling stream",
    "type": "Stream",
    "location": "Brethil, flowing into the Taeglin below Cabed-en-Aras"
  },
  {
    "name": "Glanduin",
    "lotr_page_id": "2612",
    "text": "The GLANDUIN was a river in the region of Eriador in Middle-earth and a\nnorthern arm of the Gwathló.\n\nBeginning in the Misty Mountains south of Moria, it flowed\nwest-north-west until it was met by the Sirannon near the old location\nof Ost-in-Edhil, the capital of the Elven realm of Eregion. From there\nthe Glanduin flowed towards the Hoarwell, which it met in the marshes\nknown as Swanfleet or NÎN-IN-EILPH north-east of Tharbad. From there on\nboth rivers became the Gwathló.\n\nAccording to _The Atlas of Middle-earth_, it was approximately\nseventy-five miles in length.\n\nOn some versions of the Middle-earth map the name _Swanfleet_ appears to\nbe an alternative name for the river, but in fact that name apparently\nrefers to the marshes alone.",
    "other_names": "Swanfleet",
    "location": "South-eastern Eriador, separating Eregion from Enedwaith"
  },
  {
    "name": "Gwathló",
    "lotr_page_id": "2613",
    "text": "The river GWATHLÓ or GREYFLOOD is a river in the middle of Eriador in\nMiddle-earth.\n\n\nDescription\n\nThe Gwathló's overall length flowed through immense forests which\ncovered Minhiriath to the north and Enedwaith to the south. It was one\nof the few rivers also given an Adûnaic name: AGATHURUSH. The Gwathló\nwas wide enough that it could be sailed on all the way to where its\ntributary Glanduin met the river. Its was formed where the Hoarwell met\nthe Glanduin, where a marshy area known as _Nîn-in-Eilph_ or _Swanfleet_\nwas formed.\n\n\nHistory\n\nWhen the Númenórean Ship-king required more and more wood to build their\nships, they set up a haven-fortress on the Gwathló called Lond Daer or\n_Lond Daer Enedh_, Great (Middle) Haven. From there the lands were\nrapidly deforested, and by the Third Age all the forests were gone.\n\nIn the late Second Age and early Third Age the Gwathló formed the border\nbetween the Kingdoms of Arnor and Gondor, and the great Gondor northern\noutpost of Tharbad was built where the Great South Road crossed the\nriver at its only crossing in the lower stream. However by the late\nThird Age Gondor had retreated far south and Arnor had been destroyed.\nTharbad and its great bridge had been abandoned and ruined, and the\nriver had to be crossed by the ruins of Tharbad in a dangerous ford.\n\n\nEtymology\n\nThe Sindarin name Gwathló was adapted from the name GWATHIR, given to\nthe river by the Númenóreans in the Second Age. Its name translates as\n_Shadowy River_.",
    "other_names": "_Gwathir_, Greyflood",
    "type": "River",
    "description": "Broad navigable waterway originally bordered by trees",
    "events": "Battle of the Gwathló",
    "location": "Border between Minhiriath and Enedwaith"
  },
  {
    "name": "Entwash",
    "lotr_page_id": "2645",
    "text": "The ENTWASH was a great river in Rohan, notable for its\nhuge inland delta.\n\nThe Entwash, a translation of the Sindarin name _ONODLÓ_, had its\nsources in the springs that arose on _Mount Methedras_, the southernmost\npeak of the Misty Mountains, near Treebeard's home.\n\nLeaving Fangorn forest, the river flowed past the Wold of Rohan, and\nthen headed south, dividing Rohan into Westemnet and Eastemnet. At the\nlatitude of Edoras it was joined by the river Snowbourn, and then flowed\neast towards Anduin, which it joined just south of the Falls of Rauros,\nin the huge inland delta known as the _Mouths of the Entwash_. The\nMering Stream or _Glanhír_ met one of the Entwashes' arms there. The\ninfluence of water was so great that at the other end of the Anduin the\nmarshes of Nindalf (Wetwang) and the Dead Marshes arose.\n\n\n\nThe Entwash was named for the Ents (Onodrim) of Fangorn, but the origin\nof the name was largely forgotten by the Rohirrim.",
    "other_names": "Onodló",
    "location": "Central Rohan, flowing from Fangorn to Nindalf and Anduin",
    "type": "River"
  },
  {
    "name": "Ringló",
    "lotr_page_id": "2815",
    "text": "The river RINGLÓ was counted as the fourth of the Seven Rivers of Gondor\nin the land of Lamedon in Gondor.\n\nThe Ringló began in the White Mountains, and arose as two smaller rivers\n(unnamed) on the southern arm that bend towards Belfalas. It flowed\nthrough the Gondor city of Ethring and passed north of the Hills of\nTarnost where it was met by its tributary Ciril, and met the sea at\nEdhellond, near Cobas Haven above Dol Amroth in southern Gondor. It's\nmain tributary was the river Blackroot According to Karen Wynn Fonstad's\n_The Atlas of Middle-earth_, its length was almost one-hundred and fifty\nmiles.\n\n\nEtymology\n\nRingló was a Sindarin word that meant 'Cold-flood'.",
    "location": "Between Anfalas and Belfalas in Gondor, south of the White Mountains",
    "type": "River",
    "description": "South-west flowing river known for its cold waters",
    "events": "Aragorn's ride to Pelargir"
  },
  {
    "name": "Limlight",
    "lotr_page_id": "3153",
    "text": "The LIMLIGHT was a tributary of the River Anduin, which flowed eastwards\nfrom Fangorn forest, and emptied out into the Anduin in the North Undeep\nnear the Brown Lands. It formed the northern border of Rohan.\n\nIt was approximately one-hundred fifty miles in length.\n\n\nHistory\n\nBefore the arrival of the Rohirrim when the area was a province of\nGondor known as Calenardhon, the river Limlight was considered to be the\nnorthern border of the Kingdom of Gondor. Later, it was also the\nnorthern border of Rohan as well. It was also the southern border of the\nField of Celebrant, which was near the Elven realm of Lothlórien.\n\nLater, during the Long Winter of the later Third Age, the river and much\nof the area was covered by a blanket of heavy snow.\n\n\nOther Names\n\nLimlîht was the name in Elvish form.",
    "other_names": "_Limlich_, _Limliht_, _Limlaith_ and _Limhîr_",
    "description": "East-flowing tributary of the Anduin",
    "events": "Battle of the Field of Celebrant",
    "location": "East of Fangorn Forest between the Field of Celebrant and The Wold",
    "type": "River"
  },
  {
    "name": "Lune",
    "lotr_page_id": "3254",
    "text": "The river LUNE or LHÛN was a river of north-western Eriador in\nMiddle-earth.\n\nIn the Second and Third Age, it emptied into the Gulf of Lune that broke\nthrough the Blue Mountains, and thence into Belegaer.\n\nIt had three (unnamed) tributaries: two of them arising in the Blue\nMountains, and one beginning in the Hills of Evendim north of the later\ncapital of Arnor, Annúminas. It was not connected to Lake Nenuial, the\norigin of the Brandywine river.\n\nIts overall length was over one-hundred and fifty miles.\n\n\nHistory\n\nIn the First Age, the course of the river is not known. The Gulf of Lune\nwas not created until the War of Wrath so the river must have had a\ndifferent lower course. Possibly it connected with the Brandywine\nfurther south. In TA 1974, an army led by King Eärnur crossed this river\non their way to defeat the Witch-king of Angmar.",
    "other_names": "Lune",
    "location": "Western Eriador, east of the Ered Luin",
    "type": "River"
  },
  {
    "name": "Greylin",
    "lotr_page_id": "3361",
    "text": "GREYLIN was a river in the far north of Rhovanion in Middle-earth.\n\nGreylin was one of the two tributaries (the other being the Langwell\nriver that flowed from the north in the Grey Mountains, and then into\nthe Anduin river. The next tributary south from the Misty Mountains was\nthe Rhimdath.\n\n\nHistory\n\nThe Greylin's source point lay near the ruins of Framsburg.",
    "type": "River",
    "description": "Tributary to the Anduin",
    "location": "East of the Misty Mountains, south-east of Gundabad"
  },
  {
    "name": "Snowbourn",
    "lotr_page_id": "3353",
    "text": "The SNOWBOURN was a river in Rohan.\n\nThe Snowbourn arose in the White Mountains under the mountain Starkhorn,\nflowed through Harrowdale where the Rohirrim capital Edoras was built,\nand then flowed eastwards until it met the river Entwash in the\nEastfold. It also separated Rohan's Eastfold from West Emnet.\n",
    "type": "River",
    "location": "Central Rohan, flowing past Edoras",
    "description": "Boundary between East and Westfold"
  },
  {
    "name": "Langwell",
    "lotr_page_id": "3360",
    "text": "The Langwell was one of the rivers of Rhovanion that flowed east from\nthe Misty Mountains into the Anduin where it joined the Greylin. After\nits junction with the Greylin it is called the Langflood . The Langwell\nis also the northernmost tributary of the Anduin.\n\nThe ruins of Framsburg, an ancient city of the Éothéod, was built on its\nnorthern banks.",
    "location": "East of the Misty Mountains, south-east of Mount Gundabad",
    "type": "River"
  },
  {
    "name": "Ascar",
    "lotr_page_id": "3754",
    "text": "ASCAR, also known as RATHLÓRIEL, was one of the seven rivers of\nOssiriand, a region of the eastern Beleriand.\n\nThe Ascar was one of the six tributaries to the great river Gelion.\nBeginning near Mount Dolmed, it flows into Gelion near Sarn Athrad where\nthe Dwarf-Road coming from Nogrod and Belegost runs along its banks.\n\nAfter the fall of Doriath, its remaining treasures were placed in its\ndeep depths by Beren, Dior and the Laiquendi, were afterwards it became\nknown as Rathlóriel, the Goldenbed.",
    "type": "River",
    "other_names": "Rathlóriel",
    "location": "Between Thargelion and Ossiriand",
    "events": "Battle of Sarn Athrad"
  },
  {
    "name": "Erui",
    "lotr_page_id": "4460",
    "text": "The river ERUI was one of the rivers which arose in the White Mountains.\nIt was not counted amongst the Seven Rivers of Gondor.\n\nThe river began near Mount Mindolluin in the White Mountains, flowing\nsouth through the province of Lossarnach, where it met the Anduin about\n100 Númenórean miles south of Minas Tirith.\n\nDuring the Kin-strife of Gondor, the Battle of Erui was fought at the\nCrossings of Erui that lay on the way to Pelargir.",
    "location": "Lossarnach, Gondor",
    "type": "River",
    "description": "Swift-flowing river, passed by Crossings of Erui"
  },
  {
    "name": "Sirannon",
    "lotr_page_id": "5190",
    "text": "SIRANNON was a river in Eriador.\n\nAccording to the _The Atlas of Middle-earth_, the river was about\none-hundred miles in length. In the late Third Age, it flowed near a\nknoll by the High or Hollin Road into a pool close to the Doors of\nDurin.\n\n\nHistory\n\nThe Sirannon once flowed from an underground source near the West side\nof Moria and running along the road that once led to Ost-in-Edhil, it\nwas dammed at an unknown date in the last thousand years of the Third\nAge, closing off the Doors of Durin from neighboring lands. The foul\npool created by the damming of the stream was where the Watcher in the\nWater lived.\n\nAfter the War of the Ring and the resettling of Moria by the Dwarves,\nthe stream and the foul pool it ran through was probably cleaned and\nfreed up to flow naturally to its original destination.\n\n\nEtymology\n\n_Sirannon_ is a Sindarin word for 'stream-gate'.",
    "other_names": "Gate Stream",
    "location": "Running from Doors of Durin to Ost-in-Edhil",
    "type": "Stream",
    "events": "Journey of the Fellowship of the Ring"
  },
  {
    "name": "Greyflood",
    "lotr_page_id": "5977",
    "text": "The Greyflood River was also known in the\nElvish tongue as the, Gwathló.\n\n\nCourse\n\nIts source began in the Misty Mountains west of the River Rhimdath, and\nestimated at around one hundred miles north of Rivendell. It flowed\nthrough the Ettenmoors and then curved southward, skirting the western\nedge of the Trollshaws. Running under the Last Bridge on the\nEast-West Road, it went on southward until it was joined by the River\nBruinen or 'Loudwater'. The river then turned south-west until it met\nwith the Glanduin, forming the fenland called _Nin-in-Eilph_ or\n'Swanfleet'. Beyond this point the combined waters were named Gwathlo.\n\n\nHistory\n\nThe Hoarwell was within the boundaries of Arnor when the realm was\nfounded. In TA 861 when Arnor was dismembered, the river was within the\nconfines of Rhudaur.\n\nSometime around TA 1150, the Stoors came over the Redhorn Pass and\nsettled in the Angle, the land between the Hoarwell and the Loudwater.\nWhen Angmar became powerful around TA 1300, these Hobbits moved over the\nHoarwell to dwell near Bree. \n\nIn May TA 2941, Thorin and Company crossed the river on the Last Bridge\nand later on that same day they were waylaid by three trolls - Tom, Bert\nand William. Then, on 11th October TA 3018, Glorfindel the Elf-lord\ndrove back the Nazgul from the Last Bridge and left a beryl in the mud\nin the middle of the road to show that the path ahead was safe. Two days\nlater, after finding the elf-stone and knowing what it meant, Aragorn\nled the Hobbits Frodo, Sam, Merry and Pippin across the bridge on their\nway to Rivendell.",
    "other_names": "_Gwathir_, Greyflood",
    "location": "Border between Minhiriath and Enedwaith",
    "type": "River",
    "description": "Broad navigable waterway originally bordered by trees",
    "events": "Battle of the Gwathló"
  },
  {
    "name": "River Running",
    "lotr_page_id": "8590",
    "text": "The RIVER RUNNING, called '''Celduin '''by the Elves, was a river in\nRhovanion.\n\nThe river originates beneath the Lonely Mountain and flows south to the\nSea of Rhûn. Redwater and the Forest River out of Mirkwood are\ntributaries of the River Running.\n\nThe river is 600–Númenórean miles long and runs from the Lonely Mountain\nsouth through the Long Lake, where it is joined by the Forest River, and\nthence through the eastern outskirts of Mirkwood, then south east\nthrough apparently uninhabited regions of Rhovanion to its confluence\nwith the _Redwater_ and finally in a long south-eastward loop to the\ngreat inland Sea of Rhûn, past the land of Dorwinion.",
    "other_names": "Celduin",
    "location": "Northern Rhovanion",
    "description": "River which ran from the Lonely Mountain to the Sea of Rhun",
    "culture": "Northmen; Wood-elves"
  },
  {
    "name": "Forest River",
    "lotr_page_id": "8589",
    "text": "The FOREST RIVER was a river of Rhovanion.\n\nIt ran approximately two hundred miles in length that ran from the Grey\nMountains in Rhovanion through the northern portion of Mirkwood forest\nand through the mountains of Thranduil's underground realm, before\njoining the River Running at the Long Lake. The Enchanted river in\nMirkwood flowed into the Forest River about ten miles before (west of)\nthe Elven-king's Halls."
  },
  {
    "name": "Gilrain",
    "lotr_page_id": "8603",
    "text": "The river GILRAIN flowed south from the White Mountains before becoming\na tributary of the river Serni.\n\nGilrain was one of the Five Rivers of Lebennin. It had one unnamed\ntributary that ran down from the eastern side of a part of the White\nMountains. According to Karen Wynn Fonstad's _The Atlas of\nMiddle-earth_, it ran a total of nearly one-hundred miles where it\njoined the Serni just above Linhir and went into the Bay of Belfalas.\n\n\nEtymology\n\nGilrain was a Sindarin word for 'Star-wanderer'."
  },
  {
    "name": "Sirith",
    "lotr_page_id": "8598",
    "text": "The river SIRITH flowed south from the White Mountains until it met the\nAnduin at the port of Pelargir. The river Celos was a tributary of the\nSirith. The Sirith was one of the Five Rivers of Lebennin."
  },
  {
    "name": "Bruinen",
    "lotr_page_id": "703",
    "text": "The river BRUINEN (“LOUDWATER”) is a river in the region of Eriador, in\nMiddle-earth leading into the Mitheithel.\n\nThe Bruinen begins with two tributaries in the Misty Mountains, one of\nthem at the High Pass where Goblin-town was later dug. The river formed\nthe eastern border of the Kingdom of Arnor and later the petty-realm of\nRhudaur. South of it lies Eregion (Hollin).\n\nThe southern arm of the Bruinen flows through the deep valley where\nElrond founded the elven village of _Imladris_ or Rivendell. Elrond had\nsome control over the river, as it would rise in anger if he had need to\nbar the way into Rivendell. Indeed it can be assumed that Vilya, the\nRing of Air, allowed Elrond to maintain such power over the valley.\n\nThe Bruinen had only one point where it could be passed, a Ford near\nRivendell. This Ford and by extension the river were called the _Edge of\nthe Wild_.\n\n\nHistory\n\nWhen Thorin Oakenshield and Company ventured eastward to reclaim the\nLonely Mountain (Erebor), they passed the Bruinen after their encounter\nwith the Trolls, before they long paused at Rivendell.\n\nAt the beginning of the War of the Ring, Frodo Baggins was raced on\nGlorfindel's horse towards the Ford of Bruinen, with the Ringwraiths in\nhot pursuit. At the Ford Frodo made his stand, and defied the Witch-king\nof Angmar. This lured the Ringwraiths into the Bruinen, and\nElrond released a great flood, which took the form of horses made out of\nwater. This flood killed the horses of the Ringwraiths, buying the\nFellowship much time.\n"
  },
  {
    "name": "Gladden",
    "lotr_page_id": "855",
    "text": "The RIVER GLADDEN was a river of Rhovanion and a tributary to the\nAnduin.\n\n\nHistory\n\nCalled SÎR NINGLOR ('River Goldwater') by the elves, the Gladden was a\nshort but important river of the Vales of Anduin. Beginning as two\nunnamed streams in the Hithaeglir, it flowed eastwards towards the Great\nRiver Anduin, which it met in a series of marshes called the Gladden\nFields.\n\nAfter the Last Alliance of Elves and Men, Isildur, heir of Elendil and\nbearer of the One Ring, was assailed by orcs near the Gladden Fields,\nand the One Ring was lost here in the Gladden river.\n\nMuch later during the Third Age, some Stoors lived near the streams of\nGladden, and from them came Déagol who found the ring, was killed by\nSméagol (Gollum), who long held the Ring. Gollum eventually followed the\nstream up to its source, ending up in forgotten caves near Goblin Town.\n\nSaruman searched the Gladden extensively during his search for the Ring,\nbut never found it."
  },
  {
    "name": "Harnen",
    "lotr_page_id": "901",
    "text": "The river HARNEN ('''Southing '''in Westron) was a river south of\nGondor.\n\nIt formed the southern border of the contested land of Harondor, south\nGondor, and as such formed the southern border of Dúnedain influence.\nSouth of the Harnen lay the land of Near Harad.\n\nA good 600 Númenórean miles long, it began in the Ephel Dúath of Mordor\nand then flowed southwest for about 350 miles, when it bent west and\nsped to Belegaer, which it entered in a wide delta. The Great South\nRoad into Harad crossed the Harnen shortly after it bent westwards. This\nroad was used by Sauron's followers later in the Third Age.\n\nAt some point early in the 10th century of the Third Age, Ciryaher son\nof Ciryandil stormed across the Harnen with a large forced comprised of\nboth land and sea components. His combined expeditionary force\nthoroughly routed the Men of the Harad, and the Haradrim were thereafter\ncompelled to acknowledge Gondor's suzerainty over them. Ciryaher\nthereafter took the name Hyarmendacil — which meant “South-victor” — and\nas king was styled Hyarmendacil I. Thus the river was deeply\nimportant to his royal career. Indeed, it can be divined by the name\nCiryaher took afterwards that the river was, at least for Gondorians, an\ninformal demarcator of “southernness”.\n\n\nEtymology\n\n_Harnen_ is Sindarin, meaning 'South water'."
  },
  {
    "name": "Sirion",
    "lotr_page_id": "2445",
    "text": "SIRION was a river in Middle-earth during the First Age, the principal\nriver of Beleriand. During most of its course, it was the border between\nEast and West Beleriand.\n\n\nSource\n\nThe Sirion's source was at Eithel Sirion on the eastern side of the Ered\nWethrin, which lay in between Ard-galen (later Anfauglith) and Mithrim\nand Hithlum. It was guarded by the tower of Barad Eithel.\n\nSirion flowed southwards along the border of the Ered Wethrin, passing\nthrough the Fen of Serech before entering the narrow steep-sided valley\nbetween the Ered Wethrin and the Echoriath named the PASS OF SIRION.\nSirion then continued south into Beleriand, with the Forest of Brethil\nto the west, and Dimbar and then Doriath to the east. After leaving\nDoriath at Aelin-uial (the Fens of Sirion), it plunged below ground in\nthe Falls of Sirion at Andram, where the ground fell steeply. Three\nleagues southwards, the Sirion exited the underground caves at the Gates\nof Sirion. It then flowed further south through NAN-TATHREN until it\nreached the Bay of Balar, part of Belegaer, at the Mouths of Sirion. It\ntotal length was about three hundred and ninety miles.\n\nIn order from north to south, the principal tributaries of the Sirion\nwere the Rivil, flowing from Dorthonion until it met Sirion in the Fen\nof Serech; the Mindeb, which had its source in Nan Dungortheb and the\nEred Gorgoroth, the Teiglin, the Esgalduin of Doriath; the Aros flowing\nsouth from Dorthonion (and also containing the waters of the Celon from\nHimring and Himlad) which met at Aelin-uial, and the Narog, which joined\nSirion in Nan-Tathren.\n\nThe main crossing points mentioned in the Silmarillion were Brithiach\nwhere the road from Himlad, which crossed the Esgalduin at Iant Iaur,\ncrossed Sirion, and the Ferries of Doriath. The most important island in\nSirion was Tol Sirion. The original Minas Tirith was built here by\nFinrod Felagund in the strategic location controlling the Pass of Sirion\nwhere it entered Beleriand between the Ered Wethrin and the Echoriath.\nShortly after Dagor Bragollach, Sauron captured it and the island became\nknown as Tol-in-Gaurhoth.\n\n\nHistory\n\nBarad Eithel, at the source of the Sirion in the Ered Wethrin, was a\nchief fortress of Fingolfin and his son Fingon, probably guarding a pass\ninto their realm of Mithrim. Further south, in the Pass of Sirion, lay\nTol Sirion. After the Coming of Men, the Edain of the House of Haleth\nmade their home in the Forest of Brethil, and the Sindar ruled by\nThingol lay secure within the Girdle of Melian in their realm of\nDoriath. At the outflow of Sirion into Belegaer, after the destruction\nof Eglarest and Brithombar, the Havens of Sirion were built by Círdan\nand his people."
  },
  {
    "name": "Malduin",
    "lotr_page_id": "2471",
    "text": "MALDUIN (Sindarin for 'Golden river') was a river of the Beleriand, a\nnorthern tributary to Taeglin.\n\nIt was located northeast of the forest of Brethil next to the river\nGlithui another tributary to the Taeglin."
  },
  {
    "name": "Narog",
    "lotr_page_id": "2466",
    "text": "The NAROG was the chief river of West Beleriand, the largest tributary\nof river Sirion.\n\nThe Narog began at the Eithel Ivrin in the Ered Wethrin, flowed south\nand then southeast, flowing through a gorge in a series of rapids where\nit crossed the hills of the Andram, finally meeting the Sirion in the\nNan-tathren, not far above the Mouths of Sirion. Narog's tributaries\nwere the river GINGLITH in the north and the river RINGWIL in the\nTAUR-EN-FAROTH.\n\nInto its western bank, just south of where Ringwil rushed into Narog,\nwas carved the city of Nargothrond, stronghold of Finrod Felagund for\nmost of the First Age."
  },
  {
    "name": "Brithon",
    "lotr_page_id": "2801",
    "text": "BRITHON was a river of the Beleriand that had its wells in the hills\nlying north-west in West Beleriand south of the Ered Wethrin (Mountains\nof Shadow).\n\nThe Brithon ran to a bay near the haven of Brithombar where it met the\nGreat Sea. Its total length was about sixty miles.\n\n\nEtymology\n\nBrithon was a Sindarin word that meant 'gravel' or 'pebbly'."
  },
  {
    "name": "Celebrant",
    "lotr_page_id": "2827",
    "text": "The river CELEBRANT, also known as SILVERLODE and KIBIL-NÂLA, was a\nstream rising in the eastern Misty Mountains near the exit from Moria.\nThe Celebrant ran through the vale of Azanulbizar east to Lothlórien\nwhere it was met by the Nimrodel river, and emptied into the Anduin. The\nstream ran for about eighty-five miles according to _The Atlas of\nMiddle-earth_.\n\n\nHistory\n\nThe Fellowship of the Ring followed this river when they travelled from\nMoria to Lórien. It formed the northern boundary of the Field of\nCelebrant. Celeborn and Galadriel of Lothlórien claimed it as part of\ntheir realm.\n\n\nEtymology\n\nCELEBRANT was a Sindarin word for 'Silvercourse'. It was called\n_Silverlode_ in Westron and _Kibil-nâla_ in Khuzdul, the language of\nDwarves."
  },
  {
    "name": "Nunduinë",
    "lotr_page_id": "2573",
    "text": "NUNDUINË was the main western river of the island of Númenor during the\nSecond Age.\n\nThe source of the Nunduinë began in the hills west of Meneltarma. The\nriver then flowed towards the city of Eldalondë, splitting in two\nbranches to form the isle of Nísinen before emptying into the Bay of\nEldanna.\n\nIts total length was approximately one-hundred and fifty miles."
  },
  {
    "name": "Adorn",
    "lotr_page_id": "2528",
    "text": "The ADORN was a river occurs in Middle-earth between the White Mountains\nand the western part of Rohan.\n\nThe Adorn was one of the rivers which arose in the White Mountains, and\ntogether with the river Isen formed the western border of the Kingdom of\nRohan. The Adorn joined with the Isen about 150 Númenórean miles west of\nthe Gap of Rohan.\n\n\nHistory\n\nThe triangle of land between the Isen, Adorn, and the White Mountains\nwas nominally part of the Kingdom of Rohan, but in the late Third Age it\nwas a contested area between the Rohirrim and the Dunlendings."
  },
  {
    "name": "Dry River",
    "lotr_page_id": "34247",
    "text": "The DRY RIVER was an extinct river in the East Beleriand that had once\nflowed down from the Encircling Mountains into the Sirion.\n\nThe river was about fifteen miles in length.\n\n\nHistory\n\nIn ancient times long past by the First Age, the river once flowed under\nthe mountains into a lake where afterwards Tumladen, the valley of\nGondolin was located. The river was dried up by the early First Age\nwhen Gondolin was founded leaving a stoney deep-channeled river bed\nbehind. Intent on following his wife and son, Eöl found the Dry River\nand the Hidden Way and thus to Gondolin to stand before King Turgon.\nDuring the Nírnaeth Arnoediad, Turgon's army marched to and from the\nbattlefield down the Dry River. Years after the Nírnaeth Arnoediad,\nTuor and his Elvish companion Voronwë traveled up the Dry River for many\nmiles until coming to the entrance to the Hidden Way. After being\nreleased from the captivity of Morgoth, Hurin sought out Gondolin but\nwhen he arrived he found Dry River blocked.\n\nWhen the city fell in FA 510, the survivors did not use the Hidden Way\nto escape down the Dry River instead using Idril's Secret Way to escape\nby way of the Cirith Thoronath."
  },
  {
    "name": "Sîresha",
    "lotr_page_id": "44074",
    "text": "SÎRESHA was a river located in the region of Sirayn. It ran 600 miles\nfrom its source in the Tûr Betark, in the mighty Káraskon Ravine, south\nof Ny Chennacatt, to its delta in the Bay of Ormal. The cities of Sirayn\nwere founded along the Sîresha river and its tributaries.\n\nMeltwater from two glaciers, as well as the torrential rains falling on\nthe mountain peaks, feed its upper reaches to create a fastmoving\ncurrent. The yellowish color of the water is due to the yellow sediment\nor loess eroded from the cliffs of the Tûr Betark. During Sadayn, the\nwettest season, a traveller following the foothills east from\nCiryatandor must detour north to the Mára Gaib (“Bridge of the\nOld-settlers”) to cross the flood-swollen Sîresha. This remarkable\nengineering feat bridges the river at the narrowest point between\nTartaust and Baud Selen.\n\nDropping through the Skara Riskál (“Wraith’s Teeth Rapids”), the river\nis joined at Tartaust by a small tributary and broadens to sweep\nsmoothly along the bottom of a wide gorge. The current passes rapidly\nthrough chasms carved from mesas and rock outcroppings as well as across\nthe vast plains of the scrubland typical of Chennacatt. Just above Rask,\nbefore the Maudar adds its flow to the Sîresha, the river drops in the\nSkara Sársus (“Cougar’s Gullet Rapids”), the last of the white water\nthat makes the upper half of the Sîresha unnavigable.\n\nThe lower Sîresha is a tamer stream, flowing between low banks and\nmeandering in ever greater loops as it approaches the Bay of Ormal. It\nshrugs once more at the ruins of Charnesra, where unusal rock formations\nin the river create lethal undercurrents and an obstructed channel for\nwater traffic. Young and daring adventurers sometimes brave the swirling\ncurrent, but more prudent travellers and commercial bargemasters still\nuse the old canal through the ruins to avoid the possibility of sinking\ntheir vessels.\n\nThe great forest bordering Isra, the Sára Bask, grows right up to the\nriver, its scrubby undergrowth and hardy trees overhanging the southern\nbank. Torbusaud (“Greenbarks”), slow barges of herb pickers, patrol this\nsection of the Sîresha to allow workers to efficiently harvest the\nwood’s bounty while still afloat. The lazy Sîrsis river flows between\ntrunks of the famous bausk trees (known for their bizarely corkscrewed\nlimbs) of the forest to join the Sîresha. The combined currents dump\ninto the Mard Isauba, a finger of the greater Bay of Ormal, at Tûl\nHarar."
  },
  {
    "name": "Thistle Brook",
    "lotr_page_id": "4957",
    "text": "THISTLE BROOK was a stream in the\nEastfarthing of the Shire.\n\nIt was a tributary to the Shirebourn. It began in eastern Green-hill\ncountry and flowed southeast around Woody End and near Willowbottom and\nthen into the Shirebourn.\n\nIt is approximately twenty miles in length.",
    "location": "Eastfarthing south of the Woody End",
    "type": "Stream",
    "description": "Minor tributary of the River Shirebourn"
  },
  {
    "name": "Rivil",
    "lotr_page_id": "10347",
    "text": "The RIVIL was a stream in the East Beleriand during the First Age.\n\nRivil was a tributary of the Sirion, flowing northwards from its source\nknown as Rivil's Well in the highlands of Dorthonion until it met Sirion\nin the Fen of Serech. Its estimated length is about fifty miles\naccording to _The Atlas of Middle-earth_.",
    "location": "Dorthonion to the Fen of Serech",
    "type": "Stream",
    "description": "Lesser tributary of Sirion",
    "events": "Death of Huor and capture of Húrin"
  },
  {
    "name": "Mering Stream",
    "lotr_page_id": "3067",
    "text": "The MERING STREAM was a border stream of both Rohan and Gondor.\n\nThe Mering Stream was known for that which formed the border between the\nMannish kingdoms of Gondor and Rohan, together with the White Mountains\nand the Mouths of the Entwash. West of the Mering Stream was the Rohan\nprovince of Eastfold and east of the river was the Gondor province of\nAnórien. The Mering Stream flew through Firien wood, which grew about\nthe mountain Halifirien, last of the Warning beacons of Gondor.\n\n\nOther names\n\nThe Sindarin form of the _Mering Stream_ is GLANHÍR.",
    "other_names": "Glanhír",
    "location": "Border between Rohan and Gondor",
    "description": "East flowing stream, tributary of the Entwash",
    "type": "Stream"
  },
  {
    "name": "Stockbrook",
    "lotr_page_id": "4978",
    "text": "The Stockbrook stream is located in the Eastfarthing of the Shire. It\njoins the Brandywine after passing its namesake, the village of Stock.\nIt has steep banks lined with brambles that gradually become lower as it\nheads towards the river.\n\nAccording to the _The Atlas of Middle-earth_, its total length was about\ntwenty miles.\n\n\nHistory\n\nThe Stockbrook was what alerted Peregrin Took to the fact that he, Frodo\nBaggins, and Sam Gamgee had gone off course as they headed cross-country\nfrom the Elf camp near Woodhall to Bucklebury ferry. They had to cross\nit and head right, winding up at Bamfurlong, Farmer Maggot's land.",
    "type": "Stream",
    "location": "Eastfarthing, bordering the Marish"
  },
  {
    "name": "Aelin-uial",
    "lotr_page_id": "2866",
    "text": "AELIN-UIAL was a marshy confluence of the river Aros into Sirion, south\nof Doriath.\n\n\nHistory\n\nThe Aelin-uial was the maze of lakes and fens which formed where the\nriver called Aros met Sirion, before it fell beneath the Andram. These\nwere lands heavy with enchantment, both from the girdle of Melian\nguarding Doriath to the North, but also from the power of Ulmo that was\nvery mighty in the waters of the river Sirion. The Aelin-uial was under\nthe total control of the Sindarin kingdom of Doriath. The march wardens\nof Thingol had secret ferries among the reeds, so that they could cross\nbetween the Sirion's eastern and western banks unseen. At the southern\nend of the Aelin-Uial, the Sirion's waters collected together once more\nfrom the many paths they took through the Marshland and, at the place\ncalled the Falls of Sirion, fell a very loud waterfall down into the\nearth.\n\nIt was here that Turgon and Finrod were given the idea of building their\nhidden fortress at Gondolin and Nargothrond. This idea was given to them\nby Ulmo, who put this idea into their heads while they were dreaming.\n\nAs Beren Erchamion left Doriath, he passed through Aelin-uial and\nproceeded to the Falls of Sirion.\n\nIn search for Túrin Turambar, Morwen and Nienor followed Mablung, who\nlater brought them to the hidden ferries of the elves. After the\nrelease of Húrin, he passed through the Aelin-uial and entered Doriath,\nwhere he met Elu Thingol and returned the Nauglamir.\n\nIt was destroyed in the War of Wrath, which occurred at the end of the\nFirst Age.\n\n\nEtymology\n\nThe name AELIN-UIAL is Sindarin which means “Twilight Meres” from the\nwords _aelin_ (“lake, pool”) and _uial_ (“twilight”).\n\nIts earlier name was the Gnomish HITHLINIATH “Pools of Mist” which was\nlater changed to UMBOTH-MUILIN.\n\nOther Names\n\nIt is also called the “Meres of Twilight”, “Twilight Meres”, or “Twilit\nMeres”.",
    "type": "Marsh",
    "other_names": "Meres of Twilight; _Umboth Muilin_ (\"Pools of Twilight\")",
    "location": "Meeting of Aros and Sirion",
    "regions": "Doriath",
    "description": "Known for being under the power of Ulmo and an enchanted place, very\ndifficult to traverse and for being where both Turgon and Finrod\nreceived their dreams from Ulmo.",
    "race": "Sindar",
    "spoken_languages": "Sindarin",
    "governance": "Thingol",
    "lifespan": "YT - FA 587",
    "pronunciation": "_EYE-lin-OO-I-al_",
    "events": "Dreams of Turgon and Finrod"
  },
  {
    "name": "Nen Lalaith",
    "lotr_page_id": "38199",
    "text": "NEN LALAITH was a stream in Dor-lómin.\n\nIt came from under the Amon Darthir and flowed past the house of Húrin\nin southeastern Dor-lómin. According to _The Atlas of\nMiddle-earth_, it was just over twenty-five miles in length and\ncontinued flowing northwestward towards the central part of\nDor-lómin.\n\n\nHistory\n\nNen Lalaith was bridged during Fingon's rule as High King of the Ñoldor\nin Hithlum. In Túrin's childhood, he could recall seeing the High King\nfor the first time, when he and his lords crossed it clad in glittering\nsilver and white. The stream was best known for being the name\n(Lalaith) that the household of Húrin called the young daughter of Húrin\nand sister of Túrin, Urwen or better known as 'Lalaith'.\n\n\nEtymology\n\n_Nen Lalaith_ was Sindarin for 'Water Laughter'."
  }
]