[
  {
    "title": "The Fellowship of the Ring (novel)",
    "page_id": "43",
    "text": "_THE FELLOWSHIP OF THE RING_ is the first of three volumes of\nthe novel _The Lord of the Rings_. It is divided into two books, Book I\nand II. It was originally released on July 29, 1954 in the United\nKingdom by Allen and Unwin.\n\n\nPrologue\n\nThe book begins with a prologue, which summarizes the events of the\nfirst book, _The Hobbit_. It gives you the backstory of the ring and how\nit came to be. It tells how the creator, Sauron first came upon it. It\ngives the backstory of Sméagol and his friend Déagol and how they came\nupon the Ring after Sauron was temporarily defeated. It also explains\nhow Bilbo Baggins found the One Ring after Sméagol, who had become\nGollum, lost it. Then Bilbo returns to Bag End in The Shire, and the\nstory of Frodo Baggins, Bilbo's nephew, begins.\n\nParts\n\n-   '''I- '''Concerning Hobbits\n-   '''II- '''Concerning Pipe-Weed\n-   '''III- '''Of the Ordering of the Shire\n-   IV- Of the Finding of the Ring\n-   V- Note on the Shire Records\n\n\nBook I: The First Journey / The Ring Sets Out\n\n The first sets the stage\nfor the adventure and follows Frodo Baggins as he flees from his home in\nthe Shire to escape the minions of the Dark Lord Sauron. Sauron seeks\nthe One Ring that will allow him to control the Bearers of the nineteen\nother Rings and control the three major races of Middle-earth: Elves,\nMen, and Dwarves. The One Ring has been inherited by Frodo who finds\nhimself unwittingly in the midst of a struggle for world domination.\n\nThe first chapter in the book begins quite lightly, following on from\n_The Hobbit_ which is more of a whimsical children's story than _The\nLord of the Rings_. It begins with Bilbo celebrating his 111th (or\neleventy first, as it is called) birthday, on the same day that Frodo\ncelebrates his 33rd birthday (his 'coming of age'). At the birthday\nparty, Bilbo disappears after his speech, to the surprise of all. Frodo\nlater learns about the ring which he had used to make himself invisible,\nand also about some of its darker powers.\n\nHeeding the advice of the wizard Gandalf, Frodo leaves his home, taking\nthe Ring with him. He hopes to reach Rivendell, where he will be safe\nfrom Sauron, and where those wiser than he can decide what to do about\nthe Ring.\n\nIn his journey he is accompanied by three hobbit friends, Peregrin Took,\nMeriadoc Brandybuck and Samwise Gamgee, often refered to as Merry,\nPippin and Sam. From the start they are pursued by Black Riders, the\nRingwraiths who serve Sauron. Narrowly escaping these and other dangers\nand meeting other interesting characters en route (e.g., Tom Bombadil)\nthey eventually come to Bree, where they meet Strider, another friend of\nGandalf who leads them the rest of the way to Rivendell, through further\nhardships. Frodo is stabbed upon the mountain of Weathertop by the chief\nof the Nazgûl with a 'Morgul blade' - as part of the knife stays inside\nhim, he gets sicker on the rest of the journey. They also pass the\ntrolls which had been turned to stone in the previous book, _The\nHobbit_.\n\nChapters\n\n-   I - A LONG-EXPECTED PARTY - details Bilbo and Frodo's Birthday\n    Party; chapter ends with Bilbo leaving the\n    Shire.\n-   II - THE SHADOW OF THE PAST - Gandalf tells Frodo the true nature of\n    the ring, and how it must be taken to Mordor and destroyed. Sam, who\n    has been listening at the window, is told to accompany Frodo.\n-   III - THREE IS COMPANY - Frodo sells Bag End, and officially is\n    going to move to a house at Crickhollow in the area beyond\n    Bucklebury in Buckland; he actually plans to disappear without\n    causing too much of a fuss. Frodo, Sam and Pippin set out through\n    the South Farthing of the Shire towards Buckland, and encounter a\n    black rider. They also meet Gildor the wood elf, with other wood\n    elves.\n-   IV - A SHORT CUT TO MUSHROOMS - They meet Farmer Maggot while taking\n    a short cut, and he gives them some of his prized mushrooms. Merry\n    joins them at the end.\n-   V - A CONSPIRACY UNMASKED - Takes place at Frodo's new house at\n    Crickhollow. The title refers to Frodo about to tell Merry and\n    Pippin about his quest, who he had previously believed not to know\n    about it, and they tell him that they had known much of it all\n    along. They also meet Fatty Bolger. Frodo decides to leave the next\n    day through the Old Forest, as it is an unexpected direction, rather\n    than travelling on the roads.\n-   VI - THE OLD FOREST - Although trying to avoid it, the hobbits get\n    lost and travel to the River Withywindle, the “queerest part of the\n    whole wood”. Merry and Pippin are trapped inside Old Man Willow, and\n    are freed only when Tom Bombadil arrives.\n-   VII - IN THE HOUSE OF TOM BOMBADIL - Tom knows much about the\n    hobbits, and even tries on the Ring, yet it does not have any effect\n    on him - it doesn't even make him invisible. Frodo tries on the ring\n    then to see if it 'works', and Tom Bombadil is also able to see\n    Frodo while he has the ring on.\n-   VIII - FOG ON THE BARROW-DOWNS - Travelling through the\n    Barrow-downs, the hobbits are imprisoned by Barrow-wights, where\n    they are rescued again by Tom Bombadil. The hobbits are given\n    daggers from the treasure in one of the downs.\n-   IX - AT THE SIGN OF THE PRANCING PONY - The hobbits reach the The\n    Prancing Pony inn at Bree, where Frodo uses a false name, Underhill.\n    Later, after singing a song on a table, he trips and accidentally\n    puts the ring on his finger, disappearing, which causes a commotion.\n-   X - STRIDER - Strider, who had at first seemed menacing, turns out\n    to be friendly. The innkeeper, Butterbur, gives Frodo a late letter\n    from Gandalf, which tells him that Strider is a friend of Gandalf's\n    whose real name is Aragorn.\n-   XI - A KNIFE IN THE DARK - The hobbits with Strider set out from\n    Bree on foot after their horses had bolted when Black Riders arrived\n    at the inn at night. The Riders had attacked the beds which they\n    were supposed to be staying in, though in vain as Strider had them\n    stay in another room. They buy a pony from Bill Ferny. They pass\n    through the Midgewater Marshes, and reach Weathertop. There they are\n    attacked by five Black Riders; Frodo puts on the ring to escape\n    them, and is stabbed in the shoulder by the Witch-king of Angmar,\n    leader of the nine Ringwraiths (Nazgul).\n-   XII - FLIGHT TO THE FORD - They pass the trolls Bert, Tom and\n    William, which were turned to stone by Gandalf in _The Hobbit_.\n    Eventually, they meet the elf Glorfindel from Rivendell, who allows\n    Frodo to take his white horse to escape the Ringwraiths on their way\n    to Rivendell. The Black Riders are washed away in The Flood over the\n    Ford.\n\n\nBook II: The Journey of the Nine Companions / The Ring Goes South\n\nBook II chronicles Frodo's stay at Rivendell, where a plan is hatched at\nthe Council of Elrond to destroy the Ring in Mordor. Early on Frodo\nmeets his uncle Bilbo, whom he had not seen since he left Hobbiton much\nearlier. Frodo sets forth from Rivendell with nine companions: two Men,\nAragorn and Boromir, son of the Steward of the land of Gondor; an Elven\nprince, Legolas; Frodo's old friend and powerful wizard, Gandalf; Gimli\nthe Dwarf; and Frodo's original three hobbit companions. These Nine\nWalkers were chosen to represent the free races of Middle-earth and as a\nbalance to the Nine Riders. They were also accompanied by Bill the Pony,\nwhom Strider and the Hobbits acquired in Bree as a pack horse. Their\nattempt to cross the Misty Mountains is foiled by heavy snow, so they\nare forced to take a path under the mountains via Moria, an ancient\nDwarf kingdom, now full of Orcs and other evil creatures, such as the\nWatcher in the Water guarding the south gate. Just before escaping\nMoria, Gandalf falls into the abyss while battling a Balrog.\n\nThe remaining eight members of the Fellowship then spend some time in\nthe elf-haven of Lothlórien, where they receive gifts from the Elf-queen\nGaladriel that in many cases prove useful later in the quest. They leave\nLórien by river, but Frodo begins to realize the Ring is having a\nmalevolent effect on some members of the party, especially Boromir, who\ntries to take the ring from Frodo. In the process, Frodo puts on the\nring to escape him. Later Boromir is attacked by orcs while trying to\ndefend Merry and Pippin. This book ends when Frodo and Sam depart\nsecretly for Mordor and the Fellowship of the Ring dissolves.\n\nChapters\n\n-   I - MANY MEETINGS - After awakening from a sleep for four days,\n    Frodo meets Gandalf and Bilbo again, as well as Gloin, the dwarf\n    from _The Hobbit_, Elrond, and others.\n-   II_' - The Council of Elrond_' - A council attended by many people;\n    Gandalf tells the story of his escape from Saruman; they decide that\n    the ring must be destroyed and Frodo offers to take it to Mordor.\n-   III_' - The Ring goes South_' - The nine members of the fellowship\n    travel south through Hollin; they try to take the road over the\n    mountain Caradhras but are forced to turn back.\n-   IV_' - A Journey in the Dark_' - They travel to the gates of Moria,\n    where they have to deal with a creature in the lake in front of it.\n    Gandalf eventually opens the doors by speaking the correct password.\n    They reach the tomb of Balin.\n-   V_' - The Bridge of Khazad-dûm_' - Attacked by Orcs, trolls and a\n    Balrog of Morgoth, they make their way to the bridge in Khazad-dûm,\n    where Gandalf and the balrog fall.\n-   VI_' - Lothlórien_' - The company meets the elves of Lórien. The\n    elves reluctantly agree to let Gimli the dwarf pass. Aragorn takes\n    Frodo to the hill of Cerin Amroth.\n-   VII_' - The Mirror of Galadriel_' - The company meets Celeborn and\n    Galadriel. Frodo is shown the mirror of Galadriel.\n-   VIII_' - Farewell to Lórien_' - The elves give them cloaks, elven\n    bread, and other gifts; they then leave Lórien on boats down the\n    Great River.\n-   IX_' - The Great River_' - they notice Gollum following them down\n    the river on a log; Orc Archers attack the boats; A Winged Nazgûl is\n    seen flying above the Fellowship's boats, and is shot down by\n    Legolas, who fires an arrow at the rider's flying beast; they reach\n    the falls of Rauros, where they must choose between travelling on\n    the east or west bank of the river to pass the falls.\n-   X_' - The Breaking of the Fellowship_' - They arrive at the lawn of\n    Parth Galen; they still face the choice of whether to go east or\n    west; Boromir tries to take the Ring from Frodo, who puts it on to\n    escape him. The rest of the company splits up trying to find Frodo.\n    Sam finds Frodo by the river and they cross it, thereby breaking up\n    the the Fellowship and continuing to Mount Doom on their own.\n\nBehind the events that befall the Ring-bearer and the Fellowship, the\nreader begins to sense an awakening of the true nature of the story.\nThere lurks always an idea of destiny, and in the end, it will be a\nconcatenation of the effects spawned by the nature of Good itself, that\nundoes the greatest Evil. Frodo says of the ring's first slave, Gollum,\n“What a pity that Bilbo did not stab that vile creature, when he had a\nchance!” and Gandalf's wise response is\n\n    “Pity? It was Pity that stayed his hand. Pity, and Mercy: not to\n    strike without need. And he has been well rewarded, Frodo. Be sure\n    that he took so little hurt from the evil, and escaped in the end,\n    because he began his ownership of the Ring so. With Pity.”\n\n\nNotable Characters\n\n-   Frodo Baggins\n-   Bilbo Baggins\n-   Tom Bombadil\n-   Gandalf\n-   Saruman\n-   Sauron\n-   Samwise Gamgee (Sam)\n-   Meriadoc Brandybuck (Merry)\n-   Peregrin Took (Pippin)\n-   Elrond\n-   Galadriel\n-   Aragorn\n-   Boromir\n-   Gimli\n-   Legolas\n\n+:------------------:+:-------------------------:+:------------------:+\n| Previous novel:    | LORD OF THE RINGS         | Next novel:        |\n| FIRST IN SERIES    | NOVELS                    | THE TWO TOWERS     |\n+--------------------+---------------------------+--------------------+"
  },
  {
    "title": "The Two Towers (novel)",
    "page_id": "88",
    "text": "_For the LPMUD of the same name, see The Two Towers (MUD)._\n\n_THE TWO TOWERS_ is the second novel in the Lord of the Rings trilogy.\n\n\n\n_THE TWO TOWERS_ is the second volume of J. R. R. Tolkien's _The Lord of\nthe Rings_. It is preceded by _The Fellowship of the Ring_ and followed\nby _The Return of the King_.\n\n\nTitle\n\n\n\nTolkien came up with the title under deadline pressure and later\nexpressed dissatisfaction with it. In letters and one sketch, he\nconsidered several possible sets of towers, including Minas Tirith and\nBarad-dûr, and even the possibility of leaving the matter ambiguous.\nHowever, he eventually settled on Orthanc and Minas Morgul and wrote a\nnote to this effect which appears at the end of most editions of _The\nFellowship of the Ring_. He also produced a final cover illustration\nshowing these towers, but the publisher decided not to use it in order\nto save money on the production costs.\n\nLoosely, any pair from a set of six towers in the story could plausibly\nfit the title: Cirith Ungol, Orthanc, Minas Tirith, Barad-dûr, Minas\nMorgul, and the Hornburg.\n\n\nStructure\n\nBecause _The Two Towers_ is the central portion of a longer work, its\nstructure differs from that of a conventional novel. It begins and ends\nabruptly, without introduction to the characters, explanations of major\nplot elements or a satisfying conclusion. The first section follows the\ndivergent paths of several important figures from _The Fellowship of the\nRing_, but tells nothing of its central character, on whose fate so much\ndepends, enabling the reader to share in the suspense and uncertainty of\nthe characters themselves. The narrative of the second part returns to\nthe hero's quest to destroy the evil that threatens the world. While the\nfirst section tells of an epic battle, the struggles in much of the\nsecond are internal.\n\n\nContents\n\nBook III: The Treason of Isengard\n\n\n\nHobbits Merry and Pippin escape from the Orcs who captured them when the\norcs themselves are attacked by the Riders of Rohan. Merry and Pippin\nhead into nearby Fangorn Forest where they encounter treelike giants\ncalled Ents.\n\nThe forest generally keep to themselves, but are moved to oppose the\nmenace posed to the trees by the wizard Saruman, who has been chopping\ndown trees in the forest to fuel fires for his furnaces.\n\nAragorn, Gimli the Dwarf and Legolas the Elf, tracking Merry and Pippin,\ncome across the Riders of Rohan who tell them that they attacked the\norcs the previous night and left no survivors. However, Strider is able\nto find small prints and they follow these into Fangorn, where they meet\na white wizard who they at first believe to be Saruman, but who turns\nout to be their wizard friend Gandalf, whom they believed had perished\nin the mines of Moria. He tells them of his fall into the abyss, his\nbattle to the death with the Balrog and his reawakening. The four ride\nto Edoras and persuade King Théoden that his people are in danger. In\nthe process, Saruman's agent in Edoras, Grima Wormtongue, is expelled\nfrom the city. Aragorn, Gimli and Legolas then travel to the defensive\nfortification Helm's Deep while Gandalf goes north in search of\nErkenbrand's men to bring as reinforcements. At Helm's Deep, they resist\nan onslaught of Orcs and Men sent by Saruman, and Gandalf arrives the\nnext morning with the Westfold army led by Erkenbrand just in time. The\nfleeing orcs run into a forest of Huorn half-tree, half-ent creatures\nand none escape. Aragorn, Gimli, Legolas, Gandalf and the Rohirric army\nthen head to Saruman's stronghold in Isengard.\n\nThere, they reunite with Merry and Pippin and find the city overrun by\nEnts, who have flooded it with the nearby river, and the central tower\nof Orthanc besieged, with Saruman in it. After giving Saruman a chance\nto repent, Gandalf casts him out of the order of wizards. Wormtongue\nthrows something from a window at Gandalf and those with him. This turns\nout to be one of the _palantíri_. Pippin, unable to resist the urge,\nlooks into it and has an encounter with Sauron. Gandalf and Pippin then\nhead for Minas Tirith in preparation for the upcoming war.\n\nChapters\n\n-   I - THE DEPARTURE OF BOROMIR - Aragorn finds Boromir hit with many\n    arrows, who tells him that orcs took Merry and Pippin, and that they\n    were still alive. Boromir dies, and his body is set down the stream\n    on a 'funeral boat'; Aragorn, Legolas and Gimli decide to follow the\n    orcs who had captured Merry and Pippin, rather than following Frodo\n    and Sam. The three of them set off to chase the orcs.\n-   II - THE RIDERS OF ROHAN - They follow the trail of the orcs and\n    find several clues as to what happened with the hobbits, then meet a\n    company of Rohirrim led by Éomer, who tell them that the orcs were\n    destroyed and none were left alive. They camp near the site of the\n    orc massacre.\n-   III - THE URUK-HAI - This chapter begins further back in time,\n    telling the story of Merry and Pippin being captured by the orcs,\n    who are led by Ugluk from Saruman's army, and Grishnakh from Mordor.\n    The two sides of orcs are constantly arguing. The orcs camp near\n    Fangorn and Grishnakh attempts to take the hobbits away with him.\n    The hobbits escape as Grishnakh is killed by an arrow. They flee\n    into Fangorn Forest as the men of Rohan attack the orcs.\n-   IV - TREEBEARD - Merry and Pippin meet Treebeard the Ent, who calls\n    an Entmoot, a gathering of Ents in Derndingle. The hobbits meet\n    another ent, Quickbeam. After three days of deliberation, the ents\n    decide at the entmoot to attack Isengard.\n-   V - THE WHITE RIDER - The chapter goes back to the story of Aragorn,\n    Legolas and Gimli, who discover signs that the hobbits escaped the\n    orcs into the forest. They meet an old man, who they at first\n    presume to be Saruman, but who turns out to be Gandalf. They set off\n    for Edoras.\n-   VI - THE KING OF THE GOLDEN HALL - The four of them reach Edoras and\n    talk with King Theoden. Wormtongue is thrown out of the city.\n    Theoden gives Gandalf the horse Shadowfax.\n-   VII - HELM'S DEEP - Aragorn, Legolas and Gimli are at Helm's Deep\n    with the Rohan army, defending the people of Rohan from attack by\n    the army of Saruman.\n-   VIII - THE ROAD TO ISENGARD - They travel to Isengard, and see that\n    it has been destroyed. At Isengard they find Merry and Pippin.\n-   IX - FLOTSAM AND JETSAM - Merry and Pippin tell the story of how the\n    ents attacked Isengard, in amongst the ruins or 'flotsam and jetsam'\n    of the city.\n-   X - THE VOICE OF SARUMAN - Saruman has a very persuasive voice,\n    which he almost uses to persuade Theoden and the others until\n    Gandalf casts him from the order of wizards. Wormtongue throws the\n    Palantír of Orthanc from the tower, which misses Gandalf, and is\n    picked up by Pippin.\n-   XI - THE PALANTIR - Pippin picks up the Palantír and is seen by\n    Sauron. Gandalf explains the origin of the Palantír; Gandalf sets\n    off with Pippin for Minas Tirith, riding on Shadowfax.\n\nBook IV: The Journey of the Ringbearers / The Ring Goes East\n\nFrodo and Sam discover Gollum stalking them as they try to reach Mount\nDoom to destroy the One Ring. Gollum hopes to reclaim the Ring. Sam\nloathes and distrusts him, but Frodo pities him. Gollum promises to lead\nthem to a secret entrance to Mordor and for a time appears to be a true\nally. They first stop at the Black gate of Mordor, where Gollum\npersuades them not to go in, where they would surely have been caught.\nThey head south into Ithilien, and are captured by Faramir, the brother\nof Boromir. Faramir learns from Frodo of his brother's death and the\nplan to destroy the ring, and eventually allows them to go on their way.\nGollum leads them into the lair of Shelob, an enormous spider-like\ncreature, who inflicts her poisonous bite on Frodo. Sam resolves to\nfinish the quest himself and takes the Ring. However, when Orcs take\nFrodo's body, he follows them and learns that Frodo is not dead but\nunconscious and now their prisoner. The last line of the book is “Frodo\nwas alive but taken by the enemy.”\n\nChapters\n\n-   I - THE TAMING OF SMEAGOL - Gollum joins Frodo and Sam, after Sam\n    captures him.\n-   II - THE PASSAGE OF THE MARSHES - They pass through the Dead\n    Marshes.\n-   III - THE BLACK GATE IS CLOSED - They reach the gate of Mordor,\n    Gollum persuades them not to go in, and they head south.\n-   IV - OF HERBS AND STEWED RABBIT - They reach the pleasant country of\n    Ithilien. Title refers to the rabbits Gollum catches that Sam cooks;\n    the smoke from the fire causes them to be seen by men of Gondor led\n    by Faramir, and they witness an attack on a Southron army, and an\n    Oliphaunt.\n-   V - THE WINDOW ON THE WEST - Frodo and Sam are captured by Faramir's\n    men and they are blindfolded on their way to Henneth Annûn. Frodo\n    and Faramir discuss Boromir's death.\n-   VI - THE FORBIDDEN POOL - Faramir shows Frodo they have found Gollum\n    at the Forbidden pool. Frodo saves him from being shot by Faramir's\n    men.\n-   VII - JOURNEY TO THE CROSS-ROADS - Frodo, Sam and Gollum leave\n    Faramir. They travel to the crossroad of the road east between\n    Osgiliath and Minas Morgul, and the north-south road from the Black\n    Gate to the southlands.\n-   VIII - THE STAIRS OF CIRITH UNGOL - They witness an army leaving\n    Minas Morgul.\n-   IX - SHELOB'S LAIR - encounter with Shelob the spider.\n-   X - THE CHOICES OF MASTER SAMWISE - Frodo is taken by the orcs. Sam\n    listens to the orcs talking about him, which is how he finds out\n    that he is still alive (he had thought that Shelob had killed\n    Frodo)."
  },
  {
    "title": "The Return of the King (novel)",
    "page_id": "90",
    "text": "The Return of the King is the third and final volume of J. R. R. Tolkien's _The Lord of the Rings_, following _The Fellowship of the Ring_ and _The Two Towers_.\n\n\nTitle\n\n\n\nTolkien conceived of _The Lord of the Rings_ as a single volume\ncomprising six sections he called “books” and extensive appendices. The\noriginal publisher made the decision to split the work into three parts,\npublishing the fifth and sixth books and the appendices under the title\n_The Return of the King_, in reference to Aragorn's assumption of the\nthrone. Tolkien indicated he would have preferred _The War of the Ring_\nas a title, as it gave away less of the story.\n\n\nStructure\n\nThe structure of _The Return of the King_ mirrors somewhat that of _The\nTwo Towers_ in that the first section recounts the various adventures of\nseveral characters including a massive battle, and the second section\nresumes the quest of the Ring-bearers.\n\n\nContents\n\nBook V: The War of the Ring\n\nThe story begins as Gandalf delivers news to Denethor, the steward of\nGondor, that war is imminent. Gandalf brings Pippin with him, who enters\nthe service of the steward. Aragorn, by his courage and leadership,\nproves himself a worthy ruler of men. He is destined to find a lost army\nof men now dead yet entrapped in a curse set forth long ago by their own\ndisobedience, in the place known as the Paths of the Dead. The remnants\nof the Fellowship lead the forces of Gondor and Rohan in defence of\nGondor's capital city, Minas Tirith, resulting in the cataclysmic Battle\nof the Pelennor Fields. Those characters who manage to survive the\nbattle are led by Aragorn on an assuredly suicidal feint-attack against\nthe Black Gates of Mordor, partly to distract Sauron from defending his\nother borders so that Frodo and Sam can gain a clear passage into\nMordor. Aragorn's company now surrounds the Black Gates of the Morannon\nexchanging idle words with the Mouth of Sauron.\n\nChapters\n\n-   I - MINAS TIRITH - Gandalf and Pippin arrive in Minas Tirith; they\n    talk with Denethor; Pippin enters the service of the steward.\n-   II - THE PASSING OF THE GREY COMPANY - Follows Aragorn, Legolas and\n    Gimli as they pass through the Paths of the Dead between Rohan and\n    Gondor.\n-   III - THE MUSTER OF ROHAN - Rohan prepares for war; Merry heads off\n    for Minas Tirith, on a horse with a rider who calls himself\n    Dernhelm.\n-   IV - THE SIEGE OF GONDOR - Back to Gandalf and Pippin, and the\n    preparations of the city of Minas Tirith for the attack by the\n    armies of Mordor; Minas Tirith is besieged; chapter ends with the\n    gate of Minas Tirith broken, and the army of Rohan finally arriving.\n-   V - THE RIDE OF THE ROHIRRIM - The Rohirrim pass through the Druadan\n    Forest with the aid of the wild men who live there, who are led by\n    Ghan-buri-Ghan; the army arrives in Minas Tirith.\n-   VI - THE BATTLE OF THE PELENNOR FIELDS - Armies of Rohan and Gondor\n    fight the armies of Mordor, Rhun and Harad as described in Battle of\n    the Pelennor Fields; Merry and Eowyn together kill the chief of the\n    Nazgûl, the Witch-king of Angmar.\n-   VII - THE PYRE OF DENETHOR - Denethor goes mad and tries to burn\n    Faramir alive (believing him to be dead); he is saved by Gandalf;\n    Denethor then sets fire to himself. They discover that Denethor has\n    been using a Palantir.\n-   VIII - THE HOUSES OF HEALING - Merry, Faramir, Éowyn and many others\n    are injured and placed in the houses of healing; Aragorn uses\n    kingsfoil to help treat the injured.\n-   IX - THE LAST DEBATE - Gimli and Legolas meet Merry and Pippin\n    again; the captains of the west hold a counsel on their next action;\n    they decide to send 7000 men against Mordor to march on the Black\n    Gate.\n-   X - THE BLACK GATE OPENS - The army, with Gandalf, Aragorn, Gimli,\n    Legolas and Pippin (but not Merry) marches to the Black Gate. The\n    Mouth of Sauron comes out to discuss terms, and presents tokens,\n    which were owned by Frodo; he then departs and the army of Mordor\n    attacks them.\n\nBook VI: The End of the Third Age/ The Return of the King\n\nIn the meanwhile, the brave and loyal Sam Gamgee (who for a short time\nhad himself become the ring-bearer) enables the long-suffering Frodo\nBaggins to navigate the barren wasteland of Mordor. For part of the way,\nthey are captured by a company of Orcs and must pretend to be orcs\nbefore they are able to escape. The company, tired and half-alive,\nfinally reaches the Crack of Doom, where the One Ring is destroyed along\nwith Gollum, freeing Middle-earth from Sauron's power forever. This\nhappens when Frodo at the last moment decides to keep the ring rather\nthan destroy it, and is attacked by Gollum who bites off Frodo's finger\nto take the ring, trips, and falls into the lava while still holding the\nring. Frodo and Sam are rescued by the giant eagles whom Gandalf rides\nto Mount Doom, from the black gates of Morannon. After Sauron is\ndefeated, his armies at the black gates flee, and the men of Gondor and\nRohan are victorious in the battle.\n\nAragorn is crowned King of Gondor at Minas Tirith. After a series of\ngoodbyes, the Hobbits return home, only to find the Shire under the\ncontrol of 'Sharkey' who they find out is Saruman, diminished in power\nbut not in malevolence. Merry and Pippin, now experienced warriors of\nRohan and Gondor respectively, take the lead in setting things right\nagain, and lead an uprising of hobbits against Saruman, freeing the\nshire. Time passes. The Shire heals, but Frodo does not. Eventually\nFrodo departs for the Undying Lands to find healing, along with Bilbo\nBaggins, Gandalf and the Elves. Sam, Merry and Pippin watch them depart\nand return home in silence. Sam is greeted by his wife Rose and his\ndaughter Elanor. In the last line of the book Sam says to Rose; “Well,\nI'm back”.\n\nChapters\n\n-   I - THE TOWER OF CIRITH UNGOL - Sam infiltrates the Orc tower to\n    find Frodo.\n-   II - THE LAND OF SHADOW - Sam and Frodo make their way into Mordor;\n    they are captured by an Orc company.\n-   III - MOUNT DOOM - Frodo and Sam reach Mount Doom; the final battle\n    for the ring between Gollum and Frodo.\n-   IV - THE FIELD OF CORMALLEN - The story returns to the Field of\n    Cormallen, continuing from Book Five, chapter X; the eagles arrive;\n    Captains of the west victorious; Frodo and Sam rescued by Gandalf;\n    all the company meets again in Ithilien.\n-   V - THE STEWARD AND THE KING - chapter begins in Minas Tirith at the\n    Houses of Healing after the armies departed for the black gate;\n    Éowyn taken to see Faramir; Merry is also in Minas Tirith; later\n    they see the arrival of the armies with Aragorn, Gandalf and the\n    four hobbits; Gandalf crowns Aragorn King of Gondor; Aragorn makes\n    Faramir prince of Ithilien and keeps the office of steward; Gandalf\n    takes Aragorn to Mount Mindolluin to survey the lands of his\n    kingdom. On midsummer’s eve Elrond, Galadriel, Arwen and the elves\n    arrive in the city from the north; wedding of Aragorn and Arwen.\n-   VI - MANY PARTINGS - The company rides north to Rohan, then\n    Isengard, where Gimli and Legolas head north through Fangorn;\n    Aragorn returns to his kingdom; the rest of the company heads north\n    where they meet Saruman and Wormtongue who were just released from\n    Isengard; Galadriel and the Lorien elves leave over the pass of\n    Caradhras; the hobbits and Gandalf then arrive in Rivendell.\n-   VII - HOMEWARD BOUND - The hobbits and Gandalf travel to Bree where\n    they stay at the Prancing Pony, and are told by Butterbur that there\n    has been trouble in Bree while they have been away.\n-   VIII - THE SCOURING OF THE SHIRE - The hobbits arrive in the Shire\n    to find it taken over by 'the Chief' or 'Sharkey' at Bag End; Battle\n    of Bywater; the hobbits find Saruman and Wormtongue at Bag End;\n    Wormtongue kills Saruman, and is then killed himself by hobbit\n    archers.\n-   IX - THE GREY HAVENS - cleaning up of the Shire; several years pass;\n    Sam and Frodo meet the elves and Bilbo travelling west through the\n    Shire; they travel to the Grey Havens where they meet Gandalf, and\n    Merry and Pippin arrive; Frodo, Bilbo, Gandalf and the elves set\n    sail to the west; Sam returns to Rose and their daughter Elanor at\n    Bag End."
  },
  {
    "title": "The Notion Club Papers",
    "page_id": "3450",
    "text": "THE NOTION CLUB PAPERS is the title of an abandoned novel that Tolkien,\nwrote during 1945 and published posthumously in _Sauron Defeated_, the\n9th volume of _The History of Middle-earth_.\n\n\nStory\n\nThe paper is a space/time/dream travel story, written at the same time\nas _The Lord of the Rings_ was being developed. The story itself\ninvolves the minutes of the meetings of an arts discussion club at\nOxford, a fictionalization of (and a pun on) Tolkien's own Club, The\nInklings.\n"
  },
  {
    "title": "The New Shadow Cult",
    "page_id": "25399",
    "text": "THE NEW SHADOW CULT was the topic of Tolkien's unfinished book, _The New\nShadow_.\n\nIt was to be a secret Melkorist religion of young misguided Men of\nGondor in the early Fourth Age, after the events of _The Lord of the\nRings_. It involves the worship of Saruman, Sauron, and Morgoth, led by\nsomeone named Herumor. Saelon, another key figure in the novel, might be\na possible member.\n\n\nTolkien's comment on _The New Shadow_\n"
  },
  {
    "title": "Finn and Hengest",
    "page_id": "6902",
    "text": "FINN AND HENGEST is a study by J.R.R Tolkien, edited by Alan Bliss and\npublished posthumously in book form in\n1982.\n\nIt is not a work of Middle-earth canon.\n\n\nAbout\n\nFinn and Hengest are two Anglo-Saxon heroes appearing in the Old English\nepic poem _Beowulf_ and in the fragment of “The Fight at Finnsburg”.\nHengest has sometimes been identified with the Jutish king of Kent. He\nand his brother Horsa (the names meaning “stallion” and “horse”) were\nthe legendary leaders of the first Anglo-Saxon immigrants to Britain as\nmercenaries in the 5th century).\n\nThe book is based on an edited series of lectures Tolkien made before\nand after World War II. In his lectures, Tolkien argued that the Hengest\nof “The Fight at Finnsburg” and of _Beowulf_ was an historical rather\nthan a legendary figure and that these works record episodes from an\norally composed and transmitted history of the Hengest named in the\n“Anglo-Saxon Chronicle.” This view has gained acceptance from a number\nof medieval historian and Anglo-Saxon scholars both since Tolkien's\ninitial lectures and since the publication of this posthumous\ncollection.\n\nTolkien's lectures describe what he called the “Jutes-on-both-sides\ntheory”, which was his explanation for the puzzling occurrence of the\nword ēotenas in the episode in _Beowulf_. Tolkien read the word as\nJutes, and theorized that the fight was a purely Jutish feud, and Finn\nand Hnæf were simply caught up by circumstance. Tolkien explained both\ntheir presence and their ambiguous loyalty with his following\ninterpretation of the story.\n\n\nSynopsis\n\nHnæf, son of Hoc Half-Dane, is the lord of a Danish people who have\nconquered part of Jutland (probably the northern part of the Cimbrian\npeninsula) and exiled its former Jutish rulers. Finn, king of Frys-Land\n(modern-day Friesland in the Netherlands) has allowed dispossessed Jutes\nto settle in his lands and enter his service. Finn marries Hnæf's older\nsister Hildeburh, and sends their son (whose name was probably\nFriðuwulf) to be fostered in Hnæf's household.\n\nAround the year AD 450, Hnæf sails to Frys-Land in the autumn; his\npurpose is to return Finn's now-grown son and spend the winter in Finn's\ncitadel, celebrating Yule. He brings a retinue of some sixty thanes.\nChief among these thanes is a Jute named Hengest, leader of a band of\nJutes who have taken service under Hnæf. Unfortunately, and foreseen by\nno one, when they arrive at Finn's stronghold they find that many of\nFinn's thanes are also Jutes, particularly one Garulf, who seems to be\nthe rightful heir to the kingdom conquered by Hnæf's people; and these\nFrisian Jutes are at blood feud with Hengest and his band, because\nHengest supports the conquering Danes, if for no other reason. This\nwould explain why Hildeburh “had no cause to praise the fealty of the\nJutes,” since that fealty led to the re-awakening of the feud, which\nkilled her brother, husband, and son.\n\nFinn (who seems guiltless in Tolkien's interpretation) tries to prevent\ntrouble by separating the parties, and allowing Hnæf and his thanes to\noccupy the royal hall, while he removes his own thanes to a different\nbuilding. However, the Frisian Jutes make a pre-dawn attack, hoping to\ntake Hengest and his band by surprise. But the Danes have been expecting\ntrouble, and a watchman sees the light of their approaching torches. He\nasks rhetorically, “What is this light? Is it the dawn in the East, or\nis it the flight of a dragon, or are the gables burning?” Hnæf answers,\n“Neither is this the dawn in the East, nor is it the flight of a dragon,\nnor are the gables of this hall burning,” it is an attack. Prepared, the\nDanes and Hengest's Jutes barricade the two doors of the hall against\nattack. Garulf is warned by one Guðhere not to risk his “precious life”\nin the assault, but he attacks and is the first to fall. Finn's Frisian\nthanes, who have ties of marriage and friendship to Finn's Jutish\nthanes, join in the fight against the Danes. The Danes hold the hall for\nfive days without losing a man. On the morning of the fifth day the\nFrisians force their way into the hall, and in the battle, both Hnæf and\nFriðiwulf are killed. (It is not clear which side Friðiwulf was fighting\non, but Tolkien thinks it likely he was staying in the hall with Hnæf,\nhis foster-father and uncle; this would explain why Beowulf emphasizes\nthat Friðiwulf was laid on the funeral pyre at Hnæf's side.) The\nsurviving Danes and Hengest's Jutes drive the Frisians and Jutes out of\nthe hall and re-barricade the door.\n\nAt this point Finn (who may not have joined in the fight personally)\nintervenes and offers to make a bargain with the survivors. As Tolkien\npoints out, the Danes had several advantages:\n\n1) Finn had lost so many men that he could not force his way into the\nhall again. 2) The Danes were occupying his royal hall, and he was\nunwilling to burn it to get them out. 3) Finn must have felt both guilty\nand ashamed that his feuding thanes had killed Hnæf, who was his\nbrother-in-law and guest. Inside the hall, the survivors are in two\ngroups: Danes, led by a chief thane who is described as Hunlafing (“the\nson of Hunlaf”) and Jutes, led by Hengest. The Jutes are Hengest's own\nband, and owed loyalty to Hnæf only because Hengest followed him. Finn\nat first tries to make peace with the Danes only, but the Danes loyally\ninsist that any peace agreement must include Hengest and his men. Finn\nagrees, and swears an oath of peace: the Danes and Hengest's men will\nlay down their arms, and since they cannot leave Frys-Land until the\nwinter ends, they will sit at Finn's table and technically accept him as\ntheir protector (since he was now their only possible source of food and\nmaintenance, and they had intended to be his guests throughout the\nwinter anyway.) Finn gives the Danes a separate hall to dwell in for the\nwinter, specifying that they shall share it with the sons of the Jutes\n(meaning Hengest and his band.) He also swears that any one of his own\nthanes who tries to renew the feud (by taunting the Danes that they now\nfollow the slayer of their lord) will be punished, possibly with death,\nby Finn himself. The bodies of Hnæf and Friðiwulf are honorably burned.\n\nOver the winter, the Danes and their Jutish allies brood over the fall\nof Hnæf. Hengest is faced with a conflict of duty: whether to honor the\npeace-treaty with Finn, or to honor his duty to avenge his fallen lord.\nFinally the son of Hunlaf takes a sword Hildeleoma (“Battleflame”) which\nwas probably Hnæf's sword, and lays it in Hengest's lap. Hengest “does\nnot refuse the world's counsel” (that is, he goes along with what\neveryone agrees is right) and decides that his loyalty to Hnæf must\noutweigh his obligation to Finn. (In any case, Tolkien points out that\nwe do not see Hengest swearing any oath to Finn; we only see Finn\nswearing oaths to Hengest and the Danes.) When the spring comes, the\nDanes sail home and tell the story of the downfall of Hnæf. They return\nto Finn's stronghold in force. Hengest, having remained in Frys-Land\nunder the guise of upholding the terms of the peace-treaty, opens the\ngates to the invaders and the Danes sack Finn's stronghold, kill Finn\nand all his men, loot and burn the city and return home, taking\nHildeburh with them."
  },
  {
    "title": "Mr. Bliss",
    "page_id": "6901",
    "text": "_MR. BLISS_ is a children's picture book by J. R. R. Tolkien,\npublished posthumously in 1982. It tells the story of Mr. Bliss and his\nfirst ride in his new motor-car. Many adventures follow like encounters\nwith bears, angry neighbors irate shopkeepers, and assorted collisions.\n\n\nAbout\n\nThe story line was inspired by Tolkien's own vehicular mishaps with his\nfirst automobile. The bears were based on toy bears owned by Tolkien's\nsons. Tolkien was both author and illustrator of the book. His narrative\nbinds the story and illustrations tightly together, as the text often\ncomments directly on the pictures. Despite not being published during\nTolkien's lifetime, he submitted the book to his publishers as a balm to\nreaders who were hungry for more from Tolkien after the success of _The\nHobbit_. The lavish ink and colored pencil illustrations would have made\nproduction costs prohibitively expensive so Tolkien agreed to redraw the\npictures in a simpler style, although that never came to happen.\n\nThe book was eventually published in 1982, with Tolkien's\ndifficult-to-read handwritten story and illustrations on one page, and a\ntypeset transcription on the facing page."
  },
  {
    "title": "The Children of Húrin",
    "page_id": "6109",
    "text": "THE CHILDREN OF HÚRIN (ISBN 0-618-89464-0) is the first of the Great\nTales. It is a story started by J.R.R. Tolkien in 1918 which was\npublished in 2007, once more than thirty years-worth of notes written by\nTolkien were compiled and edited by his son, Christopher.\n\nIt is the expanded account of the story of the wanderings and deeds\nof Túrin Turambar, son of Húrin, and his sister Niënor, their struggle\nagainst fate (and the curse cast upon Húrin's kin), as well as the\ntragic end of their lives and that of their mother, Morwen.\n\n\nThe Synopsis\n\nCHRISTOPHER TOLKIEN:\n\n\"There are tales of Middle-earth from times long before _The Lord of the\nRings_, and the story told in this book is set in the great country that\nlay beyond the Grey Havens in the North: lands where Treebeard once\nwalked, but which were drowned in the great cataclysm that ended the\nFirst Age of the World.\n\nIn that remote time Morgoth, the first Dark Lord, dwelt in the vast\nfortress of Angband in the North; and the tragedy of Turin and his\nsister Nienor unfolded within the shadow of the fear of Angband and the\nwar waged by Morgoth against the lands and secret cities of the Elves.\n\nTheir brief and passionate lives were dominated by the elemental hatred\nthat Morgoth bore them as the children of Hurin, the man who had dared\nto defy and to scorn him to his face. Against them he sent his\nformidable servant, Glaurung, a powerful spirit in the form of a huge\nwingless dragon of fire. Into his story of brutal conquest and flight,\nof forest hiding-places and pursuit, of resistance with lessening hope,\nthe mythological persons of the God and the Dragon enter in fearfully\narticulate form. Sardonic and mocking, Glaurung manipulated the fates of\nTúrin and Nienor by lies of diabolic cunning and guile, and the curse of\nMorgoth was fulfilled.\n\nThe earliest versions of this story by J.R.R. Tolkien go back to the end\nof the First World War and the years that followed; but long afterwards,\nwhen _The Lord of the Rings_ was finished, he wrote it anew and greatly\nenlarged it in complexities of motive and character: it became the\ndominant story in his later work on Middle-earth. But he could not bring\nit to final and finished form. In this book I have endeavoured to\nconstruct, after long study of the manuscripts, a coherent narrative\nwithout any editorial invention."
  },
  {
    "title": "The Book of Lost Tales",
    "page_id": "43392",
    "text": "J.R.R. Tolkien's _Lost Tales_ were compiled by his son, Christopher\nTolkien, and published into two volumes.\n\n_If you were redirected here from a page-reference, “THE BOOK OF LOST\nTALES” refers to THE BOOK OF LOST TALES PART ONE._\n\n_The other volume is THE BOOK OF LOST TALES PART TWO. On this Wiki, the\nindicator “PART TWO” is sometimes shortened to II or 2._\n\nde:Das Buch der Verschollenen Geschichten, Teil 1 it:Racconti Perduti\nru:Книга Утраченных Сказаний"
  },
  {
    "title": "The Adventures of Tom Bombadil",
    "page_id": "279",
    "text": "_THE ADVENTURES OF TOM BOMBADIL_ is a collection of poetry by J.R.R.\nTolkien, published in 1962 (ISBN 0044407262). The book contains 16\npoems, only two of which deal with Tom Bombadil, a character who is most\nfamous for his encounter with Frodo Baggins in _The Fellowship of the\nRing_, the first volume in Tolkien's best-selling _The Lord of the\nRings_. The rest of the poems are an assortment of bestiary verse and\nfairy tale rhyme.\n\nThe book was illustrated originally by Pauline Baynes and later by Roger\nGarland.\n\n\nEditions\n\n2014 Edition\n\nThe 2014 release can be seen as a kind of special edition as it not only\nincludes the main published poems and artwork, but also a new\nIntroduction, 'commentary' section that discusses the history of each\npoem, and secondary early versions of the poems. It also includes an\nappendix with an unreleased fragment of prose story about Tom Bombadil,\nand two additional poems: _Once Upon A Time_ and _An Evening in\nTavrobel_.\n\n\nCanon\n\nThe book, like the first edition of _The Fellowship of the Ring_, is\npresented as if it is an actual translation from the Red Book of\nWestmarch, and contains some background information on the world of\nMiddle-earth which is not found elsewhere. Examples are the name of the\ntower at Dol Amroth and the names of the Seven Rivers of Gondor. There\nis some dispute about its canonical status since the information\npresented about the secondary world is considered only as folklore among\nthe Hobbits.\n\n_Tom Bombadil_ can best be seen as a small, poetic venture into\nTolkien's imagination.",
    "format": "Hardback in dustwrapper",
    "isbn": "None",
    "publisher": "George Allen and Unwin (UK)\nHoughton Mifflin (US)",
    "pages": "63",
    "author": "J.R.R. Tolkien",
    "released": "22 November 1962 (UK)\n1963"
  },
  {
    "title": "Quenta Silmarillion",
    "page_id": "2359",
    "text": "QUENTA SILMARILLION is a collection of fictional legends written by J.\nR. R. Tolkien. It was published after his death as part of _The\nSilmarillion_ together with four shorter stories. As Tolkien did not\nfinish it, the collection was completed by his son Christopher with\nassistance of the young Guy Gavriel Kay. The title _Quenta Silmarillion_\nis translated as “the Tale of the Silmarils”. The QUENTA SILMARILLION is\nthe third part of the _The Silmarillion._\n\n_Quenta Silmarillion_ is the largest final-rendition account of the\nFirst Age, and its stories narrate all of that Age's major events.\n\n\nContents\n\n-   Of the Beginning of Days\n-   Of Aulë and Yavanna\n-   Of the Coming of the Elves and the Captivity of Melkor\n-   Of Thingol and Melian\n-   Of Eldamar and the Princes of the Eldalië\n-   Of Fëanor and the Unchaining of Melkor\n-   Of the Silmarils and the Unrest of the Noldor\n-   Of the Darkening of Valinor\n-   Of the Flight of the Noldor\n-   Of the Sindar\n-   Of the Sun and Moon and the Hiding of Valinor\n-   Of Men\n-   Of the Return of the Noldor\n-   Of Beleriand and its Realms\n-   Of the Noldor in Beleriand\n-   Of Maeglin\n-   Of the Coming of Men into the West\n-   Of the Ruin of Beleriand and the Fall of Fingolfin\n-   Of Beren and Lúthien\n-   Of the Fifth Battle: Nirnaeth Arnoediad\n-   Of Túrin Turambar\n-   Of the Ruin of Doriath\n-   Of Tuor and the Fall of Gondolin\n-   Of the Voyage of Eärendil and the War of Wrath\n\n\nSynopsis\n\nTolkien envisaged _The Silmarillion_ as deriving from a manuscript\nwritten by an Eriol or Ælfwine of England; an imaginary Dark Age source\nfor the material, which itself contains little or no reference to the\npeople or events of the Second or Third Ages of his legendarium.\nOriginated from Elvish legends, in some parts it presents Elves as long\ngone, which hints that its final form was edited during the Fourth Age\nby Hobbits and/or Men.\n\nIt tells about the history of Arda (the Earth), after its creation by\nEru Ilúvatar. The Valar, angelic beings, enter into the world and try to\nshape it after a vision given to them by Eru. The initial shape of Arda,\nchosen by the Valar, was of a symmetrical continent lit by the Two\nLamps. However, the lamps were destroyed by the vicious Melkor; Arda was\ndarkened, and the lamps' fall spoiled the symmetry of Arda's surface.\nTwo main continents were created that are of concern to the story: Aman\nin the west, and Middle-earth in the east.\n\nFollowing this, Melkor hid himself from the Valar in his fortress Utumno\nin the north of Middle-earth. He also surrounded himself with horrible\nbeasts, many of them Maia in the form of fell animals, known as Balrogs.\n\nThe Valar moved to the western continent Aman where they established the\nrealm Valinor of which Manwë was made king. The Vala Yavanna created the\nTwo Trees which illuminated Valinor. Middle-earth, by contrast, was in\nperpetual darkness, and was seldom visited by the Valar. Only some of\nthem, most notably Oromë, visited it periodically, especially to prepare\nfor the coming of the Elves, which the Valar had foreseen in their\nvision and to keep an eye on Melkor's activities.\n\nIntroduction of the Elves\n\nOn one of his expeditions Oromë discovered the newly-awakened Elves at\nCuiviénen. The Valar, aware of the risk Melkor posed to the Elves,\nbeleaguered his fortress and finally overthrew him and took him prisoner\nto Valinor to serve “three ages” in the Halls of Mandos.\n\nOromë was then sent to the Elves again, to invite them to come with him\nto Aman and live there. Some of the Elves did not follow him or became\nsidetracked and stayed in Middle-earth, and so the Elves became\nsundered. These notably included the Sindar, who stayed in Middle-earth\nwhen their king, Thingol, became lost in the forest. He was to later\nemerge, married to the Maia Melian, and found the Kingdom of Doriath.\n\nThe Elves who accepted the summons were carried across the sea on a\nfloating island.\n\nThe Noldor and Melkor\n\nFinwë, the first High King of the Ñoldor, had a son Fëanor. At his birth\nFëanor drew so much life from his mother Míriel that she grew weary of\nlife and her spirit left her bodily form, departing to the halls of\nMandos. Eventually, Finwë married Indis and had two further sons,\nFingolfin and Finarfin. Fëanor became the most famous Elven craftsman,\nespecially by making the Silmarils, three jewels in which he trapped the\nlight of the Two Trees. The Silmarils were hallowed by Varda, and would\nburn any evil or mortal creature who touched them.\n\nAbout this time, Melkor, having completed his sentence, convinced the\nother Valar that he had reformed and he was released. By various lies he\nmanaged to play Fëanor and Fingolfin against each other, creating strife\nand division amongst the Noldor; furthermore, he convinced the Ñoldor\nthat they had been brought to Aman primarily so the Valar could keep\nthem under control. Finally, Fëanor rebelled against the Valar, publicly\nadvocating leaving and then drawing his weapon against Fingolfin.\n\nThe Valar were soon aware of Melkor's ultimate responsibility in this.\nTulkas hunted him, but Melkor had hidden and could not be found. Because\nhe threatened Fingolfin's life, Fëanor was exiled from Tirion for twelve\nyears. With his seven sons and his father Finwë he moved to a\nnewly-built stronghold, Formenos.\n\nCoveting the Silmarils, Melkor went to Formenos, hoping to trick Fëanor\nand gain possession of them, but Fëanor saw through his ruse and\ndismissed him with contempt. Melkor then traveled to Avathar in secret,\nwhere he joined forces with the evil spirit Ungoliant, whose form was a\ngiant spider-like creature. Melkor swore an oath to give Ungoliant\nwhatever she desired, and imparted some of his power to her. With her\nhelp, they traveled into Valinor secretly, where Ungoliant's poison\nkilled the Two Trees. Covered by an impenetrable blackness, Melkor and\nUngoliant then traveled to Formenos, assassinated Finwë and stole the\nSilmarils, before escaping in the confusion.\n\nMelkor and Ungoliant then made their way across to Middle-earth, and he\ngave Ungoliant all the great jewels he had stolen, except the Silmarils,\nwhich he desired to keep. The rapacious Ungoliant consumed them all and,\nstill hungry, she demanded the Silmarils, but the ever-treacherous\nMelkor reneged on his oath, so she seized him and bound him with her\nwebs, and his anguished cries echoed across all of Middle-earth.\n\nMelkor escaped from Ungoliant with the help of his former servants, the\nBalrogs, who came to his aid from their hiding places in the deepest\nrecesses of the ruins of Utumno, and he re-established his empire in the\nNorth from his secondary fortress of Angband. He placed the three\nSilmarils, which now were the only source of the unmarred light of the\nTwo Trees, in his Iron Crown, although his hands were burned black by\nthem.\n\nFëanor was furious at the death of his father and the theft of the\nSilmarils. Travelling to Tirion in violation of his exile, he publicly\nblamed both Melkor, whom he named Morgoth, and the Valar (for failing to\nprotect Finwë and the Silmarils). He urged the Noldor to leave Valinor,\nfor a punitive expedition against Morgoth and a new life in\nMiddle-earth. He and his sons then swore the notorious Oath of Fëanor,\nvowing to pursue with hatred anyone who withheld a Silmaril from them.\n\nDeparture of the Noldor and assault on Doriath\n\nInflamed by the passionate urging of Fëanor, most of the assembled\nÑoldor left Tirion, and traveled to Alqualondë, attempting to persuade\nthe Teleri to join them, or at least to lend them ships to cross the\nGreat Sea. When the Teleri refused, Fëanor ordered that the swan-ships\nbe taken by force; the notorious Kinslaying ensued, in which many Teleri\nwere slaughtered. Shortly afterwards, at the northern boundary of\nEldamar, the Noldor encountered Mandos, who cursed all the Ñoldor who\nleft with Fëanor .\n\nAt this point, Finarfin, who had always been reluctant to leave, turned\nback to Valinor with a small number of followers. Many ships had been\nlost by this time and not all the Ñoldor could cross to Middle-earth, so\nFëanor and his sons seized the remaining swan-ships, abandoning\nFingolfin and his followers (including Galadriel), who were obliged to\nmake their way to Middle-earth across the terrible ice wastes of the\nHelcaraxë. Approximately 2.2 million Noldor are said to have perished on\nthe Helcaraxë.\n\nMeanwhile, Morgoth attempted to conquer Doriath, the realm of Thingol\nand Melian in Middle-earth. In the first of five great Battles, he sent\nout two armies of Orcs, forcing Thingol and his Maia queen to establish\na magical boundary around Doriath, the “Girdle of Melian”, while the\ncoastal Elves were forced to retreat into their fortified harbour towns.\nBy luck, Fëanor and his host arrived at the height of this conflict and\nthe combined forces of the Ñoldor and the Sindar utterly defeated the\nOrc armies in the second Battle, Dagor-nuin-Giliath (Battle under the\nStars). However Fëanor, in his fury, chased after the retreating Orcs\nand he was ambushed and killed by Balrogs.\n\nThe Sun and the Moon, the Long Peace and the Coming of Men\n\nThe grieving Valar could not revive the Two Trees,because Fëanor would\nnot give up the silmarills which captured the light of the trees. But\nthey were able to create the Moon and the Sun from a silver leaf and a\ngolden fruit, which were all that remained of them. These new lights\nilluminated Middle-earth, stimulated much new plant and animal growth,\nand for a while, confounded the plans of Morgoth. Unable to assail them,\nas his once near-limitless power grew ever more dispersed among his\nservants, who feared the new lights no less than he, the Dark Lord was\nforced to take refuge in clouds and shadow that surrounded his\nstrongholds. In this era, Men, the younger Children of Ilúvatar, awoke\nin eastern Middle-earth, and some began to migrate westward.\n\nThe Ñoldor established kingdoms and principalities in northern and\ncentral Beleriand, which were ruled by the descendants of Fëanor,\nFingolfin and Finarfin. They built many great strongholds, including the\nvast cavern-city of Nargothrond, on the river Narog, and the mighty\nhidden mountain fortress of Gondolin, ruled by Turgon, from whence none\nwho entered were permitted to leave. Many of the Sindar, the native\nElves of Beleriand, were absorbed into the Ñoldorin kingdoms. Others\nwere in Sindarin states: Thingol's kingdom in Doriath, the coastal Falas\nruled by Círdan the shipwright, and the secretive Green-Elves of\nOssiriand.\n\nRelations between the Ñoldor and the independent Sindar were at first\namicable but they later deteriorated. The Ñoldor had long hidden the\ntruth about the Kinslaying and the Curse from Thingol, but he eventually\nlearned of it from Angrod. As a result he banned all the Ñoldor (except\nhis kin in the house of Finarfin) from entering Doriath, decreeing also\nthat the Noldorin tongue could no longer be spoken within his realm.\n\nA further rift between the Ñoldor and the Sindar, which was to have\nfar-reaching consequences, was caused by the actions of Aredhel,\ndaughter of Fingolfin and sister of Turgon. Tiring of her long\nconfinement in Gondolin, she rode east to seek out her old friends, the\nsons of Fëanor, but she was barred from crossing through Doriath by the\ndecree of Thingol. Forced to skirt along the edge of the dreaded region\nof Nan Dungortheb (where Ungoliant had gone after the escape of\nMorgoth), Aredhel was separated from her escort and lost. She was\neventually found by Eöl, the Dark Elf, a kinsman of Thingol who lived\nalone in the dark forest of Nan Elmoth. He took her as his wife, and\nthey had a son, Maeglin. Eöl often traveled east to deal with the\nDwarves of the Blue Mountains, and he acquired great skill in metalwork\nfrom them, which he imparted to his son. He refused to let his wife and\nchild leave his domain, but Aredhel determined to return to Gondolin\nwith her son, so they waited until Eöl left for the east and then made\ntheir escape.\n\nEöl pursued them to Gondolin, where he was captured and brought before\nTurgon. Eöl demanded that Maeglin should leave with him, or be cursed,\nbut Maeglin renounced his father. Turgon then decreed that Eöl must\neither remain in Gondolin or die. The next day, when he was again\nbrought before Turgon, Eöl tried to kill Maeglin with a poisoned lance,\nbut Aredhel stepped between them; struck in the shoulder, she died that\nnight. As punishment, Turgon had Eöl thrown to his death from the walls\nof the fortress. Maeglin remained in Gondolin, became a mighty warrior\nand wrought many great weapons, but his forbidden love for his cousin\nIdril Celebrindal would eventually cause him to betray Gondolin to\nMorgoth.\n\nAfter fifty years, and believing the Noldor to be unprepared for war,\nMorgoth again attacked the from the north, but Fingolfin and Maedhros\nwere ready for him and they defeated Morgoth's forces in the third\nBattle, called Dagor Aglareb, pursuing the Orcs to the very gates of\nAngband and destroying them utterly. They then laid the Siege of\nAngband, which lasted for four hundred years.\n\nAlmost one hundred years after the Dagor Aglareb, Morgoth's forces tried\nto attack the realm of Hithlum by stealing in from the far north-west,\nbut were intercepted and defeated by Fingon. After a further hundred\nyears, Morgoth sent forth the dragon Glaurung, the first of the\nFire-drakes. Being only half-grown and not fully armoured, Glaurung was\nunable to withstand Fingon and his archers, eventually fleeing back to\nAngband. The period after the first defeat of Glaurung became known as\nThe Long Peace, lasting almost two hundred years.\n\nIt was during this time, about three hundred years after the Noldor had\narrived in Beleriand, that Men first came into Middle-earth from the\nregions far to the east. They first appeared in Ossiriand, where\nFelagund was the first of the Noldor to see them. Over the next hundred\nyears many of them became allies of the Noldor in the war against\nMorgoth, and settled in Noldorin realms.\n\nThe Dagor Bragollach\n\nMorgoth, however, merely used the Siege as an opportunity to build up\nstrength, and in , renewed the war on his own terms. The fourth Great\nBattle, Dagor Bragollach became famous for the re-emergence of the\nDragon Glaurung in his full strength. Morgoth's armies overthrew the\nSiege, slaying many of the Noldor, with Glaurung laying waste to\nArd-galen and Dorthonion.\n\nEnraged by the assaults against his people, Fingolfin fearlessly made\nhis way alone to the gates of Angband, where he challenged Morgoth to\nsingle combat and the evil Vala was forced to come out and meet him\nrather than appear cowardly. In the ensuing battle Fingolfin wounded\nMorgoth seven times, but eventually stumbled and fell among the great\npits created by Morgoth's hammer, Grond. Morgoth beat Fingolfin to the\nground three times with his great shield, and then crushed Fingolfin\nunder his foot, but with his dying strength Fingolfin slashed Morgoth's\nfoot, maiming him.\n\nMorgoth broke Fingolfin's body and was about to throw the remains to his\nwolves, but Thorondor, the gigantic king of the eagles, had been\nwatching the battle from afar and at that moment flew down to rescue the\nbody. The giant eagle gouged Morgoth's face with his talons, seized\nFingolfin's body and carried it back to Gondolin for burial. After that\ntime Morgoth's seven wounds never healed, he became lame in his left\nfoot, where Fingolfin had hewn it, and his face forever bore the scars\nof Thorondor's talons.\n\nSixteen years later, Maedhros led the northern Ñoldor and their allies\namong Men in a final desperate attempt to defeat Morgoth. In this\nclimactic battle — which is named Nirnaeth Arnoediad— the forces of the\nÑoldor attacked Angband and briefly broke through the gates, only to be\nbeaten back when Morgoth unleashed his full forces, now vastly\noutnumbering those of Elves and Men. Led by the terrible dragon\nGlaurung, Morgoth's forces crushed the armies of the Ñoldor, and many of\nthe elf lords were killed or captured, leaving Morgoth master of the\nentire North. Afterwards, he set about destroying the remaining\nElf-kingdoms one by one.\n\nThe Dagor Bragollach was the battle in which Gil-galad left Hithlum for\nthe Havens of the Falas.\n\nBeren and Lúthien\n\nThe later parts of the _Quenta Silmarillion_ include two stories dealing\nwith individuals and with the relations between Men and Elves.\n\nThe tragic yet heroic story of Beren and Lúthien (which has similarities\nto the myth of Orpheus and Eurydice) tells of the love between the Man\nBeren and Lúthien, daughter of Thingol and Melian and the most beautiful\nof all Elf Maidens. Thingol, disliking mortal Men and determined to\nprevent their marriage, declares that he will consent only if Beren\nbrings Thingol a Silmaril from Morgoth's crown. Thus, in sending Beren\non this perilous quest, Thingol unwittingly binds himself to the Doom of\nMandos, ensuring his eventual downfall.\n\nTravelling to the mountains of Thangorodrim in disguise, Beren and\nLúthien succeed in making their way into Angband and to the very foot of\nMorgoth's throne. There Lúthien reveals herself, but her beauty and\ncharm enable her to briefly overcome the evil lord and she casts a spell\nthat puts Morgoth and his minions to sleep. Beren then cuts one of the\nSilmarils from Morgoth's iron crown, but when he attempts to take a\nsecond Silmaril his knife snaps and a shard flies off; it cuts Morgoth's\nface, and he begins to stir.\n\nAs they leave, Morgoth and his creatures reawaken and Beren and Lúthien\nare confronted by Carcharoth, the giant Wolf that guards the gate of\nAngband. Beren attempts to hold off the terrible creature with the power\nof the Silmaril, but Carcharoth bites off his hand and swallows the holy\njewel. Driven mad by the pain it inflicts, the creature goes on a\nrampage through Doriath until it is eventually killed by the mighty\nElf-hound Huan. In this final battle Beren is fatally wounded by\nCarcharoth, so Lúthien travels in spirit to the Houses of the Dead, to\nplead with Mandos for Beren's release. She and Beren are sent back to\nMiddle-earth alive, but Lúthien becomes a mortal woman, so that in time\nthey will both die and leave the Universe together. As immortals whose\nsouls are bound to Arda for as long as it lasts, Thingol and Melian\nsuffer the grief of being deprived of their daughter for all time.\n\nTúrin Turambar\n\n_Main article: Túrin Turambar_\n\n_See also: The Children of Húrin_\n\nAlso included is the story of Túrin Turambar. His father Húrin is\ncaptured at the end of the Battle of Unnumbered Tears, and for his\ndefiance, Morgoth places a curse on his family. Túrin becomes a great\nhero, but due partly to his hot temper and partly to a string of bad\nluck (in fact, the working of Morgoth's demonic will), whatever he turns\nhis hand to seems to go wrong, and death and grief haunt those around\nhim. Making matters worse, both Túrin and his sister Niënor are\nenchanted by the mighty dragon Glaurung — who has sacked the great\nElf-city of Nargothrond and taken up residence there — and they fall in\nlove and live for time as man and wife. Eventually Túrin kills Glaurung,\nbut with his death the spell is lifted. Driven mad by the realisation of\ntheir sins, Túrin and Nienor both commit suicide.\n\nGondolin\n\nThe last Elf-Kingdom to fall was the hidden city of Gondolin. Tuor, a\nmortal man, was sent by Ulmo as a messenger to Gondolin, to warn King\nTurgon of the city's impending destruction. Remaining in Gondolin, Tuor\nmarried Turgon's daughter, Idril, and they had a son Eärendil. Gondolin\nwas eventually betrayed to Morgoth by Maeglin, and destroyed. Turgon\nfell during the battle and the High Kingship passed to Gil-galad, who\ndwelt at the Mouth of Sirion. Tuor, Idril and Eärendil escaped, together\nwith a number of refugees.\n\nGrowing up, Eärendil married Elwing, granddaughter of Beren and Lúthien\nand current keeper of the Silmaril they took from Morgoth. With the help\nof the Silmaril, Eärendil and Elwing sailed to Valinor to plead with the\nValar, asking them to pardon the Noldor and assist Elves and Men in\ntheir need. The Valar agreed to this request, and set Eärendil, with the\nSilmaril, to sail the skies as a star until the ending of the world.\n\nBattle between Morgoth and the Host of the Valar\n\nThe Host of the Valar, led by Eönwë, finally attacked Morgoth in\nAngband. In this battle, the Great Battle (also known as the War of\nWrath), Morgoth was utterly defeated; his armies were destroyed, with\nonly a few remnants scattered across the Earth. He was taken prisoner\nand his two remaining Silmarils were confiscated. Maedhros and Maglor,\nFëanor's two surviving sons, stole the Silmarils from Eönwë, but they\nfound the Silmarils would not tolerate their touch, instead tormenting\nthem with burning pain. Maedhros committed suicide by jumping with the\nSilmaril into a chasm in the earth, and Maglor threw his Silmaril away\ninto the sea.\n\nThe Valar pardoned the Ñoldor for their rebellion, and the Teleri\noffered forgiveness for the Kinslaying. Many of the Ñoldor and the\nSindar left Middle-earth and traveled into the West, to live in Valinor.\nMany more followed Gil-galad and stayed in Middle-earth. Morgoth was\ncast out of the World, imprisoned in the Void that lies behind the Walls\nof Night. The Silmarils were lost “unless the World be broken and\nre-made”, but each one found its home in one of the elements: sky,\nwater, and earth."
  },
  {
    "title": "Smith of Wootton Major",
    "page_id": "3782",
    "text": "SMITH OF WOOTTON MAJOR, first published in 1967, is a short story by J.\nR. R. Tolkien.\n\n\nBackground\n\nThe book grew out of an attempt to explain the meaning of “Faery” by\nmeans of a brief story about a cook and his cake. This would have been\npart of a preface to George MacDonald's famous faerie story _The Golden\nKey_. But the story grew from there and became a tale in its own right.\n\nThe most recent edition includes a previously unpublished essay by\nTolkien, explaining the background and just why the elf-king spent so\nlong in Wooton Major. It also explains how the story grew from this\nfirst idea into the published version.\n\nThe book was originally called “THE GREAT CAKE”, but the title was\nchanged to “SMITH OF WOOTTON MAJOR” in an attempt to suggest an early\nwork by P.G. Wodehouse.\n\nIt is not definitely connected to the Middle-earth legendarium. Both\n_Faery_ and Valinor are lands outside of the normal world, but Valinor\ncannot normally be visited by mortals. There are lesser Elven kingdoms\nthat humans can visit and return: Faramir mentions visitors to Lorien.\n\n\nSummary\n\nThe village of Wootton Major is well-known around the countryside for\nits annual festivals, which are particularly famous for their culinary\ndelights. The biggest festival of them all is the Feast of Good\nChildren. This festival is celebrated only once every twenty-four years,\nand the celebrations take the form of a party to which twenty-four\nchildren of the village are invited. The highpoint of the party is the\nGreat Cake, which is remarkable for its hidden magical ingredients.\nWhoever swallows one of these is given the rare gift of an entry into\nthe Land of Faery.\n\nThis year the magic star hidden inside the Great Cake was eaten by a\nblacksmith’s son. The boy did not feel any of its magical properties at\nonce but on the morning of his tenth birthday the star fixed itself on\nhis forehead and marked him as one intimate with the Faeryfolk. This boy\ngrew up to be a blacksmith like his father, but in his free time he\nroamed into the Land of Faery. The star on his forehead protected him\nfrom the evils threatening mortals in that land, and the Folk called him\nStarbrow and told him about their land and its hidden beauties and\ndangers.\n\nThe years passed and it was now time for another Feast of Good Children.\nSmith had had his precious gift for most of his life now and the time\nhad come for it to be passed on to some other child. So he gave up the\nstar, and the mysterious new Master Cook baked it into the festive cake\nonce more.",
    "author": "J.R.R. Tolkien",
    "editor": "Verlyn Flieger (for the 2005 Expanded Edition)",
    "illustrator": "Pauline Baynes",
    "publisher": "George Allen and Unwin (UK)",
    "released": "9 November 1967 (UK)",
    "format": "Hardcover",
    "pages": "160",
    "isbn": "0007202474"
  },
  {
    "title": "Farmer Giles of Ham",
    "page_id": "3781",
    "text": "FARMER GILES OF HAM (written in 1947, published in 1949) is a short\nMiddle Earth story written by J. R. R. Tolkien. The story describes a\nseries of encounters between Farmer Giles and a wily Dragons named\nChrysophylax. It is set in a fantasy Britain of long ago, which has\nmythical creatures, medieval knights, and primitive firearms. It is\nhappily anachronistic, and is more like a folk-tale than the sweeping\nepics which Tolkien is better known for. The book was originally\nillustrated by Pauline Baynes.\n\n\nPlot\n\nFarmer Giles was not a hero. He was fat and red-bearded and enjoyed a\nslow, comfortable life. One day a rather deaf and short-sighted giant\nblundered on to his land. Farmer Giles managed to scare him away with a\nblunderbluss shot in its general direction. The people of the village\ncheered: Farmer Giles was a hero. His reputation spread far and wide\nacross the kingdom. Giles was rewarded by the King of the Middle\nKingdom, with a sword named Caudimordax or “Tailbiter”, a powerful\nweapon against dragons.\n\nThe giant reports to its monstrous friends that there are no more\nknights, just stinging flies (actually scrap metal from Giles'\nblunderbuss), in the Middle Kingdom. This prompts a dragon, Chrysophylax\nDives, to investigate the area and everyone turns to the accidental hero\nFarmer Giles to deal with it.\n\nThe story makes light of the great dragon-slaying traditions. The\nknights who are supposed to do the job are useless fops more intent on\n“precedence and etiquette” than on noticing huge dragon footprints\nlittering the landscape. “Giles” is also an interesting commentary on\nhow people react to danger. Heroes aren't simply called for, they are\ndemanded and hapless farmers can be forced to be heroes.\n\nThe Latin names and references imply that Giles is a Briton, a late\ngeneration remnant of the old empire after the decline of the western\nauthority of the Romans. All the Giles place-names are supposed to occur\nrelatively close to Oxford, along the Thames or on the route from London\nto Oxford.\n\nAmong the jokes is a question put to “the four wise clerks of Oxenford”;\nTolkien then quotes from the Oxford English Dictionary, on which he had\nworked. The phrase “wise clerk of Oxenford” is also a reference to\nChaucer's Clerk.\n\n“Farmer Giles of Ham” is sometimes published in an omnibus edition with\n“Smith of Wootton Major”, another Tolkien novella with illustrations by\nPauline Baynes.\n\nIt is rumored that farmer Giles in really Hamwise Gamgee but it is very\nunlikely since Hamwise did not believe in Dragons.",
    "author": "J.R.R. Tolkien",
    "released": "October 20, 1949",
    "publisher": "George Allen & Unwin"
  },
  {
    "title": "Tree and Leaf",
    "page_id": "3783",
    "text": "_TREE AND LEAF_ is a collection of works by J. R. R. Tolkien\nincluding an essay “On Fairy-Stories,” a short story called “Leaf by\nNiggle,” a poem called “Mythopoeia,” and a short poem “The Homecoming of\nBeorhtnoth Beorthelm's Son.”\n\nThe book was originally illustrated by Pauline Baynes.\n\nThe stories were published again in 1966 in the collection _THE TOLKIEN\nREADER_, which also includes _Farmer Giles of Ham_, _The Adventures of\nTom Bombadil_, _The Battle of Maldon_, and Peter Beagle's _Tolkien's\nMagic Ring_.",
    "released": "28 May 1964 (UK)\nMarch 1965 (US)",
    "author": "J.R.R. Tolkien",
    "publisher": "George Allen & Unwin (UK)\nHoughton Mifflin (US)"
  },
  {
    "title": "The Fall of Gondolin",
    "page_id": "45985",
    "text": "THE FALL OF GONDOLIN is an upcoming stand-alone publication of the third\npart of the Great Tales, and follow-up to _The Children of Hurin_ (2007)\nand _Beren and Lúthien_ (2017). It also contains a chapter concerning\nthe last of the “Great Tales”: _The Tale of Eärendel_.\n\n\nFrom the publisher\n\n\nCanon\n\n_The Fall of Gondolin_ is the third of the Great Tales, but was the\nfirst written by Tolkien, and is the second most complete of the tales\n(after The Children of Húrin, and is less fractured than the materials\nused to make up Beren and Lúthien (2017) as stand alone and 'continuous'\nas possible).\n\nThe sources that cover this major First Age event are the chapters _The\nFall of Gondolin_ of ''The Book of Lost Tales Part Two __ ''and _Of\nTuor and the Fall of Gondolin_ in _The Silmarillion_, which both tell of\nthe founding of the Elven city of Gondolin (built in secret by Turgon\nand his people), of the arrival Tuor, a prince of the Edain, of the\nbetrayal of the city to Morgoth by Turgon's nephew Maeglin, and of its\nsubsequent destruction by Morgoth's armies. There is also a\nunfinished (consisting of around 130 lines) and unpublished poem: _The\nLay of the Fall of Gondolin._ Sections of _Of Maeglin_, and name list\nin _Parma Eldalamberon volume 15_.\n\nThe _Lost Tales_ chapter goes more in depth than the account in _The\nSilmarillion_, telling notably in detail of Tuor's and Ecthelion's feats\nin battle, and mentioning every captain of the Houses of the\nGondolindrim.\n\nBackground\n\nJ.R.R. Tolkien actually began writing the story that would become “The\nFall of Gondolin” in 1917, in an army barracks on the back of a sheet of\nmilitary marching music. It is more or less the first traceable story he\never wrote down on paper about the Middle-earth legendarium.\n\nBecause Tolkien was constantly revising his First Age stories, the\nnarrative he wrote in 1917 (published posthumously in _The Book of Lost\nTales Part Two_) remains the only full account of the fall of the city.\nThe narrative in _The Silmarillion_ was the result of the editing by his\nson Christopher of various different sources.\n\nA partial new version of “The Fall of Gondolin” was published in the\n_Unfinished Tales_ under the title “Of Tuor and his Coming to Gondolin”.\nActually titled “Of Tuor and the Fall of Gondolin”, this narrative shows\na great expansion of the earlier tale. It can be surmised from this text\nthat Tolkien would have rewritten the entire story, but for reasons that\nare not known he abandoned the text before Tuor actually arrives in the\ncity. For this reason Christopher Tolkien retitled the story before\nincluding it in _Unfinished Tales_.\n"
  }
]
